Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/advanced/command.po
Languages: fr

source: DataLab command line features
fr: Options ligne de commande de DataLab

source: command line, datalab, run, test, demo
fr: ligne de commande, datalab, exécuter, test, démo

source: Command line features
fr: Fonctionnalités de la ligne de commande

source: Run DataLab
fr: Exécuter DataLab

source: To run DataLab from the command line, type the following::
fr: Pour exécuter DataLab depuis la ligne de commande, taper la commande suivante::

source: To show help on command line usage, simply run::
fr: Pour afficher l'aide de l'utilisation en ligne de commande, taper simplement::

source: Open HDF5 file at startup
fr: Ouvrir un fichier HDF5 au démarrage

source: To open HDF5 files, or even import only a specified HDF5 dataset, use the following::
fr: Pour ouvrir des fichiers HDF5, en important éventuellement un dataset précis du fichier HDF5, utiliser l'une des commmandes suivantes::

source: Open HDF5 browser at startup
fr: Ouvrir l'explorateur de fichiers HDF5 au démarrage

source: To open the HDF5 browser at startup, use one of the following commands::
fr: Pour ouvrir l'explorateur de fichiers HDF5 au démarrage, utiliser l'une des commandes suivantes::

source: Run DataLab demo
fr: Mode démonstration de DataLab

source: To execute DataLab demo, run the following::
fr: Pour exécuter le mode de démonstration de DataLab, taper la commande suivante::

source: Run technical validation tests
fr: Exécuter les tests de validation technique

source: Technical validation tests are directly included in individual unit tests and are disseminated throughout the code. The test functions including validation tests are marked with the ``@pytest.mark.validation`` decorator.
fr: Les tests de validation technique sont directement inclus dans les tests unitaires individuels et sont disséminés dans tout le code. Les fonctions de test incluant des tests de validation sont marquées avec le décorateur ``@pytest.mark.validation``.

source: To execute DataLab technical validation tests, run the following::
fr: Pour exécuter les tests de validation technique de DataLab, taper la commande suivante::

source: See section :ref:`validation` for more information on DataLab's validation strategy.
fr: Voir la section :ref:`validation` pour plus d'informations sur la stratégie de validation de DataLab.

source: Run complete test suite
fr: Exécuter l'ensemble des tests

source: To execute all DataLab unit tests, simply run::
fr: Pour exécuter l'ensemble des tests unitaires de DataLab, taper la commande suivante::

source: Run interactive tests
fr: Exécuter les tests interactifs

source: To execute DataLab interactive tests, run the following::
fr: Pour exécuter les tests interactifs de DataLab, taper la commande suivante::
