Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/advanced/instviewer.po
Languages: fr

source: Installation and Configuration
fr: Installation et configuration

source: The **Installation and Configuration** dialog box is a diagnostic tool available from DataLab’s graphical interface. It provides a structured overview of the current installation, user-specific settings, and available plugins and I/O features.
fr: La boîte de dialogue **Installation et configuration** est un outil de diagnostic disponible dans l'interface graphique de DataLab. Elle fournit un aperçu structuré de l'installation actuelle, des paramètres spécifiques à l'utilisateur et des plugins et fonctionnalités d'E/S disponibles.

source: This tool is primarily designed for troubleshooting and verification purposes — whether you are a user trying to understand how DataLab is set up on your system, or a developer validating your plugin integration.
fr: Cet outil est principalement conçu pour le dépannage et la vérification — que vous soyez un utilisateur essayant de comprendre comment DataLab est configuré sur votre système, ou un développeur validant l'intégration de votre plugin.

source: To open the dialog box, go to the "?" menu in the main DataLab window and select **Installation and configuration**. This will open a dialog window that displays all relevant information about your DataLab installation.
fr: Pour ouvrir la boîte de dialogue, allez dans le menu "?" dans la fenêtre principale de DataLab et sélectionnez **Installation et configuration**. Cela ouvrira une boîte de dialogue qui affiche toutes les informations pertinentes sur votre installation de DataLab.

source: The dialog window is divided into **three tabs**, each covering a specific aspect of the environment.
fr: La fenêtre de dialogue est divisée en **trois onglets**, chacun couvrant un aspect spécifique de l'environnement.

source: 1. Installation Configuration
fr: 1. Installation et configuration

source: Installation and configuration (see "?" menu), tab 1
fr: Installation et configuration (voir menu "?"), onglet 1

source: This tab displays system-level information about the DataLab installation, including:
fr: Cet onglet affiche des informations au niveau système sur l'installation de DataLab, y compris :

source: Application version;
fr: Version de l'application ;

source: Platform and operating system;
fr: Système d'exploitation et plateforme ;

source: Whether DataLab is running in frozen (standalone) mode or as a standard Python package;
fr: Si DataLab fonctionne en mode gelé (autonome) ou en tant que package Python standard ;

source: Internal paths used for data storage and plugin discovery;
fr: Chemins internes utilisés pour le stockage de données et la découverte de plugins ;

source: Python interpreter details (version, architecture, paths);
fr: Détails de l'interpréteur Python (version, architecture, chemins) ;

source: Location of the `datalab` package.
fr: Emplacement du package `datalab`.

source: This section is especially useful for debugging path-related issues or confirming the installation context (e.g., standalone vs. pip-installed).
fr: Cette section est particulièrement utile pour déboguer les problèmes liés aux chemins ou confirmer le contexte d'installation (par exemple, autonome ou installé via pip).

source: 2. User Configuration
fr: 2. Configuration utilisateur

source: Installation and configuration (see "?" menu), tab 2
fr: Installation et configuration (voir menu "?"), onglet 2

source: This tab lists user-specific configuration details, through the contents of DataLab's configuration file.
fr: Cet onglet répertorie les détails de configuration spécifiques à l'utilisateur, à travers le contenu du fichier de configuration de DataLab.

source: It helps users verify their personalized settings and ensures that DataLab is reading the correct directories for user-defined plugins or preferences.
fr: Il aide les utilisateurs à vérifier leurs paramètres personnalisés et garantit que DataLab lit les bons répertoires pour les plugins ou préférences définis par l'utilisateur.

source: 3. Plugins and I/O Features
fr: 3. Plugins et fonctionnalités d'E/S

source: Installation and configuration (see "?" menu), tab 3
fr: Installation et configuration (voir menu "?"), onglet 3

source: This tab lists all plugins and I/O handlers currently available in the application.
fr: Cet onglet répertorie tous les plugins et gestionnaires d'E/S actuellement disponibles dans l'application.

source: This view is ideal for verifying that all expected plugins and I/O features are detected, loaded, and functional.
fr: Cette vue est idéale pour vérifier que tous les plugins et fonctionnalités d'E/S attendus sont détectés, chargés et fonctionnels.

source: Usage Tips
fr: Conseils d'utilisation

source: You can copy text from any of the tabs for diagnostic or support purposes.
fr: Vous pouvez copier du texte depuis n'importe quel onglet à des fins de diagnostic ou de support.

source: If a plugin or I/O feature does not appear, check that its filename starts with `datalab_` and that it is located in a recognized plugin directory (see the *User Configuration* tab).
fr: Si un plugin ou une fonctionnalité d'E/S n'apparaît pas, vérifiez que son nom de fichier commence par `datalab_` et qu'il est situé dans un répertoire de plugins reconnu (voir l'onglet *Configuration utilisateur*).

source: Reporting unexpected behavior or any other bug on `GitHub Issues`_ will be greatly appreciated, especially if the contents of this viewer are attached to the report (as well as log files, see :ref:`ref-to-logviewer`).
fr: Signaler un comportement inattendu ou tout autre bug sur `GitHub Issues`_ sera grandement apprécié, surtout si le contenu de ce visualiseur est joint au rapport (ainsi que les fichiers journaux, voir :ref:`ref-to-logviewer`).
