Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/advanced/logviewer.po
Languages: fr

source: DataLab's log viewer
fr: Visualiseur de journaux de bord de DataLab

source: DataLab, log, viewer, crash, bug, report
fr: DataLab, journal, visualiseur, crash, anomalie, rapport

source: Log viewer
fr: Journaux de bord

source: Despite countless efforts (unit testing, test coverage...), DataLab might crash or behave unexpectedly.
fr: Malgré des efforts considérables en matière de tests (tests unitaires, couverture de tests...), DataLab peut s'arrêter inopinément ou se comporter de façon inattendue.

source: For those situations, DataLab provides two logs (located in your home directory):
fr: Pour traiter ce type de situation, DataLab fournit deux types de journaux de bord (localisés dans votre répertoire utilisateur) :

source: "Traceback log", for Python exceptions
fr: "Traceback log", pour les exceptions Python

source: "Faulthandler log", for system failures (e.g. Qt-related crash)
fr: "Faulthandler log", pour les erreurs système (p.ex. crash lié à Qt)

source: The log viewer is accessible from the "?" menu in the main window.
fr: Le visualiseur de journaux de bord est accessible depuis le menu "?" dans la fenêtre principale.

source: DataLab log viewer (see "?" menu)
fr: Journaux de bord DataLab (voir le menu "?")

source: If DataLab crashed or if any Python exception is raised during its execution, those log files will be updated accordingly. DataLab will even notify that new informations are available in log files at next startup. This is an invitation to submit a bug report.
fr: Lorsque DataLab s'arrête brutalement en raison d'une erreur système ou si une exception Python est levée durant son exécution, ces journaux de bord sont mis à jour en conséquence. DataLab notifie même l'utilisateur de la disponibilité de nouvelles informations dans les journaux de bord, lors du prochain démarrage de l'application. Ceci est une invitation à soumettre un rapport d'anomalie.

source: Reporting unexpected behavior or any other bug on `GitHub Issues`_ will be greatly appreciated, especially if those log file contents are attached to the report (as information on your installation configuration, see :ref:`ref-to-instviewer`).
fr: Signaler un comportement inattendu ou tout autre type d'anomalie sur la page `GitHub Issues`_ sera grandement apprécié, d'autant plus si vous prenez soin de joindre le contenu des journaux de bord (ainsi que des informations sur votre configuration, cf. :ref:`ref-to-instviewer`).
