Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/advanced/webapi.po
Languages: fr

source: How to use the DataLab Web API for HTTP/JSON integration
fr: Comment utiliser l'API Web DataLab pour l'intégration HTTP/JSON

source: DataLab, Web API, REST, HTTP, JSON, Jupyter, notebook, integration
fr: DataLab, API Web, REST, HTTP, JSON, Jupyter, notebook, intégration

source: Web API
fr: API Web

source: The DataLab Web API provides a modern **HTTP/JSON interface** for external access to the DataLab workspace. It is the recommended integration path for new projects, especially for Jupyter notebooks and web-based tools.
fr: L'API Web DataLab fournit une interface moderne **HTTP/JSON** pour un accès externe à l'espace de travail DataLab. C'est la voie d'intégration recommandée pour les nouveaux projets, en particulier pour les notebooks Jupyter et les outils basés sur le web.

source: The Web API is available starting from DataLab 1.1. The required dependencies (FastAPI, Uvicorn, Pydantic) are included in the standard DataLab installation.
fr: L'API Web est disponible à partir de DataLab 1.1. Les dépendances requises (FastAPI, Uvicorn, Pydantic) sont incluses dans l'installation standard de DataLab.

source: Overview
fr: Aperçu

source: The Web API enables:
fr: L'API Web permet :

source: **Jupyter notebook integration** via `DataLab-Kernel <https://github.com/DataLab-Platform/DataLab-Kernel>`_
fr: **Intégration de notebooks Jupyter** via `DataLab-Kernel <https://github.com/DataLab-Platform/DataLab-Kernel>`_

source: **WASM/Pyodide compatibility** (no XML-RPC dependency)
fr: **Compatibilité WASM/Pyodide** (pas de dépendance XML-RPC)

source: **External tool integration** (any HTTP client)
fr: **Intégration d'outils externes** (tout client HTTP)

source: Unlike the XML-RPC interface, the Web API:
fr: Contrairement à l'interface XML-RPC, l'API Web :

source: Uses **JSON** for metadata and **NPZ** for binary data (efficient large array transfer)
fr: Utilise **JSON** pour les métadonnées et **NPZ** pour les données binaires (transfert efficace de grands tableaux)

source: Provides **bearer token authentication** for security
fr: Fournit une **authentification par jeton bearer** pour la sécurité

source: Follows **REST conventions** with OpenAPI documentation
fr: Suit les **conventions REST** avec documentation OpenAPI

source: Works in **browser environments** (WASM/Pyodide)
fr: Fonctionne dans les **environnements navigateur** (WASM/Pyodide)

source: Comparison with XML-RPC
fr: Comparaison avec XML-RPC

source: Feature
fr: Fonctionnalité

source: Protocol
fr: Protocole

source: JSON + Binary (NPZ)
fr: JSON + Binaire (NPZ)

source: WASM Support
fr: Support WASM

source: Large Arrays
fr: Grands tableaux

source: Slow (base64)
fr: Lent (base64)

source: Fast (NPZ)
fr: Rapide (NPZ)

source: Authentication
fr: Authentification

source: None
fr: Aucune

source: Bearer Token
fr: Jeton Bearer

source: Quick Start
fr: Démarrage rapide

source: Enabling the Web API
fr: Activer l'API Web

source: There are several ways to enable the Web API server:
fr: Il existe plusieurs façons d'activer le serveur API Web :

source: **Via UI**: File → Web API → Start Web API Server
fr: **Via l'interface** : Fichier → API Web → Démarrer le serveur API Web

source: **Via environment variable**: Set ``DATALAB_WEBAPI_ENABLED=1`` before starting DataLab
fr: **Via variable d'environnement** : Définir ``DATALAB_WEBAPI_ENABLED=1`` avant de démarrer DataLab

source: When started, DataLab displays the server URL and authentication token in a dialog. The status bar also shows the Web API port when the server is running.
fr: Au démarrage, DataLab affiche l'URL du serveur et le jeton d'authentification dans une boîte de dialogue. La barre d'état affiche également le port de l'API Web lorsque le serveur est en cours d'exécution.

source: The default port is **18080** (or the next available port if busy).
fr: Le port par défaut est **18080** (ou le prochain port disponible s'il est occupé).

source: Auto-Discovery
fr: Découverte automatique

source: DataLab-Kernel can automatically discover and connect to a running DataLab instance without any manual configuration. When the Web API starts, DataLab writes connection information to a file that DataLab-Kernel reads automatically.
fr: DataLab-Kernel peut automatiquement découvrir et se connecter à une instance DataLab en cours d'exécution sans aucune configuration manuelle. Lorsque l'API Web démarre, DataLab écrit les informations de connexion dans un fichier que DataLab-Kernel lit automatiquement.

source: **Just load the extension** — no environment variables or explicit connection needed:
fr: **Chargez simplement l'extension** — aucune variable d'environnement ni connexion explicite requise :

source: The auto-discovery mechanism tries the following methods in order:
fr: Le mécanisme de découverte automatique essaie les méthodes suivantes dans l'ordre :

source: **Environment variables** (``DATALAB_WORKSPACE_URL``, ``DATALAB_WORKSPACE_TOKEN``)
fr: **Variables d'environnement** (``DATALAB_WORKSPACE_URL``, ``DATALAB_WORKSPACE_TOKEN``)

source: **Connection file** written by DataLab (native Python only)
fr: **Fichier de connexion** écrit par DataLab (Python natif uniquement)

source: **URL query parameters** (JupyterLite: ``?datalab_url=...&datalab_token=...``)
fr: **Paramètres d'URL** (JupyterLite : ``?datalab_url=...&datalab_token=...``)

source: **Well-known port probing** (``http://127.0.0.1:18080``)
fr: **Sondage du port bien connu** (``http://127.0.0.1:18080``)

source: If discovery fails, DataLab-Kernel starts in standalone mode and you can connect later using ``workspace.connect()``.
fr: Si la découverte échoue, DataLab-Kernel démarre en mode autonome et vous pouvez vous connecter plus tard avec ``workspace.connect()``.

source: Manual Connection (Legacy)
fr: Connexion manuelle (historique)

source: If auto-discovery doesn't work (e.g., running on a different machine), you can set environment variables before starting your notebook kernel:
fr: Si la découverte automatique ne fonctionne pas (par exemple, en cas d'exécution sur une machine différente), vous pouvez définir des variables d'environnement avant de démarrer le noyau de votre notebook :

source: Then in your notebook using DataLab-Kernel:
fr: Puis dans votre notebook utilisant DataLab-Kernel :

source: API Reference
fr: Référence de l'API

source: Base URL: ``http://127.0.0.1:<port>/api/v1``
fr: URL de base : ``http://127.0.0.1:<port>/api/v1``

source: Status Endpoint (No Auth Required)
fr: Point d'accès Status (sans authentification)

source: Method
fr: Méthode

source: Endpoint
fr: Point d'accès

source: Server status and version information
fr: État du serveur et informations de version

source: Object Operations (Auth Required)
fr: Opérations sur les objets (authentification requise)

source: All endpoints below require the ``Authorization: Bearer <token>`` header.
fr: Tous les points d'accès ci-dessous nécessitent l'en-tête ``Authorization: Bearer <token>``.

source: List all objects with metadata (JSON)
fr: Lister tous les objets avec métadonnées (JSON)

source: Get object metadata (JSON)
fr: Obtenir les métadonnées d'un objet (JSON)

source: Delete an object
fr: Supprimer un objet

source: Update object metadata
fr: Mettre à jour les métadonnées d'un objet

source: Binary Data Transfer (Auth Required)
fr: Transfert de données binaires (authentification requise)

source: Download object as NPZ archive
fr: Télécharger l'objet sous forme d'archive NPZ

source: Upload object from NPZ archive
fr: Envoyer un objet depuis une archive NPZ

source: Data Format
fr: Format des données

source: Objects are transferred using NumPy's NPZ format for efficiency.
fr: Les objets sont transférés au format NPZ de NumPy pour plus d'efficacité.

source: SignalObj NPZ Structure
fr: Structure NPZ de SignalObj

source: ImageObj NPZ Structure
fr: Structure NPZ de ImageObj

source: All API endpoints except ``/status`` require a bearer token:
fr: Tous les points d'accès de l'API sauf ``/status`` nécessitent un jeton bearer :

source: The token is generated when the server starts and displayed in the connection dialog.
fr: Le jeton est généré au démarrage du serveur et affiché dans la boîte de dialogue de connexion.

source: Environment Variables
fr: Variables d'environnement

source: Default
fr: Valeur par défaut

source: Bind address
fr: Adresse de liaison

source: Server port
fr: Port du serveur

source: ``18080`` (or next available)
fr: ``18080`` (ou le suivant disponible)

source: Auth token
fr: Jeton d'authentification

source: Generated
fr: Généré

source: Security Model
fr: Modèle de sécurité

source: The Web API implements the following security measures:
fr: L'API Web implémente les mesures de sécurité suivantes :

source: **Localhost binding**: By default, the server only accepts connections from the local machine (127.0.0.1).
fr: **Liaison localhost** : Par défaut, le serveur n'accepte que les connexions provenant de la machine locale (127.0.0.1).

source: **Token authentication**: Every request (except status) must include a valid bearer token.
fr: **Authentification par jeton** : Chaque requête (sauf status) doit inclure un jeton bearer valide.

source: **Explicit opt-in**: Remote binding (0.0.0.0) requires explicit configuration.
fr: **Opt-in explicite** : La liaison distante (0.0.0.0) nécessite une configuration explicite.

source: Localhost Token Bypass
fr: Contournement du jeton pour localhost

source: For simplified local development, you can disable token verification for localhost connections in **Edit → Settings → Web API localhost bypass**.
fr: Pour simplifier le développement local, vous pouvez désactiver la vérification du jeton pour les connexions localhost dans **Édition → Paramètres → Contournement localhost de l'API Web**.

source: When enabled, clients connecting from ``127.0.0.1`` do not need to provide a token. This makes auto-discovery work seamlessly even when the connection file cannot be read (e.g., in JupyterLite or sandboxed environments).
fr: Lorsque cette option est activée, les clients se connectant depuis ``127.0.0.1`` n'ont pas besoin de fournir de jeton. Cela permet à la découverte automatique de fonctionner de manière transparente même lorsque le fichier de connexion ne peut pas être lu (par exemple, dans JupyterLite ou les environnements sandboxés).

source: Only enable localhost bypass when you control all applications running on your machine. Malicious local software could access your data without a token.
fr: N'activez le contournement localhost que lorsque vous contrôlez toutes les applications s'exécutant sur votre machine. Un logiciel malveillant local pourrait accéder à vos données sans jeton.

source: Exposing the API to the network allows anyone with the token to access your data. Use with caution on trusted networks only.
fr: Exposer l'API sur le réseau permet à quiconque possédant le jeton d'accéder à vos données. À utiliser avec précaution uniquement sur des réseaux de confiance.

source: The Web API runs in a separate thread from the Qt GUI. The ``WorkspaceAdapter`` ensures thread-safe access to DataLab objects by marshalling calls to the main thread using Qt's signal/slot mechanism.
fr: L'API Web s'exécute dans un thread séparé de l'interface Qt. Le ``WorkspaceAdapter`` assure un accès thread-safe aux objets DataLab en acheminant les appels vers le thread principal via le mécanisme signal/slot de Qt.

source: The Web API dependencies are included in the standard DataLab installation:
fr: Les dépendances de l'API Web sont incluses dans l'installation standard de DataLab :

source: FastAPI (web framework)
fr: FastAPI (framework web)

source: Uvicorn (ASGI server)
fr: Uvicorn (serveur ASGI)

source: Pydantic (data validation)
fr: Pydantic (validation de données)

source: No additional installation steps are required.
fr: Aucune étape d'installation supplémentaire n'est nécessaire.

source: Programmatic Control
fr: Contrôle programmatique

source: The Web API can also be started and controlled programmatically via the XML-RPC interface, which is useful for automated workflows:
fr: L'API Web peut également être démarrée et contrôlée par programmation via l'interface XML-RPC, ce qui est utile pour les flux de travail automatisés :

source: See Also
fr: Voir aussi

source: :ref:`ref-to-remote-control` for the XML-RPC interface (legacy)
fr: :ref:`ref-to-remote-control` pour l'interface XML-RPC (historique)

source: `DataLab-Kernel documentation <https://github.com/DataLab-Platform/DataLab-Kernel>`_ for Jupyter integration
fr: `Documentation DataLab-Kernel <https://github.com/DataLab-Platform/DataLab-Kernel>`_ pour l'intégration Jupyter
