Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/advanced/api/index.po
Languages: fr

source: GUI
fr: IHM

source: The :mod:`datalab.gui` package contains functionnalities related to the graphical user interface (GUI) of the DataLab project. Those features are mostly specific to DataLab and are not intended to be used independently.
fr: Le package :mod:`datalab.gui` contient des fonctionnalités liées à l'interface graphique (IHM) du projet DataLab. Ces fonctionnalités sont principalement spécifiques à DataLab et ne sont pas destinées à être utilisées de manière indépendante.

source: The purpose of this section of the documentation is to provide an overview of the DataLab GUI architecture and to describe the main features of the modules contained in this package. It is not intended to provide a detailed description of the GUI features, but rather to provide a starting point for the reader who wants to understand the DataLab internal architecture.
fr: Le but de cette section de la documentation est de fournir une vue d'ensemble de l'architecture de l'IHM de DataLab et de décrire les principales fonctionnalités des modules contenus dans ce package. Elle n'a pas pour but de fournir une description détaillée des fonctionnalités de l'IHM, mais plutôt de fournir un point de départ pour le lecteur qui souhaite comprendre l'architecture interne de DataLab.

source: DataLab's main window is composed of several parts, each of them being handled by a specific module of this package:
fr: La fenêtre principale de DataLab est composée de plusieurs parties, chacune d'elles étant gérée par un module spécifique de ce package :

source: **Signal and image panels**: those panels are used to display signals and images and to provide a set of tools to manipulate them. Each data panel relies on a set of modules to handle the GUI features (:mod:`datalab.gui.actionhandler` and :mod:`datalab.gui.objectview`), the data model (:mod:`datalab.gui.objectmodel`), the data visualization (:mod:`datalab.gui.plothandler`), and the data processing (:mod:`datalab.gui.processor`).
fr: Les **panneaux de signaux et d'images** : ces panneaux sont utilisés pour afficher les signaux et les images et pour fournir un ensemble d'outils pour les manipuler. Chaque panneau de données s'appuie sur un ensemble de modules pour gérer les fonctionnalités de l'IHM (:mod:`datalab.gui.actionhandler` et :mod:`datalab.gui.objectview`), le modèle de données (:mod:`datalab.gui.objectmodel`), la visualisation des données (:mod:`datalab.gui.plothandler`) et le traitement des données (:mod:`datalab.gui.processor`).

source: **Macro panel**: this panel is used to display and run macros. It relies on the :mod:`datalab.gui.macroeditor` module to handle the macro edition and execution.
fr: Le **panneau des macros** : ce panneau est utilisé pour afficher et exécuter des macros. Il s'appuie sur le module :mod:`datalab.gui.macroeditor` pour gérer l'édition et l'exécution des macros.

source: **Specialized widgets**: those widgets are used to handle specific features such as ROI edition (:mod:`datalab.gui.roieditor`), Intensity profile edition (:mod:`datalab.gui.profiledialog`), etc.
fr: Les **widgets spécialisés** : ces widgets sont utilisés pour gérer des fonctionnalités spécifiques telles que l'édition des ROI (:mod:`datalab.gui.roieditor`), l'édition des profils d'intensité (:mod:`datalab.gui.profiledialog`), etc.

source: Submodule
fr: Sous-module

source: Purpose
fr: Périmètre

source: DataLab main window and application
fr: Fenêtre principale et application DataLab

source: Signal, image and macro panels
fr: Panneaux de signaux, d'images et de macros

source: Application actions (menus, toolbars, context menu)
fr: Actions de l'application (menus, barres d'outils, menu contextuel)

source: Widgets to display object (signal/image) trees
fr: Widgets pour afficher les arbres d'objets (signal/image)

source: `PlotPy` plot items for representing signals and images
fr: Items graphiques `PlotPy` pour représenter les signaux et les images

source: ROI editor
fr: Éditeur de ROI

source: Processor
fr: Processeur

source: Dock widgets
fr: Widgets de dock

source: HDF5 input/output
fr: Entrée/sortie HDF5
