Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/index.po
Languages: fr

source: General features:
fr: Fonctionnalités générales :

source: Signal processing:
fr: Traitement du signal :

source: Image processing:
fr: Traitement d'image :

source: DataLab features
fr: Fonctionnalités générales de DataLab

source: DataLab, features, validation, signal processing, image processing
fr: DataLab, fonctionnalités, validation, traitement du signal, traitement d'image

source: Features
fr: Fonctionnalités

source: The following sections describe the features of DataLab, the open-source scientific data analysis and visualization platform.
fr: Les paragraphes suivants décrivent les fonctionnalités de DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques.

source: First, the **validation** section explains why and how DataLab is validated - that is another singular and fundamental feature of DataLab.
fr: Tout d'abord, le paragraphe **validation** explique pourquoi et comment DataLab est validé - c'est une autre fonctionnalité singulière et fondamentale de DataLab.

source: Then, the **general features** section describes the general features of DataLab, which concern both the signal and image processing panels.
fr: Ensuite, le paragraphe **fonctionnalités générales** décrit les fonctionnalités générales de DataLab, qui concernent à la fois les panneaux de traitement du signal et d'image.

source: The **signal processing** and **image processing** sections describe the features specific to the signal and image processing panels, respectively.
fr: Les paragraphes **traitement du signal** et **traitement d'image** décrivent les fonctionnalités spécifiques aux panneaux de traitement du signal et d'image, respectivement.

source: Before jumping into the details of other parts of the documentation, it is recommended to start with the :ref:`workspace` page, which describes the basic concepts of DataLab.
fr: Avant de plonger dans les détails des autres parties de la documentation, il est recommandé de commencer par la page :ref:`workspace`, qui décrit les concepts de base de DataLab.

source: For a synthetic overview of the features of DataLab, please refer to the :ref:`key_features` page.
fr: Pour une vue d'ensemble synthétique des fonctionnalités de DataLab, veuillez vous référer à la page :ref:`key_features`.

source: DataLab is a platform for scientific data analysis and visualization. It may be used in a variety of scientific disciplines, including biology, physics, and astronomy. The common ground for all these disciplines is the need to validate the results of computational analysis against ground-truth data. This is a critical step in the scientific method, and it is essential for reproducibility and trust in the results. This is what we call **scientific validation**.
fr: DataLab est une plateforme d'analyse et de visualisation de données scientifiques qui peut être utilisée dans diverses disciplines scientifiques, y compris la biologie, la physique et l'astronomie. Le point commun de toutes ces disciplines est la nécessité de valider les résultats de l'analyse informatique par rapport à des données de référence. Il s'agit d'une étape critique dans la méthode scientifique et elle est essentielle pour la reproductibilité et la confiance dans les résultats. C'est ce que nous appelons la **validation scientifique**.

source: DataLab is also used in industrial applications, where the validation of the results is essential for guaranteeing the quality of the process but a wider range of validation is required to ensure that a maximum of use cases are covered from a functional point of view. This is what we call **functional validation**.
fr: DataLab est également utilisé dans des applications industrielles, où la validation des résultats est essentielle pour garantir la qualité du processus, mais une gamme plus large de validation est nécessaire pour s'assurer qu'un maximum de cas d'utilisation sont couverts d'un point de vue fonctionnel. C'est ce que nous appelons la **validation fonctionnelle**.

source: Thus, DataLab validation may be categorized into two types:
fr: Ainsi, la validation de DataLab peut être classée en deux types :

source: **Scientific validation**: ensures that the results of computational analysis are accurate and reliable.
fr: La **validation scientifique** : garantit que les résultats de l'analyse informatique sont précis et fiables.

source: **Functional validation**: checks that the software behaves as expected in a variety of use cases (classic automated unit test suite).
fr: La **validation fonctionnelle** : vérifie que le logiciel se comporte comme prévu dans une variété de cas d'utilisation (suite de tests unitaires automatisés classique).

source: General features
fr: Fonctionnalités générales

source: This section describes the general features of DataLab, which concern both the signal and image processing panels.
fr: Cette section décrit les fonctionnalités générales de DataLab, qui concernent à la fois les panneaux de traitement du signal et d'image.

source: DataLab main window
fr: Fenêtre principale de DataLab

source: Signal processing
fr: Traitement du signal

source: This section describes the features specific to the signal processing panel. The signal processing panel is the default panel when DataLab is started.
fr: Cette section décrit les fonctionnalités spécifiques au panneau de traitement du signal. Le panneau de traitement du signal est le panneau par défaut lorsque DataLab est démarré.

source: DataLab main window: Signal processing view
fr: Fenêtre principale de DataLab : vue du traitement du signal

source: Image processing
fr: Traitement d'image

source: This section describes the features specific to the image processing panel. The image processing panel can be selected by clicking on the "Images" tab at the bottom-right of the DataLab main window.
fr: Cette section décrit les fonctionnalités spécifiques au panneau de traitement d'image. Le panneau de traitement d'image peut être sélectionné en cliquant sur l'onglet "Images" en bas à droite de la fenêtre principale de DataLab.

source: DataLab main window: Image processing view
fr: Fenêtre principale de DataLab : vue du traitement d'image
