Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/general/remote.po
Languages: fr

source: How to remote control DataLab, the open-source scientific data analysis and visualization platform
fr: Comment contrôler à distance DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques

source: DataLab, remote control, XML-RPC, Python, IDE, Spyder, Jupyter, third-party application, signal, image, HDF5, calculation, processor
fr: DataLab, contrôle à distance, XML-RPC, Python, IDE, Spyder, Jupyter, application tierce, signal, image, HDF5, calcul, processeur

source: Remote controlling
fr: Contrôle à distance

source: DataLab may be controlled remotely using the `XML-RPC`_ protocol which is natively supported by Python (and many other languages). Remote controlling allows to access DataLab main features from a separate process.
fr: DataLab peut être contrôlé à distance en utilisant le protocole `XML-RPC`_ qui est nativement supporté par Python (et beaucoup d'autres langages). Le contrôle à distance permet d'accéder aux principales fonctionnalités de DataLab à partir d'un processus séparé.

source: If you are looking for a lighweight alternative solution to remote control DataLab (i.e. without having to install the whole DataLab package and its dependencies on your environment), please have a look at the `DataLab Simple Client`_ package (`pip install cdlclient`).
fr: Si vous recherchez une solution alternative légère pour contrôler DataLab à distance (c'est-à-dire sans avoir à installer l'ensemble du package DataLab et ses dépendances sur votre environnement), veuillez consulter le package `DataLab Simple Client`_ (`pip install cdlclient`).

source: From an IDE
fr: Depuis un IDE

source: DataLab may be controlled remotely from an IDE (e.g. `Spyder`_ or any other IDE, or even a Jupyter Notebook) that runs a Python script. It allows to connect to a running DataLab instance, adds a signal and an image, and then runs calculations. This feature is exposed by the `RemoteProxy` class that is provided in module ``cdl.proxy``.
fr: DataLab peut être contrôlé à distance depuis un IDE (par exemple `Spyder`_ ou tout autre IDE, ou même un Jupyter Notebook) qui exécute un script Python. Il permet de se connecter à une instance de DataLab en cours d'exécution, d'ajouter un signal et une image, puis d'exécuter des calculs. Cette fonctionnalité est exposée par la classe RemoteProxy fournie dans le module cdl.proxy.

source: From a third-party application
fr: Depuis une application tierce

source: DataLab may also be controlled remotely from a third-party application, for the same purpose.
fr: DataLab peut également être contrôlé à distance depuis une application tierce, dans le même but.

source: If the third-party application is written in Python 3, it may directly use the `RemoteProxy` class as mentioned above. From another language, it is also achievable, but it requires to implement a XML-RPC client in this language using the same methods of proxy server as in the `RemoteProxy` class.
fr: Si l'application tierce est écrite en Python 3, elle peut directement utiliser la classe RemoteProxy comme mentionné ci-dessus. Depuis un autre langage, c'est également réalisable, mais cela nécessite d'implémenter un client XML-RPC dans ce langage en utilisant les mêmes méthodes de serveur proxy que dans la classe RemoteProxy.

source: Data (signals and images) may also be exchanged between DataLab and the remote client application, in both directions.
fr: Les données (signaux et images) peuvent également être échangées entre DataLab et l'application cliente distante, dans les deux sens.

source: The remote client application may be written in any language that supports XML-RPC. For example, it is possible to write a remote client application in Python, Java, C++, C#, etc. The remote client application may be a graphical application or a command line application.
fr: L'application cliente distante peut être écrite dans n'importe quel langage qui prend en charge XML-RPC. Par exemple, il est possible d'écrire une application cliente distante en Python, Java, C++, C#, etc. L'application cliente distante peut être une application graphique ou une application en ligne de commande.

source: The remote client application may be run on the same computer as DataLab or on a different computer. In the latter case, the remote client application must know the IP address of the computer running DataLab.
fr: L'application cliente distante peut être exécutée sur le même ordinateur que DataLab ou sur un ordinateur différent. Dans ce dernier cas, l'application cliente distante doit connaître l'adresse IP de l'ordinateur exécutant DataLab.

source: The remote client application may be run before or after DataLab. In the latter case, the remote client application must try to connect to DataLab until it succeeds.
fr: L'application cliente distante peut être exécutée avant ou après DataLab. Dans ce dernier cas, l'application cliente distante doit essayer de se connecter à DataLab jusqu'à ce qu'elle réussisse.

source: Supported features
fr: Fonctionnalités prises en charge

source: Supported features are the following:
fr: Les fonctionnalités prises en charge sont les suivantes :

source: Switch to signal or image panel
fr: Basculer vers le panneau de signal ou d'image

source: Remove all signals and images
fr: Supprimer tous les signaux et images

source: Save current session to a HDF5 file
fr: Enregistrer la session en cours dans un fichier HDF5

source: Open HDF5 files into current session
fr: Ouvrir des fichiers HDF5 dans la session en cours

source: Browse HDF5 file
fr: Parcourir un fichier HDF5

source: Open a signal or an image from file
fr: Ouvrir un signal ou une image à partir d'un fichier

source: Add a signal
fr: Ajouter un signal

source: Add an image
fr: Ajouter une image

source: Get object list
fr: Obtenir la liste des objets

source: Run calculation with parameters
fr: Exécuter un calcul avec des paramètres

source: The signal and image objects are described on this section: :ref:`ref-to-model`.
fr: Les objets signal et image sont décrits dans cette section : :ref:`ref-to-model`.

source: Some examples are provided to help implementing such a communication between your application and DataLab:
fr: Quelques exemples sont fournis pour aider à implémenter une telle communication entre votre application et DataLab :

source: See module: ``cdl.tests.remoteclient_app``
fr: Voir le module : ``cdl.tests.remoteclient_app``

source: See module: ``cdl.tests.remoteclient_unit``
fr: Voir le module : ``cdl.tests.remoteclient_unit``

source: Screenshot of remote client application test (``cdl.tests.remoteclient_app``)
fr: Capture d'écran du test de l'application cliente distante (``cdl.tests.remoteclient_app``)

source: Examples
fr: Exemples

source: When using Python 3, you may directly use the `RemoteProxy` class as in examples cited above or below.
fr: Lorsque vous utilisez Python 3, vous pouvez utiliser directement la classe `RemoteProxy` comme dans les exemples cités ci-dessus ou ci-dessous.

source: Here is an example in Python 3 of a script that connects to a running DataLab instance, adds a signal and an image, and then runs calculations (the cell structure of the script make it convenient to be used in `Spyder`_ IDE):
fr: Voici un exemple en Python 3 d'un script qui se connecte à une instance de DataLab en cours d'exécution, ajoute un signal et une image, puis exécute des calculs (la structure de cellule du script le rend pratique à utiliser dans l'IDE `Spyder`_):

source: Here is a Python 2.7 reimplementation of this class:
fr: Voici une réimplémentation de cette classe en Python 2.7 :

source: Connection dialog
fr: Boîte de dialogue de connexion

source: The DataLab package also provides a connection dialog that may be used to connect to a running DataLab instance. It is exposed by the :py:class:`cdl.widgets.connection.ConnectionDialog` class.
fr: Le package DataLab fournit également une boîte de dialogue de connexion qui peut être utilisée pour se connecter à une instance de DataLab en cours d'exécution. Elle est exposée par la classe :py:class:`cdl.widgets.connection.ConnectionDialog`.

source: Screenshot of connection dialog (``cdl.widgets.connection.ConnectionDialog``)
fr: Capture d'écran de la boîte de dialogue de connexion (``cdl.widgets.connection.ConnectionDialog``)

source: Example of use:
fr: Exemple d'utilisation :

source: Public API: remote client
fr: API publique : client distant

source: Object representing a proxy/client to DataLab XML-RPC server. This object is used to call DataLab functions from a Python script.
fr: Objet représentant un proxy/client vers le serveur XML-RPC de DataLab. Cet objet est utilisé pour appeler les fonctions de DataLab à partir d'un script Python.

source: Here is a simple example of how to use RemoteClient in a Python script or in a Jupyter notebook:
fr: Voici un exemple simple de l'utilisation de RemoteClient dans un script Python ou dans un notebook Jupyter :

source: Try to connect to DataLab XML-RPC server.
fr: Tentative de connexion au serveur XML-RPC de DataLab.

source: Parameters
fr: Paramètres

source: XML-RPC port to connect to. If not specified, the port is automatically retrieved from DataLab configuration.
fr: Port XML-RPC auquel se connecter. Si non spécifié, le port est automatiquement récupéré à partir de la configuration de DataLab.

source: Timeout in seconds. Defaults to 5.0.
fr: Délai d'attente en secondes. Par défaut, 5.0.

source: Number of retries. Defaults to 10.
fr: Nombre de tentatives. Par défaut, 10.

source: Raises
fr: Lève

source: Unable to connect to DataLab
fr: Impossible de se connecter à DataLab

source: Invalid timeout (must be >= 0.0)
fr: Délai d'attente non valide (doit être >= 0.0)

source: Invalid number of retries (must be >= 1)
fr: Nombre de tentatives non valide (doit être >= 1)

source: Disconnect from DataLab XML-RPC server.
fr: Déconnexion du serveur XML-RPC de DataLab.

source: Return True if connected to DataLab XML-RPC server.
fr: Renvoie True si connecté au serveur XML-RPC de DataLab.

source: Return list of available methods.
fr: Renvoie la liste des méthodes disponibles.

source: Add signal data to DataLab.
fr: Ajouter des données de signal à DataLab.

source: Signal title
fr: Titre du signal

source: X data
fr: Données X

source: Y data
fr: Données Y

source: X unit. Defaults to None.
fr: Unité X. Par défaut, None.

source: Y unit. Defaults to None.
fr: Unité Y. Par défaut, None.

source: X label. Defaults to None.
fr: Libellé X. Par défaut, None.

source: Y label. Defaults to None.
fr: Libellé Y. Par défaut, None.

source: Returns
fr: Renvoie

source: True if signal was added successfully, False otherwise
fr: True si le signal a été ajouté avec succès, False sinon

source: Return type
fr: Type de retour

source: Invalid xdata dtype
fr: Type de données xdata non valide

source: Invalid ydata dtype
fr: Type de données ydata non valide

source: Add image data to DataLab.
fr: Ajouter des données d'image à DataLab.

source: Image title
fr: Titre de l'image

source: Image data
fr: Données de l'image

source: Z unit. Defaults to None.
fr: Unité Z. Par défaut, None.

source: Z label. Defaults to None.
fr: Libellé Z. Par défaut, None.

source: True if image was added successfully, False otherwise
fr: True si l'image a été ajoutée avec succès, False sinon

source: Invalid data dtype
fr: Type de données non valide

source: Call compute function ``name`` in current panel's processor.
fr: Appeler la fonction de calcul ``name`` dans le processeur du panneau en cours.

source: Compute function name
fr: Nom de la fonction de calcul

source: Compute function parameter. Defaults to None.
fr: Paramètre de la fonction de calcul. Par défaut, None.

source: Compute function result
fr: Résultat de la fonction de calcul

source: Get object (signal/image) from index.
fr: Obtenir un objet (signal/image) à partir de l'index.

source: Object number, or object id, or object title. Defaults to None (current object).
fr: Numéro d'objet, ou identifiant d'objet, ou titre d'objet. Par défaut, None (objet en cours).

source: Panel name. Defaults to None (current panel).
fr: Nom du panneau. Par défaut, None (panneau en cours).

source: Object
fr: Objet

source: if object not found
fr: si l'objet n'est pas trouvé

source: Get plot item shapes associated to object (signal/image).
fr: Obtenir les formes géométriques des éléments de tracé associés à l'objet (signal/image).

source: List of plot item shapes
fr: Liste des formes géométriques des éléments de tracé

source: Add object annotations (annotation plot items).
fr: Ajouter des annotations d'objet (éléments de tracé d'annotation).

source: annotation plot items
fr: éléments de tracé d'annotation

source: refresh plot. Defaults to True.
fr: rafraîchir le tracé. Par défaut, True.

source: panel name (valid values: "signal", "image"). If None, current panel is used.
fr: nom du panneau (valeurs valides : "signal", "image"). Si None, le panneau en cours est utilisé.

source: Add object to DataLab.
fr: Ajouter un objet à DataLab.

source: Signal or image object
fr: Objet signal ou image

source: Add a label with object title on the associated plot
fr: Ajouter une étiquette avec le titre de l'objet sur le tracé associé

source: Label title. Defaults to None. If None, the title is the object title.
fr: Titre de l'étiquette. Par défaut, None. Si None, le titre est le titre de l'objet.

source: Close DataLab application
fr: Fermer l'application DataLab

source: Return a context manager to temporarily disable auto refresh.
fr: Renvoie un gestionnaire de contexte pour désactiver temporairement le rafraîchissement automatique.

source: Context manager
fr: Gestionnaire de contexte

source: Example
fr: Exemple

source: Delete metadata of selected objects
fr: Supprimer les métadonnées des objets sélectionnés

source: Refresh plot. Defaults to True.
fr: Rafraîchir le tracé. Par défaut, True.

source: Keep ROI. Defaults to False.
fr: Conserver la ROI. Par défaut, False.

source: Return current panel name.
fr: Renvoie le nom du panneau en cours.

source: Panel name (valid values: "signal", "image", "macro"))
fr: Nom du panneau (valeurs valides : "signal", "image", "macro"))

source: Return groups titles and lists of inner objects uuids and titles.
fr: Renvoie les titres des groupes et les listes des uuids et titres des objets internes.

source: groups titles, lists of inner objects uuids and titles
fr: titres des groupes, listes des uuids et titres des objets internes

source: Get object (signal/image) list for current panel. Objects are sorted by group number and object index in group.
fr: Obtenir la liste des objets (signal/image) pour le panneau en cours. Les objets sont triés par numéro de groupe et index d'objet dans le groupe.

source: panel name (valid values: "signal", "image", "macro"). If None, current data panel is used (i.e. signal or image panel).
fr: nom du panneau (valeurs valides : "signal", "image", "macro"). Si None, le panneau de données en cours est utilisé (c'est-à-dire le panneau de signal ou d'image).

source: List of object titles
fr: Liste des titres des objets

source: if panel not found
fr: si le panneau n'est pas trouvé

source: Get object (signal/image) uuid list for current panel. Objects are sorted by group number and object index in group.
fr: Obtenir la liste des uuids des objets (signal/image) pour le panneau en cours. Les objets sont triés par numéro de groupe et index d'objet dans le groupe.

source: list of object uuids
fr: liste des uuids des objets

source: Return all public methods of the class, except itself.
fr: Renvoie toutes les méthodes publiques de la classe, sauf elle-même.

source: List of public methods
fr: Liste des méthodes publiques

source: Return selected objects uuids.
fr: Renvoie les uuids des objets sélectionnés.

source: If True, also return objects from selected groups.
fr: Si True, renvoie également les objets des groupes sélectionnés.

source: List of selected objects uuids.
fr: Liste des uuids des objets sélectionnés.

source: Return DataLab version.
fr: Renvoie la version de DataLab.

source: DataLab version
fr: Version de DataLab

source: Open DataLab HDF5 browser to Import HDF5 file.
fr: Ouvrir le navigateur HDF5 de DataLab pour importer un fichier HDF5.

source: HDF5 file name
fr: Nom du fichier HDF5

source: Reset all application data. Defaults to None.
fr: Réinitialiser toutes les données de l'application. Par défaut, None.

source: Import macro from file
fr: Importer une macro à partir d'un fichier

source: Filename.
fr: Nom du fichier.

source: Open objects from files in current panel (signals/images).
fr: Ouvrir des objets à partir de fichiers dans le panneau en cours

source: list of file names
fr: liste des noms de fichiers

source: Open a DataLab HDF5 file or import from any other HDF5 file.
fr: Ouvrir un fichier HDF5 de DataLab ou importer à partir de tout autre fichier HDF5.

source: List of HDF5 files to open. Defaults to None.
fr: Liste des fichiers HDF5 à ouvrir. Par défaut, None.

source: Import all objects from HDF5 files. Defaults to None.
fr: Importer tous les objets à partir des fichiers HDF5. Par défaut, None.

source: Raise DataLab window
fr: Faire apparaître la fenêtre de DataLab

source: Reset all application data
fr: Réinitialiser toutes les données de l'application

source: Run macro.
fr: Exécute la macro.

source: Macro number, or macro title. Defaults to None (current macro).
fr: Numéro de macro, ou titre de macro. Par défaut, None (macro en cours).

source: if macro not found
fr: si la macro n'est pas trouvée

source: Save to a DataLab HDF5 file.
fr: Enregistrer dans un fichier HDF5 de DataLab.

source: Select groups in current panel.
fr: Sélectionner des groupes dans le panneau en cours.

source: List of group numbers (1 to N), or list of group uuids, or None to select all groups. Defaults to None.
fr: Liste des numéros de groupe (1 à N), ou liste des uuids de groupe, ou None pour sélectionner tous les groupes. Par défaut, None.

source: panel name (valid values: "signal", "image"). If None, current panel is used. Defaults to None.
fr: nom du panneau (valeurs valides : "signal", "image"). Si None, le panneau en cours est utilisé. Par défaut, None.

source: Select objects in current panel.
fr: Sélectionner des objets dans le panneau en cours.

source: List of object numbers (1 to N) or uuids to select
fr: Liste des numéros d'objet (1 à N) ou uuids à sélectionner

source: Switch to panel.
fr: Basculer vers le panneau.

source: Stop macro.
fr: Arrête la macro.

source: Toggle auto refresh state.
fr: Basculer l'état du rafraîchissement automatique.

source: Auto refresh state
fr: État du rafraîchissement automatique

source: Toggle show titles state.
fr: Basculer l'état d'affichage des titres.

source: Show titles state
fr: État d'affichage des titres

source: Public API: additional methods
fr: API publique : méthodes supplémentaires

source: The remote control class methods (either using the proxy or the remote client) may be completed with additional methods which are dynamically added at runtime. This mechanism allows to access the methods of the processors of DataLab (see :mod:`cdl.core.gui.processor`).
fr: Les méthodes de la classe de contrôle à distance (en utilisant le proxy ou le client distant) peuvent être complétées par des méthodes supplémentaires qui sont ajoutées dynamiquement à l'exécution. Ce mécanisme permet d'accéder aux méthodes des processeurs de DataLab (voir :mod:`cdl.core.gui.processor`).

source: Signal processor
fr: Processeur de signal

source: When working with signals, the methods of :class:`cdl.core.gui.processor.signal.SignalProcessor` may be accessed.
fr: Lorsque vous travaillez avec des signaux, les méthodes de :class:`cdl.core.gui.processor.signal.SignalProcessor` peuvent être accédées.

source: Object handling signal processing: operations, processing, computing
fr: Objet de traitement de signal : opérations, traitement, calcul

source: Compute sum
fr: Calculer la somme

source: Compute sum with a constant
fr: Calculer la somme avec une constante

source: Compute average
fr: Calculer la moyenne

source: Compute product
fr: Calculer le produit

source: Compute product with a constant
fr: Calculer le produit avec une constante

source: Extract Region Of Interest (ROI) from data
fr: Extraire une région d'intérêt (ROI) des données

source: Swap data axes
fr: Permuter les axes des données

source: Compute absolute value
fr: Calculer la valeur absolue

source: Compute real part
fr: Calculer la partie réelle

source: Compute imaginary part
fr: Calculer la partie imaginaire

source: Convert data type
fr: Convertir le type de données

source: Compute Log10
fr: Calculer Log10

source: Compute square root
fr: Calculer la racine carrée

source: Compute power
fr: Calculer la puissance

source: Compute difference between two signals
fr: Calculer la différence entre deux signaux

source: Compute difference with a constant
fr: Calculer la différence avec une constante

source: Compute quadratic difference between two signals
fr: Calculer la différence quadratique entre deux signaux

source: Compute division between two signals
fr: Calculer la division entre deux signaux

source: Compute division by a constant
fr: Calculer la division par une constante

source: Detect peaks from data
fr: Détecter les pics à partir des données

source: Reverse X axis
fr: Inverser l'axe X

source: Normalize data
fr: Normaliser les données

source: Compute derivative
fr: Calculer la dérivée

source: Compute integral
fr: Calculer l'intégrale

source: Compute data linear calibration
fr: Calculer l'étalonnage linéaire des données

source: Compute threshold clipping
fr: Calculer le seuillage des données

source: Compute maximum data clipping
fr: Calculer le seuillage maximum des données

source: Compute gaussian filter
fr: Calculer le filtre gaussien

source: Compute moving average
fr: Calculer la moyenne mobile

source: Compute moving median
fr: Calculer la médiane mobile

source: Compute Wiener filter
fr: Calculer le filtre de Wiener

source: Compute high-pass filter
fr: Calculer le filtre passe-haut

source: Compute band-pass filter
fr: Calculer le filtre passe-bande

source: Compute band-stop filter
fr: Calculer le filtre coupe-bande

source: Compute iFFT
fr: Calculer l'iFFT

source: Compute FFT
fr: Calculer la FFT

source: Compute interpolation
fr: Calculer l'interpolation

source: Compute resampling
fr: Calculer le rééchantillonnage

source: Compute detrending
fr: Calculer l'élimination de la tendance

source: Compute convolution
fr: Calculer la convolution

source: Compute windowing
fr: Calculer le fenêtrage

source: Compute fitting curve
fr: Calculer la courbe de régression

source: Compute polynomial fitting curve
fr: Calculer la courbe de régression polynomiale

source: Compute multi-Gaussian fitting curve
fr: Calculer la courbe de régression multi-Gaussienne

source: Compute FWHM
fr: Calculer la LMH

source: Compute FW at 1/e²
fr: Calculer la largeur à 1/e²

source: Compute data statistics
fr: Calculer les statistiques des données

source: Compute histogram
fr: Calcule l'intégrale

source: Image processor
fr: Processeur d'image

source: When working with images, the methods of :class:`cdl.core.gui.processor.image.ImageProcessor` may be accessed.
fr: Lorsque vous travaillez avec des images, les méthodes de :class:`cdl.core.gui.processor.image.ImageProcessor` peuvent être accédées.

source: Object handling image processing: operations, processing, computing
fr: Objet de traitement d'image : opérations, traitement, calcul

source: Compute base 10 logarithm
fr: Calculer le logarithme en base 10

source: Rotate data arbitrarily
fr: Rotation arbitraire des données

source: Rotate data 90°
fr: Rotation des données de 90°
