Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/general/remote.po
Languages: fr

source: Rotate data 270°
fr: Rotation des données de 270°

source: Flip data horizontally
fr: Retournement horizontal des données

source: Flip data vertically
fr: Retournement vertical des données

source: Distribute images on a grid
fr: Distribuer les images sur une grille

source: Reset image positions
fr: Réinitialiser les positions des images

source: Resize image
fr: Redimensionner l'image

source: Binning image
fr: Binning de l'image

source: Compute average profile
fr: Calculer le profil moyen

source: Compute radial profile
fr: Calculer le profil radial

source: Compute difference between two images
fr: Calculer la différence entre deux images

source: Compute quadratic difference between two images
fr: Calculer la différence quadratique entre deux images

source: Compute division between two images
fr: Calculer la division entre deux images

source: Compute flat field correction
fr: Calculer la correction de champ plat

source: Compute Butterworth filter
fr: Calculer le filtre de Butterworth

source: Compute gamma correction
fr: Calculer la correction gamma

source: Compute log correction
fr: Calculer la correction logarithmique

source: Compute sigmoid correction
fr: Calculer la correction sigmoïde

source: Rescale image intensity levels
fr: Rééchelonner les niveaux d'intensité de l'image

source: Histogram equalization
fr: Égalisation d'histogramme

source: Adaptive histogram equalization
fr: Égalisation d'histogramme adaptative

source: Compute Total Variation denoising
fr: Calculer le débruitage par variation totale

source: Compute bilateral filter denoising
fr: Calculer le débruitage par filtre bilatéral

source: Compute Wavelet denoising
fr: Calculer le débruitage par ondelettes

source: Denoise using White Top-Hat
fr: Débruitage par White Top-Hat

source: Compute all denoising filters
fr: Calculer tous les filtres de débruitage

source: Compute White Top-Hat
fr: Calculer le White Top-Hat

source: Compute Black Top-Hat
fr: Calculer le Black Top-Hat

source: Compute Erosion
fr: Calculer l'érosion

source: Compute Dilation
fr: Calculer la dilatation

source: Compute morphological opening
fr: Calculer l'ouverture morphologique

source: Compute morphological closing
fr: Calculer la fermeture morphologique

source: Compute all morphology filters
fr: Calculer tous les filtres de morphologie

source: Compute Canny filter
fr: Calculer le filtre de Canny

source: Compute Roberts filter
fr: Calculer le filtre de Roberts

source: Compute Prewitt filter
fr: Calculer le filtre de Prewitt

source: Compute Prewitt filter (horizontal)
fr: Calculer le filtre de Prewitt (horizontal)

source: Compute Prewitt filter (vertical)
fr: Calculer le filtre de Prewitt (vertical)

source: Compute Sobel filter
fr: Calculer le filtre de Sobel

source: Compute Sobel filter (horizontal)
fr: Calculer le filtre de Sobel (horizontal)

source: Compute Sobel filter (vertical)
fr: Calculer le filtre de Sobel (vertical)

source: Compute Scharr filter
fr: Calculer le filtre de Scharr

source: Compute Scharr filter (horizontal)
fr: Calculer le filtre de Scharr (horizontal)

source: Compute Scharr filter (vertical)
fr: Calculer le filtre de Scharr (vertical)

source: Compute Farid filter
fr: Calculer le filtre de Farid

source: Compute Farid filter (horizontal)
fr: Calculer le filtre de Farid (horizontal)

source: Compute Farid filter (vertical)
fr: Calculer le filtre de Farid (vertical)

source: Compute Laplace filter
fr: Calculer le filtre de Laplace

source: Compute all edges
fr: Calculer tous les contours

source: Compute image centroid
fr: Calculer le centre de gravité de l'image

source: Compute minimum enclosing circle
fr: Calculer le cercle d'encadrement minimum

source: Compute 2D peak detection
fr: Calculer la détection de pics 2D

source: Compute contour shape fit
fr: Calculer l'ajustement de la forme du contour

source: Compute peak detection based on a circle Hough transform
fr: Calculer la détection de pics basée sur une transformée de Hough circulaire

source: Compute blob detection using Difference of Gaussian method
fr: Calculer la détection de taches en utilisant la méthode de différence de Gaussienne

source: Compute blob detection using Determinant of Hessian method
fr: Calculer la détection de taches en utilisant la méthode du déterminant de Hessian

source: Compute blob detection using Laplacian of Gaussian method
fr: Calculer la détection de taches en utilisant la méthode du Laplacien de Gaussienne

source: Compute blob detection using OpenCV
fr: Calculer la détection de taches en utilisant OpenCV
