Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/signal/menu_roi.po
Languages: fr

source: Regions Of Interest (ROI)
fr: Régions d'intérêt (ROI)

source: This section describes how to manipulate Regions Of Interest (ROIs) for signals in DataLab.
fr: Cette section décrit comment manipuler les régions d'intérêt (ROIs) pour les signaux dans DataLab.

source: Screenshot of the "ROI" menu.
fr: Capture d'écran du menu "ROI".

source: The "ROI" menu allows you to manage Regions Of Interest (ROIs) associated with the current signal.
fr: Le menu "ROI" vous permet de gérer les régions d'intérêt (ROIs) associées au signal actuel.

source: For more information about signal metadata, see the :ref:`sig-menu-edit` section.
fr: Pour plus d'informations sur les métadonnées de signal, voir la section :ref:`sig-menu-edit`.

source: The Regions Of Interest (ROI) are signal areas that are defined by the user to perform specific operations, processing, or analysis on them.
fr: Les régions d'intérêt (ROI) sont des zones de signal définies par l'utilisateur pour effectuer des opérations, des traitements ou des analyses spécifiques sur elles.

source: ROI are taken into account almost in all computing features in DataLab:
fr: Les ROI sont prises en compte presque partout dans les fonctionnalités de calcul de DataLab :

source: The "Operations" menu features are done only on the ROI if one is defined (except if the operation changes the number of points, like interpolation or resampling).
fr: Les fonctionnalités du menu "Opérations" sont effectuées uniquement sur la ROI si elle est définie (sauf si l'opération modifie le nombre de points, comme l'interpolation ou le rééchantillonnage).

source: The "Processing" menu actions are performed only on the ROI if one is defined (except if the destination signal data type is different from the source's, like in the Fourier analysis features).
fr: Les actions du menu "Traitement" sont effectuées uniquement sur la ROI si elle est définie (sauf si le type de données du signal de destination est différent de celui de la source, comme dans les fonctionnalités d'analyse de Fourier).

source: The "Analysis" menu actions are done only on the ROI if one is defined.
fr: Les actions du menu "Analyse" sont effectuées uniquement sur la ROI si elle est définie.

source: ROI are stored as metadata, and thus attached to signal.
fr: Les ROI sont stockées en tant que métadonnées et sont donc attachées au signal.

source: The "ROI" menu allows you to:
fr: Le menu "ROI" vous permet de :

source: "Edit graphically" |edit_roi|: open a dialog box to manage ROI associated with the selected signal (add, remove, move, resize, etc.). The ROI definition dialog is exactly the same as ROI extraction (see below): the ROI is defined by moving the position and adjusting the width of an horizontal range.
fr: "Édition graphique" |edit_roi| : ouvrir une boîte de dialogue pour gérer les ROI associées au signal sélectionné (ajouter, supprimer, déplacer, redimensionner, etc.). La boîte de dialogue de définition des ROI est exactement la même que celle de l'extraction des ROI (voir ci-dessous) : la ROI est définie en déplaçant la position et en ajustant la largeur d'une plage horizontale.

source: A signal with an ROI.
fr: Un signal avec une ROI.

source: "Edit numerically": open a dialog box to edit the parameters of the selected ROIs numerically (i.e. using a simple form). This allows you to define or modify ROIs based on numerical values.
fr: "Édition numérique" : ouvrir une boîte de dialogue pour modifier les paramètres des ROI sélectionnées numériquement (c'est-à-dire à l'aide d'un formulaire simple). Cela vous permet de définir ou de modifier des ROI en fonction de valeurs numériques.

source: "Extract" |signal_roi|: extract the defined ROI from the selected signals. This will create a new signal for each ROI (or a single signal, if the "Extract all ROIs into a single signal" option is selected in the dialog), with the same metadata as the original signal, but with the data corresponding to the ROI only. The new signals will be added to the current workspace.
fr: "Extraire" |signal_roi| : extraire la ROI définie des signaux sélectionnés. Cela créera un nouveau signal pour chaque ROI (ou un seul signal, si l'option "Extraire toutes les ROIs dans un seul signal" est sélectionnée dans la boîte de dialogue), avec les mêmes métadonnées que le signal d'origine, mais avec les données correspondant uniquement à la ROI. Les nouveaux signaux seront ajoutés à l'espace de travail actuel.

source: "Copy" |roi_copy|: copy the defined ROI from the selected signals to the clipboard. This allows you to paste the ROI into another signal or use it in other operations.
fr: "Copier" |roi_copy| : copier la ROI définie des signaux sélectionnés dans le presse-papiers. Cela vous permet de coller la ROI dans un autre signal ou de l'utiliser dans d'autres opérations.

source: "Paste" |roi_paste|: paste the copied ROI from the clipboard to the selected signals. This will add the ROI to the signals, allowing you to define or modify ROIs based on previously copied ones.
fr: "Coller" |roi_paste| : coller la ROI copiée du presse-papiers dans les signaux sélectionnés. Cela ajoutera la ROI aux signaux, vous permettant de définir ou de modifier des ROI en fonction de celles précédemment copiées.

source: "Import" |roi_import|: import ROIs from a file. This allows you to load previously saved ROIs into the current signal.
fr: "Importer" |roi_import| : importer des ROI à partir d'un fichier. Cela vous permet de charger des ROI précédemment enregistrées dans le signal actuel.

source: "Export" |roi_export|: export the defined ROIs to a file. This allows you to save the ROIs for later use or to share them with others.
fr: "Exporter" |roi_export| : exporter les ROI définies vers un fichier. Cela vous permet de sauvegarder les ROI pour une utilisation ultérieure ou de les partager avec d'autres.

source: "Remove all" |roi_delete|: remove all defined ROI for the selected signals.
fr: "Supprimer tout" |roi_delete| : supprimer toutes les ROI définies pour les signaux sélectionnés.

source: ROI extraction dialog: the ROI is defined by moving the position and adjusting the width of an horizontal range.
fr: Boîte de dialogue d'extraction des ROI : la ROI est définie en déplaçant la position et en ajustant la largeur d'une plage horizontale.
