Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/signal/menu_processing.po
Languages: fr

source: Processing Signals
fr: Traitement des signaux

source: This section describes the signal processing features available in DataLab.
fr: Cette section décrit les fonctionnalités de traitement de signal disponibles dans DataLab.

source: :ref:`sig-menu-operations` for more information on operations that can be performed on signals, or :ref:`sig-menu-analysis` for information on analysis features on signals.
fr: :ref:`sig-menu-operations` pour plus d'informations sur les opérations qui peuvent être effectuées sur les signaux, ou :ref:`sig-menu-analysis` pour des informations sur les fonctionnalités d'analyse des signaux.

source: Screenshot of the "Processing" menu.
fr: Capture d'écran du menu "Traitement".

source: When the "Signal Panel" is selected, the menus and toolbars are updated to provide signal-related actions.
fr: Lorsque le "Panneau Signal" est sélectionné, les menus et barres d'outils sont mis à jour pour fournir les actions liées aux signaux.

source: The "Processing" menu allows you to perform various processing on the selected signals, such as smoothing, normalization, or interpolation.
fr: Le menu "Traitement" permet d'effectuer divers traitements sur les signaux sélectionnés, tels que le lissage, la normalisation, ou encore l'interpolation.

source: Axis transformation
fr: Transformation des axes

source: Linear calibration
fr: Étalonnage linéaire

source: Create a new signal which is a linear calibration of each selected signal with respect to X or Y axis:
fr: Crée un signal à partir de l'étalonnage linéaire (par rapport aux axes X et Y) de chaque signal sélectionné.

source: Parameter
fr: Paramètre

source: X-axis
fr: Axe des X

source: Y-axis
fr: Axe des Y

source: Swap X/Y axes
fr: Permuter les axes X/Y

source: Create a new signal which is the result of swapping X/Y data.
fr: Crée un signal à partir des données inversées X/Y du signal sélectionné.

source: Reverse X-axis
fr: Inverser l'axe des X

source: Create a new signal which is the result of reversing X data.
fr: Crée un signal à partir des données inversées de l'axe des X du signal sélectionné.

source: Convert to Cartesian coordinates
fr: Convertir en coordonnées cartésiennes

source: Create a new signal which is the result of converting polar coordinates to Cartesian coordinates.
fr: Crée un signal en convertissant les coordonnées polaires en coordonnées cartésiennes.

source: Convert to polar coordinates
fr: Convertir en coordonnées polaires

source: Create a new signal which is the result of converting Cartesian coordinates to polar coordinates.
fr: Crée un signal en convertissant les coordonnées cartésiennes en coordonnées polaires.

source: Level adjustment
fr: Ajustement des niveaux

source: Normalize
fr: Normaliser

source: Create a new signal which is the normalization of each selected signal by maximum, amplitude, sum, energy or RMS:
fr: Crée un signal à partir de la normalisation de chaque signal sélectionné par maximum, amplitude, somme, énergie ou RMS :

source: Normalization
fr: Normalisation

source: :math:`y_{1}= \dfrac{y_{0}'}{max(y_{0}')}` with :math:`y_{0}'=y_{0}-min(y_{0})`
fr: :math:`y_{1}= \dfrac{y_{0}'}{max(y_{0}')}` avec :math:`y_{0}'=y_{0}-min(y_{0})`

source: Area
fr: Aire

source: Energy
fr: Energie

source: Clipping
fr: Ecrêtage

source: Create a new signal which is the result of clipping each selected signal.
fr: Crée un signal à partir de l'écrêtage de chaque signal sélectionné.

source: Offset correction
fr: Soustraction d'offset

source: Create a new signal which is the result of offset correction of each selected signal. This operation is performed by subtracting the signal baseline which is estimated by the mean value of a user-defined range.
fr: Crée un signal à partir de la soustraction d'offset de chaque signal sélectionné. Cette opération est réalisée en soustrayant la valeur moyenne d'une plage définie par l'utilisateur.

source: Noise reduction
fr: Réduction de bruit

source: Create a new signal which is the result of noise reduction of each selected signal.
fr: Crée un signal à partir du débruitage de chaque signal sélectionné.

source: The following filters are available:
fr: Les filtres suivants sont disponibles :

source: Filter
fr: Filtre

source: Formula/implementation
fr: Formule/implémentation

source: Gaussian filter
fr: Filtre gaussien

source: Moving average
fr: Moyenne mobile

source: Moving median
fr: Médiane mobile

source: Wiener filter
fr: Filtre de Wiener

source: Fourier analysis
fr: Analyse de Fourier

source: Create a new signal which is the result of a Fourier analysis of each selected signal.
fr: Crée un signal à partir de l'analyse de Fourier de chaque signal sélectionné.

source: The following functions are available:
fr: Les fonctions suivantes sont disponibles :

source: Function
fr: Fonction

source: Fast Fourier Transform
fr: Transformée de Fourier rapide

source: Inverse FFT
fr: FFT inverse

source: Inverse Fast Fourier Transform
fr: Transformée de Fourier rapide inverse

source: Magnitude spectrum
fr: Spectre d'amplitude

source: Optionnal: use logarithmic scale (dB)
fr: Optionnel : utiliser une échelle logarithmique (dB)

source: :math:`y_{1} = |FFT(y_{0})|` or :math:`20.log_{10}(|FFT(y_{0})|)` (dB)
fr: :math:`y_{1} = |FFT(y_{0})|` ou :math:`20.log_{10}(|FFT(y_{0})|)` (dB)

source: Phase spectrum
fr: Spectre de phase

source: Power spectral density (PSD)
fr: Densité spectrale de puissance (PSD)

source: Optionnal: use logarithmic scale (dB). PSD is estimated using Welch's method (see `scipy.signal.welch <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.welch.html>`_)
fr: Optionnel : utiliser une échelle logarithmique (dB). La PSD est estimée en utilisant la méthode de Welch (voir `scipy.signal.welch <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.welch.html>`_)

source: :math:`Y_{k} = PSD(y_{k})` or :math:`10.log_{10}(PSD(y_{k}))` (dB)
fr: :math:`Y_{k} = PSD(y_{k})` ou :math:`10.log_{10}(PSD(y_{k}))` (dB)

source: FFT and inverse FFT are performed using frequency shifting if the option is enabled in DataLab settings (see :ref:`settings`).
fr: La FFT et la FFT inverse sont effectuées en utilisant un décalage de fréquence si l'option est activée dans les paramètres de DataLab (voir :ref:`settings`).

source: Frequency filters
fr: Filtres fréquentiels

source: Create a new signal which is the result of applying a frequency filter to each selected signal.
fr: Crée un signal à partir de l'application d'un filtre fréquentiel à chaque signal sélectionné.

source: Filter out high frequencies, above a cutoff frequency
fr: Filtre les hautes fréquences, au-dessus d'une fréquence de coupure

source: Filter out low frequencies, below a cutoff frequency
fr: Filtre les basses fréquences, en-dessous d'une fréquence de coupure

source: Filter out frequencies outside a range
fr: Filtre les fréquences en dehors d'une plage

source: Filter out frequencies inside a range
fr: Filtre les fréquences à l'intérieur d'une plage

source: For each filter, the following methods are available:
fr: Pour chaque filtre, les méthodes suivantes sont disponibles :

source: Method
fr: Méthode

source: Bessel filter, using SciPy's `scipy.signal.bessel <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.bessel.html>`_ function
fr: Filtre de Bessel, utilisant la fonction `scipy.signal.bessel <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.bessel.html>`_

source: Butterworth filter, using SciPy's `scipy.signal.butter <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.butter.html>`_ function
fr: Filtre de Butterworth, utilisant la fonction `scipy.signal.butter <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.butter.html>`_

source: Chebyshev type I filter, using SciPy's `scipy.signal.cheby1 <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.cheby1.html>`_ function
fr: Filtre de Chebyshev de type I, utilisant la fonction `scipy.signal.cheby1 <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.cheby1.html>`_

source: Chebyshev type II filter, using SciPy's `scipy.signal.cheby2 <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.cheby2.html>`_ function
fr: Filtre de Chebyshev de type II, utilisant la fonction `scipy.signal.cheby2 <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.cheby2.html>`_

source: Elliptic filter, using SciPy's `scipy.signal.ellip <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.ellip.html>`_ function
fr: Filtre elliptique, utilisant la fonction `scipy.signal.ellip <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.ellip.html>`_

source: Fitting
fr: Ajustement

source: Open an interactive curve fitting tool in a modal dialog box.
fr: Ouvre une boîte de dialogue permettant de réaliser des ajustements de courbe de manière interactive.

source: Model
fr: Modèle

source: Linear
fr: Linéaire

source: Gaussian
fr: Gaussienne

source: Lorentzian
fr: Lorentzienne

source: :math:`y = y_{0}+A.\dfrac{Re(exp(-z^2).erfc(-j.z))}{\sqrt{2\pi}.\sigma}` with :math:`z = \dfrac{x-x_{0}-j.\sigma}{\sqrt{2}.\sigma}`
fr: :math:`y = y_{0}+A.\dfrac{Re(exp(-z^2).erfc(-j.z))}{\sqrt{2\pi}.\sigma}` avec :math:`z = \dfrac{x-x_{0}-j.\sigma}{\sqrt{2}.\sigma}`

source: Multi-Gaussian
fr: Multi-gaussien

source: Exponential
fr: Exponentielle

source: Sinusoidal
fr: Sinusoïdal

source: Cumulative Distribution Function (CDF)
fr: Fonction de distribution cumulative (CDF)

source: Windowing
fr: Fenêtrage

source: Create a new signal which is the result of applying a window function to each selected signal.
fr: Crée un signal à partir de l'application d'une fonction de fenêtrage à chaque signal sélectionné.

source: The following window functions are available:
fr: Les fonctions de fenêtrage suivantes sont disponibles :

source: Window function
fr: Fonction de fenêtrage

source: Reference
fr: Référence

source: Cosine
fr: Cosinus

source: Rectangular
fr: Rectangulaire

source: Detrending
fr: Elimination de tendance

source: Create a new signal which is the detrending of each selected signal. This features is based on SciPy's `scipy.signal.detrend <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.detrend.html>`_ function.
fr: Crée un signal à partir de l'élimination de tendance de chaque signal. Cette fonctionnalité est basée sur la fonction `scipy.signal.detrend <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.detrend.html>`_ de SciPy.

source: The following parameters are available:
fr: Les paramètres suivants sont disponibles :

source: Detrending method: 'linear' or 'constant'. See SciPy's `scipy.signal.detrend <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.detrend.html>`_ function.
fr: Méthode d'élimination de tendance : 'linéaire' ou 'constante'. Voir la fonction `scipy.signal.detrend <https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.detrend.html>`_ de SciPy.

source: Create a new signal which is the interpolation of each selected signal with respect to a second signal X-axis (which might be the same as one of the selected signals).
fr: Crée un signal à partir de l'interpolation de chaque signal sélectionné, par rapport à l'axe X d'un second signal (qui peut être l'un des signaux sélectionnés).

source: The following interpolation methods are available:
fr: Les méthodes d'interpolation suivantes sont disponibles :

source: Linear interpolation, using using NumPy's `interp <https://docs.scipy.org/doc/numpy/reference/generated/numpy.interp.html>`_ function
fr: Interpolation linéaire, utilisant la fonction `interp <https://docs.scipy.org/doc/numpy/reference/generated/numpy.interp.html>`_ de NumPy.

source: Cubic spline interpolation, using using SciPy's `scipy.interpolate.splev <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.splev.html>`_ function
fr: Interpolation par spline cubique, utilisant la fonction `scipy.interpolate.splev <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.splev.html>`_ de SciPy.

source: Quadratic
fr: Quadratique

source: Quadratic interpolation, using using NumPy's `polyval <https://docs.scipy.org/doc/numpy/reference/generated/numpy.polyval.html>`_ function
fr: Interpolation quadratique, utilisant la fonction `polyval <https://docs.scipy.org/doc/numpy/reference/generated/numpy.polyval.html>`_ de NumPy.

source: Cubic
fr: Cubique

source: Cubic interpolation, using using SciPy's `Akima1DInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.Akima1DInterpolator.html>`_ class
fr: Interpolation cubique, utilisant la classe `Akima1DInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.Akima1DInterpolator.html>`_ de SciPy.

source: Barycentric
fr: Barycentrique

source: Barycentric interpolation, using using SciPy's `BarycentricInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.BarycentricInterpolator.html>`_ class
fr: Interpolation barycentrique, utilisant la classe `BarycentricInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.BarycentricInterpolator.html>`_ de SciPy.

source: Piecewise Cubic Hermite Interpolating Polynomial (PCHIP) interpolation, using using SciPy's `PchipInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.PchipInterpolator.html>`_ class
fr: Interpolation par polynôme de Hermite cubique par morceaux (PCHIP), utilisant la classe `PchipInterpolator <https://docs.scipy.org/doc/scipy/reference/generated/scipy.interpolate.PchipInterpolator.html>`_ de SciPy.

source: Resampling
fr: Rééchantillonnage

source: Create a new signal which is the resampling of each selected signal.
fr: Crée un signal à partir du rééchantillonnage de chaque signal.

source: Interpolation method (see previous section)
fr: Méthode d'interpolation (voir section précédente)

source: Fill value
fr: Valeur de remplissage

source: Interpolation fill value (see previous section)
fr: Valeur de remplissage pour l'interpolation (voir section précédente)

source: Minimum X value
fr: Borne inférieure

source: Maximum X value
fr: Borne supérieure

source: Resampling mode: step size or number of points
fr: Mode de rééchantillonnage : pas ou nombre de points

source: Step size
fr: Pas

source: Resampling step size
fr: Pas de rééchantillonnage

source: Number of points
fr: Nombre de points

source: Resampling number of points
fr: Nombre de points de rééchantillonnage

source: Stability analysis
fr: Analyse de stabilité

source: Create a new signal which is the result of a stability analysis of each selected signal.
fr: Crée un signal à partir de l'analyse de stabilité de chaque signal

source: The following stability analysis methods are available:
fr: Les méthodes d'analyse de stabilité suivantes sont disponibles :

source: Allan variance
fr: Variance d'Allan

source: Measure of the stability of a signal: defined as the variance of the difference between two successive measurements as a function of the time interval between them.
fr: Mesure de la stabilité d'un signal : définie comme la variance de la différence entre deux mesures successives en fonction de l'intervalle de temps entre elles.

source: Allan deviation
fr: Ecart-type d'Allan

source: Square root of the Allan variance.
fr: Racine carrée de la variance d'Allan.

source: Overlapping Allan deviation
fr: Ecart-type d'Allan avec recouvrement

source: A more robust version of the Allan variance that overlaps successive segments to improve statistical confidence.
fr: Une version plus robuste de la variance d'Allan qui recoupe les segments successifs pour améliorer la confiance statistique.

source: Modified Allan variance
fr: Variance d'Allan modifiée

source: A variation of the Allan variance that accounts for phase noise by introducing a filtering operation.
fr: Une variation de la variance d'Allan qui tient compte du bruit de phase en introduisant une opération de filtrage.

source: Hadamard variance
fr: Variance de Hadamard

source: An alternative to Allan variance, more robust to linear frequency drift in the signal
fr: Une alternative à la variance d'Allan, plus robuste aux dérives de fréquence linéaires dans le signal.

source: Total variance
fr: Variance totale

source: Extends the Allan variance concept to cover all possible averaging intervals.
fr: Etend le concept de variance d'Allan pour couvrir tous les intervalles de moyenne possibles.

source: Time deviation
fr: Déviation temporelle

source: Derived from Allan deviation, quantifies stability in terms of time rather than frequency.
fr: Dérivée de la déviation d'Allan, quantifie la stabilité en termes de temps plutôt que de fréquence.

source: The "All stability features" option allows to compute all stability analysis methods at once.
fr: L'option "Toutes les analyses de stabilité" permet de calculer toutes les méthodes d'analyse de stabilité en une seule fois.

source: ROI extraction
fr: Extraction de ROI

source: Create a new signal from a user-defined Region of Interest (ROI).
fr: Crée un signal à partir d'une région d'intérêt (ROI) définie par l'utilisateur.

source: ROI extraction dialog: the ROI is defined by moving the position and adjusting the width of an horizontal range.
fr: Boîte de dialogue d'extraction de ROI : la région d'intérêt (ROI) est définie en ajustant la position et la largeur de l'échelle horizontale de sélection.
