Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/signal/menu_analysis.po
Languages: fr

source: Analysis features on Signals
fr: Analyse sur les signaux

source: This section describes the signal analysis features available in DataLab.
fr: Cette section décrit les fonctionnalités d'analyse de signaux disponibles dans DataLab.

source: :ref:`sig-menu-operations` for more information on operations that can be performed on signals, or :ref:`sig-menu-processing` for information on processing features on signals.
fr: :ref:`sig-menu-operations` pour plus d'informations sur les opérations qui peuvent être effectuées sur les signaux, ou :ref:`sig-menu-processing` pour des informations sur les fonctionnalités de traitement des signaux.

source: Screenshot of the "Analysis" menu.
fr: Capture d'écran du menu Analyse".

source: When the "Signal Panel" is selected, the menus and toolbars are updated to provide signal-related actions.
fr: Lorsque le "Panneau Signal" est sélectionné, les menus et barres d'outils sont mis à jour pour fournir les actions liées aux signaux.

source: The "Analysis" menu allows you to perform various computations on the selected signals, such as statistics, full width at half-maximum, or full width at 1/e².
fr: Le menu Analyse" permet d'effectuer divers calculs sur les signaux sélectionnés, tels que des statistiques, la largeur à mi-hauteur, ou encore la largeur à 1/e².

source: In DataLab vocabulary, an "analysis" is a feature that computes a scalar result from a signal. This result is stored as metadata, and thus attached to signal. This is different from a "processing" which creates a new signal from an existing one.
fr: Dans le vocabulaire de DataLab, un "analyse" est une fonctionnalité qui calcule un résultat scalaire à partir d'un signal. Ce résultat est stocké sous la forme de métadonnées ; il est donc attaché au signal. Cela diffère d'un "traitement" qui crée un nouveau signal à partir d'un signal existant.

source: Statistics
fr: Statistiques

source: Compute statistics on selected signal and show a summary table.
fr: Calcule des statistiques sur les signaux sélectionnés et affiche un tableau récapitulatif.

source: Example of statistical summary table: each row is associated to an ROI (the first row gives the statistics for the whole data).
fr: Exemple de tableau récapitulatif de statistiques : chaque ligne est associée à une ROI (à l'exception de la première qui correspond aux statistiques calculées sur la totalité des données).

source: Histogram
fr: Histogramme

source: Compute histogram of selected signal and show it.
fr: Calcule l'histogramme du signal sélectionné et l'affiche.

source: Parameters are:
fr: Paramètres :

source: Parameter
fr: Paramètre

source: Bins
fr: Classes

source: Number of bins
fr: Nombre de classes

source: Lower limit
fr: Limite inférieure

source: Lower limit of the histogram
fr: Limite inférieure de l'histogramme

source: Upper limit
fr: Limite supérieure

source: Upper limit of the histogram
fr: Limite supérieure de l'histogramme

source: Example of histogram.
fr: Exemple d'histogramme.

source: Full width at half-maximum
fr: Largeur à mi-hauteur

source: Compute the Full Width at Half-Maximum (FWHM) of selected signal, using one of the following methods:
fr: Calcule la largeur à mi-hauteur (LMH) du signal sélectionné, en utilisant l'une des méthodes suivantes :

source: Method
fr: Méthode

source: Zero-crossing
fr: Passage par zéro

source: Find the zero-crossings of the signal after having centered its amplitude around zero
fr: Recherche les passages par zéro du signal après avoir centré son amplitude autour de zéro

source: Fit data to a Gaussian model using least-square method
fr: Ajuste les données à un modèle gaussien en utilisant un algorithme de moindres carrés

source: Fit data to a Lorentzian model using least-square method
fr: Ajuste les données à un modèle lorentzien en utilisant un algorithme de moindres carrés

source: Fit data to a Voigt model using least-square method
fr: Ajuste les données à un modèle de Voigt en utilisant un algorithme de moindres carrés

source: The computed result is displayed as an annotated segment.
fr: Le résultat du calcul est affiché sous la forme d'un segment annoté.

source: Full width at 1/e²
fr: Largeur à 1/e²

source: Fit data to a Gaussian model using least-square method. Then, compute the full width at 1/e².
fr: Réalise l'ajustement des données à une gaussienne en utilisant un algorithme de moindres carrés. Calcule ensuite la largeur à 1/e² du modèle d'ajustement.

source: Computed scalar results are systematically stored as metadata. Metadata is attached to signal and serialized with it when exporting current session in a HDF5 file.
fr: Les résultats de calcul scalaires sont systématiquement stockés dans les métadonnées. Les métadonnées sont attachées au signal et sérialisées avec ce dernier par exemple lors de l'export d'une session de DataLab vers un fichier HDF5.

source: Arguments of the min and max
fr: Abscisse du minimum et du maximum

source: Compute the smallest argument of the minima and the smallest argument of the maxima of the selected signal.
fr: Calcule le plus petit argument du minimum et le plus petit argument du maximum du signal sélectionné.

source: Abscissa at y=...
fr: Abscisse pour y=...

source: Compute the abscissa at a given ordinate value for the selected signal. If there is no solution, the displayed result is NaN. If there are multiple solutions, the displayed result is the smallest value.
fr: Calcule l'abscisse pour une ordonnée donnée du signal sélectionné. Si aucune solution n'est trouvée, le résultat affiché est NaN. Si plusieurs solutions existent, le résultat affiché est la plus petite valeur.

source: Peak detection
fr: Détection de pics

source: Create a new signal from semi-automatic peak detection of each selected signal.
fr: Crée un signal à partir de la détection automatique des pics de chaque signal sélectionné :

source: Peak detection dialog: threshold is adjustable by moving the horizontal marker, peaks are detected automatically (see vertical markers with labels indicating peak position)
fr: Boîte de dialogue de détection de pics : le seuil de détection est ajustable en déplaçant le curseur horizontal, les pics sont détectés automatiquement (des marqueurs verticaux indiquent les pics détectés avec leur position)

source: Sampling rate and period
fr: Fréquence et période d'échantillonnage

source: Compute the sampling rate and period of selected signal.
fr: Calcule la fréquence et la période d'échantillonnage du signal sélectionné.

source: This feature assumes that the X values are regularly spaced.
fr: Cette fonctionnalité suppose que les valeurs de X sont régulièrement espacées.

source: Dynamic parameters
fr: Paramètres dynamiques

source: Compute the following dynamic parameters on selected signal:
fr: Calcule les paramètres dynamiques suivants sur le signal sélectionné :

source: Frequency (sinusoidal fit)
fr: Fréquence (ajustement sinusoïdal)

source: Effective Number Of Bits
fr: Bits effectifs

source: Signal-to-Noise Ratio
fr: Rapport signal/bruit

source: Signal-to-Noise And Distortion Ratio
fr: Rapport signal/bruit et distorsion

source: Total Harmonic Distortion
fr: Distorsion harmonique totale

source: Spurious-Free Dynamic Range
fr: Dynamique sans distorsion

source: Bandwidth at -3 dB
fr: Bande passante à -3 dB

source: Determine the bandwidth at -3 dB by identifying the range of abscissa values where the signal remains greater than its maximum value minus 3 dB.
fr: Détermine la bande passante à -3 dB en identifiant l'intervalle des valeurs d'abscisse où le signal reste supérieur à sa valeur maximale moins 3 dB.

source: This feature requires that the signal is expressed in decibels (dB).
fr: Cette fonctionnalité nécessite que le signal soit exprimé en décibels (dB).

source: Contrast
fr: Contraste

source: Compute the contrast of selected signal.
fr: Calcule le contraste du signal sélectionné.

source: The contrast is defined as the ratio of the difference and the sum of the maximum and minimum values:
fr: Le contraste est défini comme le rapport de la différence et de la somme des valeurs maximale et minimale :

source: This feature assumes that the signal is a profile from an image, where the contrast is meaningful. This justifies the optical definition of contrast.
fr: Cette fonctionnalité suppose que le signal est un profil extrait d'une image, pour laquelle le contraste a un sens. Cela justifie la définition optique du contraste.

source: Extract pulse features
fr: Extraction des caractéristiques d'impulsions

source: Perform comprehensive pulse analysis on selected signals, automatically extracting timing and amplitude characteristics for step and square pulse signals.
fr: Effectue une analyse complète des impulsions sur les signaux sélectionnés, en extrayant automatiquement les caractéristiques temporelles et d'amplitude pour les signaux d'échelon et d'impulsions carrées.

source: This feature provides automated pulse characterization with intelligent signal type recognition and robust parameter extraction for digital signal analysis, oscilloscope measurements, and pulse timing validation.
fr: Cette fonctionnalité fournit une caractérisation automatisée des impulsions avec reconnaissance intelligente du type de signal et extraction robuste de paramètres pour l'analyse de signaux numériques, les mesures d'oscilloscope et la validation temporelle des impulsions.

source: **Key Capabilities:**
fr: **Fonctionnalités clés :**

source: **Automated signal recognition**: Heuristically identifies signal type (step, square, or other) for optimal analysis
fr: **Reconnaissance automatique du signal** : Identifie de façon heuristique le type de signal (échelon, carré ou autre) pour une analyse optimale

source: **Polarity detection**: Automatically determines positive/negative pulse polarity using baseline comparison
fr: **Détection de polarité** : Détermine automatiquement la polarité positive/négative de l'impulsion en utilisant la comparaison de ligne de base

source: **Comprehensive timing measurements**: Extracts rise time, fall time, FWHM, and timing parameters at specific amplitude fractions
fr: **Mesures temporelles complètes** : Extrait le temps de montée, le temps de descente, la largeur à mi-hauteur (FWHM) et les paramètres temporels à des fractions d'amplitude spécifiques

source: **Baseline characterization**: Analyzes start and end baseline regions for accurate feature computation
fr: **Caractérisation de la ligne de base** : Analyse les régions de ligne de base de début et de fin pour un calcul précis des caractéristiques

source: **Robust algorithms**: Uses advanced statistical methods with noise tolerance and error handling
fr: **Algorithmes robustes** : Utilise des méthodes statistiques avancées avec tolérance au bruit et gestion d'erreurs

source: **Parameters:**
fr: **Paramètres :**

source: Signal shape
fr: Forme du signal

source: Signal type selection: Auto (automatic detection), Step, or Square
fr: Sélection du type de signal : Auto (détection automatique), Échelon ou Carré

source: Start baseline min
fr: Ligne de base début min

source: Lower X boundary for the start (initial) baseline region
fr: Limite X inférieure pour la région de ligne de base de début (initiale)

source: Start baseline max
fr: Ligne de base début max

source: Upper X boundary for the start (initial) baseline region
fr: Limite X supérieure pour la région de ligne de base de début (initiale)

source: End baseline min
fr: Ligne de base fin min

source: Lower X boundary for the end (final) baseline region
fr: Limite X inférieure pour la région de ligne de base de fin (finale)

source: End baseline max
fr: Ligne de base fin max

source: Upper X boundary for the end (final) baseline region
fr: Limite X supérieure pour la région de ligne de base de fin (finale)

source: Rise/Fall time
fr: Temps de montée/descente

source: Reference levels for rise/fall time measurement with predefined choices: 5%-95% (High precision), 10%-90% (IEEE standard), 20%-80% (Noisy signals), 25%-75% (Alternative)
fr: Niveaux de référence pour la mesure du temps de montée/descente avec des choix prédéfinis : 5%-95% (Haute précision), 10%-90% (Standard IEEE), 20%-80% (Signaux bruités), 25%-75% (Alternative)

source: **Extracted Features:**
fr: **Caractéristiques extraites :**

source: The analysis computes the following pulse characteristics:
fr: L'analyse calcule les caractéristiques d'impulsion suivantes :

source: Feature
fr: Caractéristique

source: Detected signal type (STEP, SQUARE, or OTHER)
fr: Type de signal détecté (ÉCHELON, CARRÉ ou AUTRE)

source: Polarity
fr: Polarité

source: Signal polarity (+1 for positive, -1 for negative pulses)
fr: Polarité du signal (+1 pour les impulsions positives, -1 pour les négatives)

source: Peak-to-peak amplitude of the pulse
fr: Amplitude crête-à-crête de l'impulsion

source: Offset
fr: Décalage

source: DC offset (baseline level)
fr: Décalage DC (niveau de ligne de base)

source: Rise time
fr: Temps de montée

source: Time from the lower to upper reference levels during rising edge
fr: Temps entre les niveaux de référence bas et haut pendant le front montant

source: Fall time
fr: Temps de descente

source: Time from the lower to upper reference levels during falling edge (square pulses only)
fr: Temps entre les niveaux de référence haut et bas pendant le front descendant (impulsions carrées uniquement)

source: Full Width at Half Maximum (square pulses only)
fr: Largeur à mi-hauteur (impulsions carrées uniquement)

source: Time at which signal reaches 50% of maximum amplitude
fr: Temps auquel le signal atteint 50 % de l'amplitude maximale

source: Time at which signal reaches 100% of maximum amplitude (plateau start)
fr: Temps auquel le signal atteint 100 % de l'amplitude maximale (début du plateau)

source: Foot duration
fr: Durée du pied

source: Duration of flat region before pulse rise
fr: Durée de la région plate avant la montée de l'impulsion

source: Baseline ranges
fr: Plages de ligne de base

source: Extracted start and end baseline boundary coordinates
fr: Coordonnées des limites de ligne de base de début et de fin extraites

source: Results are displayed in a comprehensive table showing all extracted parameters, and as visual annotations on the signal plot. For step signals, fall-related parameters (fall_time, fwhm) are not applicable and show as None. The feature works best with well-defined pulse signals that have clear baseline regions.
fr: Les résultats sont affichés dans un tableau complet montrant tous les paramètres extraits, et sous forme d'annotations visuelles sur le tracé du signal. Pour les signaux d'échelon, les paramètres liés à la descente (fall_time, fwhm) ne sont pas applicables et s'affichent comme None. Cette fonctionnalité fonctionne au mieux avec des signaux d'impulsion bien définis qui ont des régions de ligne de base claires.

source: Show results
fr: Afficher les résultats

source: Show the results of all analyses performed on the selected signals. This shows the same table as the one shown after having performed a computation.
fr: Affiche les résultats de toutes les analyses effectuées sur les signaux sélectionnés. Cela affiche le même tableau que celui affiché après avoir effectué un calcul.

source: Plot results
fr: Tracer les résultats

source: Plot the results of analyses performed on the selected signals, with user-defined X and Y axes (e.g. plot the FWHM as a function of the signal index).
fr: Trace les résultats des analyses effectuées sur les signaux sélectionnés, avec des axes X et Y définis par l'utilisateur (p.ex. trace la largeur à mi-hauteur en fonction de l'indice du signal).
