Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/signal/menu_edit.po
Languages: fr

source: Manipulate metadata and annotations
fr: Manipuler les métadonnées et les annotations

source: This section describes how to manipulate metadata and annotations in DataLab.
fr: Cette section décrit comment manipuler les métadonnées et les annotations dans DataLab.

source: Signal metadata contains various information about the signal or its representation, such as view settings, Regions Of Interest (ROIs), processing chain history, analysis results, and any other information that you may have added to the metadata of a signal (or that comes from the signal file itself).
fr: Les métadonnées du signal contiennent diverses informations sur le signal ou sa représentation, telles que les paramètres d'affichage, les régions d'intérêt (ROIs), l'historique de la chaîne de traitement, les résultats d'analyse et toute autre information que vous avez pu ajouter aux métadonnées d'un signal (ou qui provient du fichier du signal lui-même).

source: Screenshot of the "Edit" menu.
fr: Capture d'écran du menu "Édition".

source: The "Edit" menu allows you to perform classic editing operations on the current signal or group of signals (create/rename group, move up/down, delete signal/group of signals, etc.).
fr: Le menu "Édition" vous permet d'effectuer des opérations d'édition classiques sur le signal ou le groupe de signaux actuel (créer/renommer un groupe, déplacer vers le haut/vers le bas, supprimer le signal/le groupe de signaux, etc.).

source: As detailed below, it also allows you to:
fr: Comme détaillé ci-dessous, il vous permet également de :

source: Navigate and utilize the processing chain history through actions like "Recompute" and "Select source objects".
fr: Naviguer et utiliser l'historique de la chaîne de traitement grâce à des actions telles que "Recalculer" et "Sélectionner les objets sources".

source: Manipulate metadata and annotations associated with the current signal, thanks to the "Metadata" and "Annotations" submenus which provide the following features.
fr: Manipuler les métadonnées et les annotations associées au signal actuel, grâce aux sous-menus "Métadonnées" et "Annotations" qui offrent les fonctionnalités suivantes.

source: Recompute
fr: Recalculer

source: The "Recompute" |recompute| action allows you to recompute the selected signal(s) using their original processing parameters. This is useful when you want to re-execute the processing chain that was used to create a signal, for example after modifying global settings or dependencies.
fr: L'action "Recalculer" |recompute| vous permet de recalculer le signal (ou les signaux) sélectionné(s) en utilisant leurs paramètres de traitement d'origine. Cela est utile lorsque vous souhaitez réexécuter la chaîne de traitement qui a été utilisée pour créer un signal, par exemple après avoir modifié les paramètres globaux ou les dépendances.

source: This action is only available for signals that were created through processing operations and have stored processing parameters.
fr: Cette action n'est disponible que pour les signaux qui ont été créés par des opérations de traitement et qui ont des paramètres de traitement stockés.

source: Select source objects
fr: Sélectionner les objets sources

source: The "Select source objects" |goto_source| action allows you to select the source object(s) that were used to create the currently selected signal. This helps trace back the processing history and understand which original signals were used as input for the current result.
fr: L'action "Sélectionner les objets sources" |goto_source| vous permet de sélectionner l'objet (ou les objets) sources qui ont été utilisés pour créer le signal actuellement sélectionné. Cela aide à retracer l'historique de traitement et à comprendre quels signaux d'origine ont été utilisés comme entrée pour le résultat actuel.

source: This action is only available when exactly one signal is selected and that signal has source object references.
fr: Cette action n'est disponible que lorsqu'un seul signal est sélectionné et que ce signal possède des références d'objets sources.

source: Metadata
fr: Métadonnées

source: Screenshot of the "Metadata" submenu.
fr: Capture d'écran du sous-menu "Métadonnées".

source: Copy/paste metadata
fr: Copier/coller les métadonnées

source: As metadata contains useful information about the signal, it can be copied and pasted from one signal to another by selecting the "Copy metadata" |metadata_copy| and "Paste metadata" |metadata_paste| actions in the "Edit" menu.
fr: Compte tenu du fait que les métadonnées contiennent des informations utiles sur le signal, elles peuvent être copiées et collées d'un signal à un autre en sélectionnant les actions "Copier les métadonnées" |metadata_copy| et "Coller les métadonnées" |metadata_paste| dans le menu "Édition".

source: This feature allows you to tranfer those information from one signal to another:
fr: Cette fonctionnalité vous permet de transférer ces informations d'un signal à un autre :

source: :ref:`Regions Of Interest (ROIs) <sig-menu-roi>`: that is a very efficient way to reuse the same ROI on different signals and easily compare the results of the analysis on those signals
fr: :ref:`Régions d'intérêt (ROIs) <sig-menu-roi>` : c'est un moyen très efficace de réutiliser la même ROI sur différents signaux et de comparer facilement les résultats de l'analyse sur ces signaux

source: Analyze results, such as peak positions or FHWM intervals (the relevance of transferring such information depends on the context and is up to the user to decide)
fr: Résultats de calcul, tels que les positions de pics ou les intervalles FHWM (la pertinence du transfert de ces informations dépend du contexte et revient à l'utilisateur de décider)

source: Any other information that you may have added to the metadata of a signal
fr: Toute autre information que vous avez pu ajouter aux métadonnées d'un signal

source: Copying metadata from a signal to another will overwrite the metadata of the destination signal (for the metadata keys that are common to both signals) or simply add the metadata keys that are not present in the destination signal.
fr: Copier les métadonnées d'un signal à un autre écrasera les métadonnées du signal de destination (pour les clés de métadonnées communes aux deux signaux) ou ajoutera simplement les clés de métadonnées qui ne sont pas présentes dans le signal de destination.

source: Import/export metadata
fr: Importer/exporter les métadonnées

source: Metadata can also be imported and exported from/to a JSON file using the "Import metadata" |metadata_import| and "Export metadata" |metadata_export| actions in the "Edit" menu. This is exactly the same as the copy/paste metadata feature (see above for more details on the use cases of this feature), but it allows you to save the metadata to a file and then import it back later.
fr: Les métadonnées peuvent également être importées et exportées depuis/vers un fichier JSON en utilisant les actions "Importer les métadonnées" |metadata_import| et "Exporter les métadonnées" |metadata_export| dans le menu "Édition". C'est exactement la même chose que la fonctionnalité de copier/coller des métadonnées (voir ci-dessus pour plus de détails sur les cas d'utilisation de cette fonctionnalité), mais cela vous permet de sauvegarder les métadonnées dans un fichier et de les importer ultérieurement.

source: Delete metadata
fr: Supprimer les métadonnées

source: When deleting metadata using the "Delete metadata" |metadata_delete| action in the "Edit" menu, you will be prompted to confirm the deletion of Region of Interests (ROIs) if they are present in the metadata. After this eventual confirmation, the metadata will be deleted, meaning that analysis results, ROIs, and any other information associated with the signal will be lost.
fr: Lors de la suppression des métadonnées en utilisant l'action "Supprimer les métadonnées" |metadata_delete| dans le menu "Édition", vous serez invité à confirmer la suppression des régions d'intérêt (ROIs) si elles sont présentes dans les métadonnées. Après cette confirmation éventuelle, les métadonnées seront supprimées, ce qui signifie que les résultats d'analyse, les ROIs et toute autre information associée au signal seront perdus.

source: Add metadata
fr: Ajouter des métadonnées

source: The "Add metadata" |metadata_add| action allows you to add custom metadata items to one or more selected signals. This is useful for tagging signals with experiment IDs, sample names, processing steps, or any other custom information.
fr: L'action "Ajouter des métadonnées" |metadata_add| vous permet d'ajouter des éléments de métadonnées personnalisés à un ou plusieurs signaux sélectionnés. Cela est utile pour étiqueter les signaux avec des identifiants d'expérience, des noms d'échantillons, des étapes de traitement ou toute autre information personnalisée.

source: Add metadata dialog.
fr: Boîte de dialogue Ajouter des métadonnées.

source: When you select "Add metadata..." from the Edit menu, a dialog appears where you can:
fr: Lorsque vous sélectionnez "Ajouter des métadonnées..." dans le menu Édition, une boîte de dialogue apparaît où vous pouvez :

source: **Metadata key**: Enter the name of the metadata field to add
fr: **Clé de métadonnées** : Entrez le nom du champ de métadonnées à ajouter

source: **Value pattern**: Define a pattern for the metadata value using Python format strings
fr: **Modèle de valeur** : Définissez un modèle pour la valeur des métadonnées en utilisant des chaînes de format Python

source: **Conversion**: Choose how to store the value (string, float, integer, or boolean)
fr: **Conversion** : Choisissez comment stocker la valeur (chaîne, flottant, entier ou booléen)

source: **Preview**: See how the metadata will be added to each selected signal
fr: **Aperçu** : Voir comment les métadonnées seront ajoutées à chaque signal sélectionné.

source: The value pattern supports the following placeholders:
fr: Le modèle de valeur prend en charge les espaces réservés suivants :

source: ``{title}``: Signal title
fr: ``{title}``: Titre du signal

source: ``{index}``: 1-based index of the signal in the selection
fr: ``{index}``: Index basé sur 1 du signal dans la sélection

source: ``{count}``: Total number of selected signals
fr: ``{count}``: Nombre total de signaux sélectionnés

source: ``{xlabel}``, ``{xunit}``, ``{ylabel}``, ``{yunit}``: Axis labels and units
fr: ``{xlabel}``, ``{xunit}``, ``{ylabel}``, ``{yunit}``: Étiquettes et unités des axes

source: ``{metadata[key]}``: Access existing metadata values
fr: ``{metadata[key]}``: Accéder aux valeurs de métadonnées existantes

source: You can also use format modifiers:
fr: Vous pouvez également utiliser des modificateurs de format :

source: ``{title:upper}``: Convert to uppercase
fr: ``{title:upper}``: Convertir en majuscules

source: ``{title:lower}``: Convert to lowercase
fr: ``{title:lower}``: Convertir en minuscules

source: ``{index:03d}``: Format as 3-digit number with leading zeros
fr: ``{index:03d}``: Formater en nombre à 3 chiffres avec des zéros devant

source: **Examples:**
fr: **Exemples :**

source: Add experiment ID: key=``experiment_id``, pattern=``EXP_{index:03d}``, conversion=string → Creates metadata like ``experiment_id="EXP_001"``
fr: Ajouter l'ID d'expérience : clé=``experiment_id``, modèle=``EXP_{index:03d}``, conversion=chaîne → Crée des métadonnées comme ``experiment_id="EXP_001"``

source: Add sample temperature: key=``temperature``, pattern=``{metadata[temp]}``, conversion=float → Copies temperature from existing metadata and converts to float
fr: Ajouter la température de l'échantillon : clé=``temperature``, modèle=``{metadata[temp]}``, conversion=float → Copie la température des métadonnées existantes et la convertit en flottant

source: Mark processed signals: key=``is_processed``, pattern=``true``, conversion=bool → Sets ``is_processed=True`` for all selected signals
fr: Marquer les signaux traités : clé=``is_processed``, modèle=``true``, conversion=bool → Définit ``is_processed=True`` pour tous les signaux sélectionnés

source: Annotations are visual elements that can be added to signals to highlight specific features, mark regions of interest, or add explanatory notes. DataLab provides a dedicated submenu in the "Edit" menu for managing annotations.
fr: Les annotations sont des éléments visuels qui peuvent être ajoutés aux signaux pour mettre en évidence des fonctionnalités spécifiques, marquer des régions d'intérêt ou ajouter des notes explicatives. DataLab propose un sous-menu dédié dans le menu "Édition" pour gérer les annotations.

source: Screenshot of the "Annotations" submenu.
fr: Capture d'écran du sous-menu "Annotations".

source: Copy/paste annotations
fr: Copier/coller les annotations

source: Annotations can be copied from one signal and pasted to one or more other signals using the "Copy annotations" |annotations_copy| and "Paste annotations" |annotations_paste| actions. This is useful when you want to apply the same visual markers across multiple signals.
fr: Les annotations peuvent être copiées d'un signal et collées dans un ou plusieurs autres signaux à l'aide des actions "Copier les annotations" |annotations_copy| et "Coller les annotations" |annotations_paste|. Cela est utile lorsque vous souhaitez appliquer les mêmes marqueurs visuels à plusieurs signaux.

source: The "Paste annotations" action is only enabled when there are annotations in the clipboard (i.e., after using "Copy annotations").
fr: L'action "Coller les annotations" n'est activée que lorsqu'il y a des annotations dans le presse-papiers (c'est-à-dire après avoir utilisé "Copier les annotations").

source: Edit annotations
fr: Modifier les annotations

source: The "Edit annotations" |annotations_edit| action opens a dialog where you can view, add, modify, or remove annotations from the current signal. This provides a visual way to manage all annotations on a signal.
fr: L'action "Modifier les annotations" |annotations_edit| ouvre une boîte de dialogue où vous pouvez afficher, ajouter, modifier ou supprimer des annotations du signal actuel. Cela fournit un moyen visuel de gérer toutes les annotations sur un signal.

source: Import/export annotations
fr: Importer/exporter les annotations

source: Annotations can be saved to and loaded from JSON files (.dlabann extension) using the "Import annotations" |annotations_import| and "Export annotations" |annotations_export| actions. This allows you to:
fr: Les annotations peuvent être enregistrées et chargées à partir de fichiers JSON (extension .dlabann) à l'aide des actions "Importer les annotations" |annotations_import| et "Exporter les annotations" |annotations_export|. Cela vous permet de :

source: Save annotation sets for later reuse
fr: Enregistrer les ensembles d'annotations pour une réutilisation ultérieure

source: Share annotations with colleagues
fr: Partager les annotations avec des collègues

source: Archive annotations separately from signal data
fr: Archiver les annotations séparément des données du signal

source: Apply the same annotations to different signals across sessions
fr: Appliquer les mêmes annotations à différents signaux au cours des sessions

source: The "Export annotations" action is only available when the selected signal has annotations.
fr: L'action "Exporter les annotations" n'est disponible que lorsque le signal sélectionné a des annotations.

source: Delete annotations
fr: Supprimer les annotations

source: The "Delete annotations" |annotations_delete| action removes all annotations from the selected signal(s). This action is only enabled when the selected signal(s) have annotations.
fr: L'action "Supprimer les annotations" |annotations_delete| supprime toutes les annotations des signaux sélectionnés. Cette action n'est activée que lorsque les signaux sélectionnés ont des annotations.

source: Annotations are stored separately from metadata and analysis results. Deleting annotations does not affect ROIs or other metadata items.
fr: Les annotations sont stockées séparément des métadonnées et des résultats d'analyse. La suppression des annotations n'affecte pas les ROIs ou d'autres éléments de métadonnées.

source: Signal titles
fr: Titres des signaux

source: Signal titles may be considered as metadata from a user point of view, even if they are not stored in the metadata of the signal (but in an attribute of the signal object).
fr: Les titres des signaux peuvent être considérés comme des métadonnées du point de vue de l'utilisateur, même s'ils ne sont pas stockés dans les métadonnées du signal (mais dans un attribut de l'objet signal).

source: The "Edit" menu allows you to:
fr: Le menu "Édition" vous permet de :

source: "Add object title to plot": this action will add a label on top of the signal with its title.
fr: "Ajouter le titre de l'objet au graphique" : cette action ajoutera une étiquette en haut du signal avec son titre.

source: "Copy titles to clipboard" |copy_titles|: this action will copy the titles of the selected signals to the clipboard, which might be useful to paste them in a text editor or in a spreadsheet.
fr: "Copier les titres dans le presse-papiers" |copy_titles| : cette action copiera les titres des signaux sélectionnés dans le presse-papiers, ce qui peut être utile pour les coller dans un éditeur de texte ou dans un tableur.

source: Example of the content of the clipboard:
fr: Exemple du contenu du presse-papiers :
