Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/signal/menu_create.po
Languages: fr

source: Create Signals
fr: Créer des signaux

source: This section describes how to create new signals from various mathematical models.
fr: Cette section décrit comment créer de nouveaux signaux à partir de divers modèles mathématiques.

source: Screenshot of the "Create" menu.
fr: Capture d'écran du menu "Création".

source: When the "Signal Panel" is selected, the menus and toolbars are updated to provide signal-related actions.
fr: Lorsque le "Panneau Signal" est sélectionné, les menus et barres d'outils sont mis à jour pour fournir les actions relatives aux signaux.

source: The "Create" menu allows you to create new signals from various models (see below).
fr: Le menu "Création" permet de créer de nouveaux signaux à partir de divers modèles (voir ci-dessous).

source: New signal
fr: Nouveau signal

source: Create a new signal from various models:
fr: Créer un nouveau signal à partir de divers modèles :

source: Icon
fr: Icône

source: Model
fr: Modèle

source: Equation
fr: Équation

source: Zero
fr: Zéro

source: Normal distribution
fr: Distribution normale

source: :math:`y[i]` is normally distributed with configurable mean and standard deviation
fr: :math:`y[i]` suit une distribution normale avec moyenne et écart-type configurables

source: Poisson distribution
fr: Distribution de Poisson

source: :math:`y[i]` is Poisson distributed with configurable mean
fr: :math:`y[i]` suit une distribution de Poisson avec moyenne configurable

source: Uniform distribution
fr: Distribution uniforme

source: :math:`y[i]` is uniformly distributed between two configurable bounds
fr: :math:`y[i]` suit une distribution uniforme entre deux bornes configurables

source: Gaussian
fr: Gaussienne

source: Lorentzian
fr: Lorentzienne

source: :math:`y = y_{0}+A \cdot \dfrac{\Re\left(\exp\left(-z^2\right) \cdot \erfc(-j \cdot z)\right)}{\sqrt{2\pi} \cdot \sigma}` with :math:`z = \dfrac{x-x_{0}-j \cdot \sigma}{\sqrt{2} \cdot \sigma}`
fr: :math:`y = y_{0}+A \cdot \dfrac{\Re\left(\exp\left(-z^2\right) \cdot \erfc(-j \cdot z)\right)}{\sqrt{2\pi} \cdot \sigma}` avec :math:`z = \dfrac{x-x_{0}-j \cdot \sigma}{\sqrt{2} \cdot \sigma}`

source: Blackbody (Planck's law)
fr: Corps noir (loi de Planck)

source: Sine
fr: Sinus

source: Cosine
fr: Cosinus

source: Sawtooth
fr: Dent de scie

source: Square
fr: Carré

source: Cardinal sine
fr: Sinus cardinal

source: Linear chirp
fr: Balayage linéaire

source: Step
fr: Échelon

source: :math:`y = y_{0}+A \left\{\begin{array}{ll}1 & \text{if } x > x_{0} \\ 0 & \text{otherwise}\end{array}\right.`
fr: :math:`y = y_{0}+A \left\{\begin{array}{ll}1 & \text{si } x > x_{0} \\ 0 & \text{sinon}\end{array}\right.`

source: Exponential
fr: Exponentielle

source: Logistic
fr: Logistique

source: Pulse
fr: Impulsion

source: :math:`y = y_{0}+A \left\{\begin{array}{ll}1 & \text{if } x_{0} < x < x_{1} \\ 0 & \text{otherwise}\end{array}\right.`
fr: :math:`y = y_{0}+A \left\{\begin{array}{ll}1 & \text{si } x_{0} < x < x_{1} \\ 0 & \text{sinon}\end{array}\right.`

source: Step Pulse
fr: Impulsion à front monté

source: :math:`y = \left( \begin{cases} y_0 & \text{if } x < t_0 \\ y_0 + A \cdot \dfrac{x - t_0}{t_r} & \text{if } t_0 \leq x < t_0 + t_r \\ y_0 + A & \text{if } x \geq t_0 + t_r \end{cases} \right) + \mathcal{N}\left(0, \sigma_n\right)`
fr: :math:`y = \left( \begin{cases} y_0 & \text{si } x < t_0 \\ y_0 + A \cdot \dfrac{x - t_0}{t_r} & \text{si } t_0 \leq x < t_0 + t_r \\ y_0 + A & \text{si } x \geq t_0 + t_r \end{cases} \right) + \mathcal{N}\left(0, \sigma_n\right)`

source: where:
fr: où :

source: :math:`t_0` is the pulse start time,
fr: :math:`t_0` est le temps de début de l'impulsion,

source: :math:`t_r` is the rise time,
fr: :math:`t_r` est le temps de montée,

source: :math:`\sigma_n` is the noise amplitude
fr: :math:`\sigma_n` est l'amplitude du bruit

source: Square Pulse
fr: Impulsion carrée

source: :math:`y(x) = \left(\begin{cases} y_0 & \text{if } x < t_0 \\ y_0 + A \cdot \dfrac{x - t_0}{t_r} & \text{if } t_0 \leq x < t_0 + t_r \\ y_0 + A & \text{if } t_0 + t_r \leq x < t_1 \\ y_0 + A - A \cdot \dfrac{x - t_1}{t_f} & \text{if } t_1 \leq x < t_1 + t_f \\ y_0 & \text{if } x \geq t_1 + t_f \end{cases} \right) + \mathcal{N}(0, \sigma_n)`
fr: :math:`y(x) = \left(\begin{cases} y_0 & \text{si } x < t_0 \\ y_0 + A \cdot \dfrac{x - t_0}{t_r} & \text{si } t_0 \leq x < t_0 + t_r \\ y_0 + A & \text{si } t_0 + t_r \leq x < t_1 \\ y_0 + A - A \cdot \dfrac{x - t_1}{t_f} & \text{si } t_1 \leq x < t_1 + t_f \\ y_0 & \text{si } x \geq t_1 + t_f \end{cases} \right) + \mathcal{N}(0, \sigma_n)`

source: :math:`t_f` is the fall time,
fr: :math:`t_f` est le temps de descente,

source: :math:`t_1 = t_0 + t_r + d` is the time at which the decay starts,
fr: :math:`t_1 = t_0 + t_r + d` est le temps auquel la décroissance commence,

source: the duration of the plateau :math:`d` is computed as :math:`d = t_{\mathrm{FWHM}} - \dfrac{t_r + t_f}{2}` from the full width at half maximum :math:`t_{\mathrm{FWHM}}`
fr: la durée du plateau :math:`d` est calculée par :math:`d = t_{\mathrm{FWHM}} - \dfrac{t_r + t_f}{2}` à partir de la largeur à mi-hauteur :math:`t_{\mathrm{FWHM}}`

source: The duration of the plateau :math:`d` should not be negative.
fr: La durée du plateau :math:`d` ne doit pas être négative.

source: Polynomial
fr: Polynôme

source: Custom
fr: Personnalisé

source: Manual input of X and Y values
fr: Saisie manuelle des valeurs X et Y
