Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/core.gui/index.po
Languages: fr

source: The :mod:`cdl.core.gui` package contains functionnalities related to the graphical user interface (GUI) of the DataLab (CDL) project. Those features are mostly specific to DataLab and are not intended to be used independently.
fr: Le paquet :mod:`cdl.core.gui` contient des fonctionnalités liées à l'interface graphique (GUI) du projet DataLab (CDL). Ces fonctionnalités sont principalement spécifiques à DataLab et ne sont pas destinées à être utilisées indépendamment.

source: The purpose of this section of the documentation is to provide an overview of the DataLab GUI architecture and to describe the main features of the modules contained in this package. It is not intended to provide a detailed description of the GUI features, but rather to provide a starting point for the reader who wants to understand the DataLab internal architecture.
fr: Le but de cette section de la documentation est de fournir un aperçu de l'architecture de l'interface graphique de DataLab et de décrire les principales fonctionnalités des modules contenus dans ce paquet. Il ne vise pas à fournir une description détaillée des fonctionnalités de l'interface graphique, mais plutôt à fournir un point de départ pour le lecteur qui souhaite comprendre l'architecture interne de DataLab.

source: DataLab's main window is composed of several parts, each of them being handled by a specific module of this package:
fr: La fenêtre principale de DataLab est composée de plusieurs parties, chacune d'elles étant gérée par un module spécifique de ce paquet :

source: **Signal and image panels**: those panels are used to display signals and images and to provide a set of tools to manipulate them. Each data panel relies on a set of modules to handle the GUI features (:mod:`cdl.core.gui.actionhandler` and :mod:`cdl.core.gui.objectview`), the data model (:mod:`cdl.core.gui.objectmodel`), the data visualization (:mod:`cdl.core.gui.plothandler`), and the data processing (:mod:`cdl.core.gui.processor`).
fr: Les **Panneaux Signal et Image** : ces panneaux sont utilisés pour afficher des signaux et des images et pour fournir un ensemble d'outils pour les manipuler. Chaque panneau de données repose sur un ensemble de modules pour gérer les fonctionnalités de l'interface graphique (:mod:`cdl.core.gui.actionhandler` et :mod:`cdl.core.gui.objectview`), le modèle de données (:mod:`cdl.core.gui.objectmodel`), la visualisation des données (:mod:`cdl.core.gui.plothandler`), et le traitement des données (:mod:`cdl.core.gui.processor`).

source: **Macro panel**: this panel is used to display and run macros. It relies on the :mod:`cdl.core.gui.macroeditor` module to handle the macro edition and execution.
fr: Le **Panneau Macro** : ce panneau est utilisé pour afficher et exécuter des macros. Il repose sur le module :mod:`cdl.core.gui.macroeditor` pour gérer l'édition et l'exécution des macros.

source: **Specialized widgets**: those widgets are used to handle specific features such as ROI edition (:mod:`cdl.core.gui.roieditor`), Intensity profile edition (:mod:`cdl.core.gui.profiledialog`), etc.
fr: Les **widgets spécialisés** : ces widgets sont utilisés pour gérer des fonctionnalités spécifiques telles que l'édition des ROI (:mod:`cdl.core.gui.roieditor`), l'édition des profils d'intensité (:mod:`cdl.core.gui.profiledialog`), etc.

source: Submodule
fr: Sous-module

source: Purpose
fr: Objectif

source: DataLab main window and application
fr: Fenêtre principale et application DataLab

source: Signal, image and macro panels
fr: Panneaux Signal, Image et Macro

source: Application actions (menus, toolbars, context menu)
fr: Actions de l'application (menus, barres d'outils, menu contextuel)

source: Widgets to display object (signal/image) trees
fr: Widgets pour afficher les arbres d'objets (signal/image)

source: `PlotPy` plot items for representing signals and images
fr: Items de visualisation `PlotPy` pour représenter des signaux et des images

source: ROI editor
fr: Editeur de ROI

source: Processor
fr: Processeur

source: Dock widgets
fr: Widgets dockables

source: HDF5 input/output
fr: Entrée/sortie HDF5
