Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/core.gui/processor.po
Languages: fr

source: Processor
fr: Processeur

source: The :mod:`cdl.core.gui.processor` package provides the **processor objects** for signals and images.
fr: Le paquet :mod:`cdl.core.gui.processor` fournit les **objets processeur** pour les signaux et les images.

source: Processor objects are the bridge between the computation modules (in :mod:`cdl.computation`) and the GUI modules (in :mod:`cdl.core.gui`). They are used to call the computation functions and to update the GUI from inside the data panel objects.
fr: Les objets processeur sont le pont entre les modules de calcul (dans :mod:`cdl.computation`) et les modules GUI (dans :mod:`cdl.core.gui`). Ils sont utilisés pour appeler les fonctions de calcul et pour mettre à jour l'interface utilisateur depuis l'intérieur des objets de panneau de données.

source: When implementing a processing feature in DataLab, the steps are usually the following:
fr: Lors de la mise en œuvre d'une fonction de traitement dans DataLab, les étapes sont généralement les suivantes :

source: Add an action in the :mod:`cdl.core.gui.actionhandler` module to trigger the processing feature from the GUI (e.g. a menu item or a toolbar button).
fr: Ajout d'une action dans le module :mod:`cdl.core.gui.actionhandler` pour déclencher la fonction de traitement depuis l'interface utilisateur (par exemple, un élément de menu ou un bouton de barre d'outils).

source: Implement the computation function in the :mod:`cdl.computation` module (that would eventually call the algorithm from the :mod:`cdl.algorithms` module).
fr: Implémentation de la fonction de calcul dans le module :mod:`cdl.computation` (qui appellerait éventuellement l'algorithme du module :mod:`cdl.algorithms`).

source: Implement the processor object method in this package to call the computation function and eventually update the GUI.
fr: Implémentation de la méthode de l'objet processeur dans ce paquet pour appeler la fonction de calcul et éventuellement mettre à jour l'interface utilisateur.

source: The processor objects are organized in submodules according to their purpose:
fr: Les objets processeurs sont organisés en sous-modules selon leur objectif :

source: :mod:`cdl.core.gui.processor.base`: Common processing features
fr: :mod:`cdl.core.gui.processor.base`: Fonctions de traitement communes

source: :mod:`cdl.core.gui.processor.signal`: Signal processing features
fr: :mod:`cdl.core.gui.processor.signal`: Fonctions de traitement de signaux

source: :mod:`cdl.core.gui.processor.image`: Image processing features
fr: :mod:`cdl.core.gui.processor.image`: Fonctions de traitement d'images

source: Generic processing types
fr: Types de traitement génériques

source: To support consistent processing workflows, the :class:`BaseProcessor` class defines five generic processing methods, each corresponding to a fundamental input/output pattern. These methods are tightly integrated with the GUI logic: the input objects are taken from the current selection in the active panel (Signal or Image), and the output objects are automatically appended to the same panel.
fr: Pour prendre en charge des flux de traitement cohérents, la classe :class:`BaseProcessor` définit cinq méthodes de traitement génériques, chacune correspondant à un modèle d'entrée/sortie fondamental. Ces méthodes sont étroitement intégrées à la logique de l'interface utilisateur : les objets d'entrée sont extraits de la sélection actuelle dans le panneau actif (Signal ou Image), et les objets de sortie sont automatiquement ajoutés au même panneau.

source: ``compute_1_to_1``: Applies an independent transformation to each selected object.
fr: ``compute_1_to_1`` : Applique une transformation indépendante à chaque objet sélectionné.

source: ``compute_1_to_0``: Runs an analysis or measurement producing metadata or scalar data.
fr: ``compute_1_to_0`` : Exécute une analyse ou une mesure produisant des métadonnées ou des données scalaires.

source: ``compute_1_to_n``: Produces multiple output objects from a single input (e.g. ROI extraction).
fr: ``compute_1_to_n`` : Produit plusieurs objets de sortie à partir d'une seule entrée (par exemple, extraction de ROI).

source: ``compute_n_to_1``: Aggregates multiple objects into one (e.g. sum, average); supports pairwise mode.
fr: ``compute_n_to_1`` : Agrège plusieurs objets en un (par exemple, somme, moyenne) ; prend en charge le mode pairwise.

source: ``compute_2_to_1``: Applies a binary operation with a second operand (object or constant); supports pairwise mode.
fr: ``compute_2_to_1`` : Applique une opération binaire avec un deuxième opérande (objet ou constante) ; prend en charge le mode pairwise.

source: Method name
fr: Nom de la méthode

source: Multi-selection behavior
fr: Comportement de multi-sélection

source: 1 object ➝ 1 object
fr: 1 objet ➝ 1 objet

source: 1 object ➝ no object
fr: 1 objet ➝ aucun objet

source: 1 object ➝ n objects
fr: 1 objet ➝ n objets

source: n objects ➝ 1 object
fr: n objets ➝ 1 objet

source: n ➝ 1<br>n ➝ n (pairwise mode)
fr: n ➝ 1<br>n ➝ n (mode pairwise)

source: 1 object + 1 operand ➝ 1 object
fr: 1 objet + 1 opérande ➝ 1 objet

source: k + 1 ➝ k<br>n + n ➝ n (pairwise mode)
fr: k + 1 ➝ k<br>n + n ➝ n (mode pairwise)

source: These methods are for internal or advanced use (e.g. plugin or macro authors) and will evolve without backward compatibility guarantees.
fr: Ces méthodes sont destinées à un usage interne ou avancé (par exemple, auteurs de plugins ou de macros) et évolueront sans garanties de compatibilité ascendante.

source: Future developments (such as a visual pipeline editor) may require generalizing this model to support additional sources and destinations beyond the current panel-based selection/output logic.
fr: Les développements futurs (comme un éditeur de pipeline visuel) peuvent nécessiter de généraliser ce modèle pour prendre en charge des sources et des destinations supplémentaires au-delà de la logique actuelle de sélection/sortie basée sur le panneau.
