Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/core.gui/roieditor.po
Languages: fr

source: ROI editor
fr: Editeur de ROI

source: The :mod:`cdl.core.gui.roieditor` module provides the ROI editor widgets for signals and images.
fr: Le module :mod:`cdl.core.gui.roieditor` fournit les widgets de l'éditeur de ROI pour les signaux et les images.

source: Signal ROI editor
fr: Editeur de ROI de signal

source: Signal ROI Editor
fr: Editeur de ROI de signal

source: Setup ROI editor widget
fr: Configurer le widget de l'éditeur de ROI

source: Simply add an ROI
fr: Ajouter simplement une ROI

source: Update ROI annotation titles
fr: Mettre à jour les titres des annotations de ROI

source: Return ROI item coords
fr: Retourner les coordonnées de l'élément ROI

source: Image ROI editor
fr: Editeur de ROI d'image

source: Image ROI Editor
fr: Editeur de ROI d'image

source: Add new ROI
fr: Ajouter une nouvelle ROI
