Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/algorithms.po
Languages: fr

source: Algorithms (:mod:`cdl.algorithms`)
fr: Algorithmes (:mod:`cdl.algorithms`)

source: This package contains the algorithms used by the DataLab project. Those algorithms operate directly on NumPy arrays and are designed to be used in the DataLab pipeline, but can be used independently as well.
fr: Ce paquet contient les algorithmes utilisés par le projet DataLab. Ces algorithmes opèrent directement sur des tableaux NumPy et sont conçus pour être utilisés dans le pipeline DataLab, mais peuvent également être utilisés indépendamment.

source: The :mod:`cdl.algorithms` package is the main entry point for the DataLab algorithms when manipulating NumPy arrays. See the :mod:`cdl.computation` package for algorithms that operate directly on DataLab objects (i.e. :class:`cdl.obj.SignalObj` and :class:`cdl.obj.ImageObj`).
fr: Le module :mod:`cdl.algorithms` est le point d'entrée principal pour les algorithmes DataLab lors de la manipulation de tableaux NumPy. Voir le module :mod:`cdl.computation` pour les algorithmes qui opèrent directement sur les objets DataLab (c'est-à-dire :class:`cdl.obj.SignalObj` et :class:`cdl.obj.ImageObj`).

source: The algorithms are organized in subpackages according to their purpose. The following subpackages are available:
fr: Les algorithmes sont organisés en sous-paquets en fonction de leur objectif. Les sous-paquets suivants sont disponibles :

source: :mod:`cdl.algorithms.signal`: Signal processing algorithms
fr: :mod:`cdl.algorithms.signal` : Algorithmes de traitement du signal

source: :mod:`cdl.algorithms.image`: Image processing algorithms
fr: :mod:`cdl.algorithms.image` : Algorithmes de traitement d'image

source: :mod:`cdl.algorithms.datatypes`: Data type conversion algorithms
fr: :mod:`cdl.algorithms.datatypes` : Algorithmes de conversion de type de données

source: :mod:`cdl.algorithms.coordinates`: Coordinate conversion algorithms
fr: :mod:`cdl.algorithms.coordinates` : Algorithmes de conversion de coordonnées

source: Signal Processing Algorithms
fr: Algorithmes de traitement du signal

source: Normalize input array to a given parameter.
fr: Normaliser le tableau d'entrée à un paramètre donné.

source: Parameters
fr: Paramètres

source: Input array
fr: Tableau d'entrée

source: Normalization parameter. Defaults to "maximum"
fr: Paramètre de normalisation. Par défaut : "maximum"

source: Returns
fr: Retourne

source: Normalized array
fr: Tableau normalisé

source: Compute FFT on X,Y data.
fr: Calculer la FFT sur les données X,Y.

source: X data
fr: Données X

source: Y data
fr: Données Y

source: Shift the zero frequency to the center of the spectrum. Defaults to True.
fr: Décaler la fréquence nulle vers le centre du spectre. Par défaut : True.

source: X data, Y data (tuple)
fr: Données X, Y (tuple)

source: Compute iFFT on X,Y data.
fr: Calculer la iFFT sur les données X,Y.

source: Compute magnitude spectrum.
fr: Calculer le spectre de magnitude.

source: Use log scale. Defaults to False.
fr: Utiliser une échelle logarithmique. Par défaut : False.

source: Magnitude spectrum (X data, Y data)
fr: Spectre de magnitude (données X, Y)

source: Compute phase spectrum.
fr: Calculer le spectre de phase.

source: Phase spectrum in degrees (X data, Y data)
fr: Spectre de phase en degrés (données X, Y)

source: Compute Power Spectral Density (PSD), using the Welch method.
fr: Calculer la densité spectrale de puissance (PSD), en utilisant la méthode de Welch.

source: Return type
fr: Type de retour

source: Sort from X,Y data by computing FFT(y).
fr: Trier à partir des données X,Y en calculant FFT(y).

source: Sorted frequencies in ascending order
fr: Fréquences triées par ordre croissant

source: Peak detection routine.
fr: Routine de détection de pics.

source: Finds the numeric index of the peaks in *y* by taking its first order difference. By using *thres* and *min_dist* parameters, it is possible to reduce the number of detected peaks. *y* must be signed.
fr: Recherche l'index numérique des pics dans *y* en prenant sa première différence d'ordre. En utilisant les paramètres *thres* et *min_dist*, il est possible de réduire le nombre de pics détectés. *y* doit être signé.

source: 1D amplitude data to search for peaks.
fr: Données d'amplitude 1D à rechercher pour les pics.

source: Normalized threshold. Only the peaks with amplitude higher than the threshold will be detected.
fr: Seuil normalisé. Seuls les pics dont l'amplitude est supérieure au seuil seront détectés.

source: Minimum distance between each detected peak. The peak with the highest amplitude is preferred to satisfy this constraint.
fr: Distance minimale entre chaque pic détecté. Le pic avec l'amplitude la plus élevée est préféré pour satisfaire cette contrainte.

source: If True, the thres value will be interpreted as an absolute value, instead of a normalized threshold.
fr: Si True, la valeur thres sera interprétée comme une valeur absolue, au lieu d'un seuil normalisé.

source: Array containing the numeric indexes of the peaks that were detected
fr: Tableau contenant les index numériques des pics qui ont été détectés

source: Return default peak X-position (assuming a single peak).
fr: Retourne la position X du pic par défaut (en supposant un seul pic).

source: Peak X-position
fr: Position X du pic

source: Interpolate data.
fr: Interpoler les données.

source: New X data
fr: Nouvelles données X

source: Interpolation method
fr: Méthode d'interpolation

source: Fill value. Defaults to None. This value is used to fill in for requested points outside of the X data range. It is only used if the method argument is 'linear', 'cubic' or 'pchip'.
fr: Valeur de remplissage. Par défaut : None. Cette valeur est utilisée pour remplir les points demandés en dehors de la plage de données X. Elle n'est utilisée que si l'argument de méthode est 'linear', 'cubic' ou 'pchip'.

source: Interpolated Y data
fr: Données Y interpolées

source: Apply windowing to the input data.
fr: Appliquer une fenêtre aux données d'entrée.

source: Windowing function. Defaults to "hamming".
fr: Fonction de fenêtrage. Par défaut : "hamming".

source: Tukey window parameter. Defaults to 0.5.
fr: Paramètre de la fenêtre de Tukey. Par défaut : 0.5.

source: Kaiser window parameter. Defaults to 14.0.
fr: Paramètre de la fenêtre de Kaiser. Par défaut : 14.0.

source: Gaussian window parameter. Defaults to 7.0.
fr: Paramètre de la fenêtre gaussienne. Par défaut : 7.0.

source: Windowed Y data
fr: Données Y fenêtrées

source: Curve fitting model base class
fr: Classe de base du modèle de régression

source: Return fitting function
fr: Retourne la fonction de régression

source: Return amp from function amplitude and sigma
fr: Retourne amp à partir de l'amplitude de la fonction et de sigma

source: Return function amplitude
fr: Retourne l'amplitude de la fonction

source: Return function FWHM
fr: Retourne la LMH de la fonction

source: Return segment coordinates for y=half-maximum intersection
fr: Retourne les coordonnées du segment pour l'intersection y=half-maximum

source: 1-dimensional Gaussian fit model
fr: Modèle de régression gaussien à 1 dimension

source: 1-dimensional Lorentzian fit model
fr: Modèle de régression lorentzien à 1 dimension

source: 1-dimensional Voigt fit model
fr: Modèle de régression Voigt à 1 dimension

source: Find the x indexes where the corresponding y is the closest to zero
fr: Rechercher les indices x où le y correspondant est le plus proche de zéro

source: Indexes of the points right before or at zero crossing
fr: Indices des points juste avant ou au croisement à zéro

source: Find the x value where the y value is the closest to the given value using linear interpolation to deduce the precise x value.
fr: Rechercher la valeur x où la valeur y est la plus proche de la valeur donnée en utilisant une interpolation linéaire pour déduire la valeur x précise.

source: Value to find
fr: Valeur à rechercher

source: X value where the Y value is the closest to the given value
fr: Valeur X où la valeur Y est la plus proche de la valeur donnée

source: Compute the bandwidth of the signal at a given level.
fr: Calculer la largeur de bande du signal à un niveau donné.

source: X,Y data
fr: Données X,Y

source: Level in dB at which the bandwidth is computed. Defaults to 3.0.
fr: Niveau en dB auquel la largeur de bande est calculée. Par défaut : 3.0.

source: segment coordinates
fr: coordonnées du segment

source: Compute contrast
fr: Calculer le contraste

source: Contrast
fr: Contraste

source: Sinusoidal model function.
fr: Fonction de modèle sinusoïdal.

source: Fit a sinusoidal model to the input data.
fr: Adapter un modèle sinusoïdal aux données d'entrée.

source: A tuple containing the fit parameters (amplitude, frequency, phase, offset) and the residuals
fr: Un tuple contenant les paramètres d'ajustement (amplitude, fréquence, phase, décalage) et les résidus

source: Compute the frequency of a sinusoidal signal.
fr: Calculer la fréquence d'un signal sinusoïdal.

source: x signal data
fr: données x du signal

source: y signal data
fr: données y du signal

source: Frequency of the sinusoidal signal
fr: Fréquence du signal sinusoïdal

source: Compute Effective Number of Bits (ENOB).
fr: Calculer le nombre effectif de bits (ENOB).

source: Full scale(V). Defaults to 1.0.
fr: Pleine échelle (V). Par défaut : 1.0.

source: Effective Number of Bits (ENOB)
fr: Nombre effectif de bits (ENOB)

source: Compute Signal-to-Noise and Distortion Ratio (SINAD).
fr: Calculer le rapport signal/bruit et distorsion (SINAD).

source: Unit of the input data. Valid values are 'dBc' and 'dBFS'. Defaults to 'dBc'.
fr: Unité des données d'entrée. Les valeurs valides sont 'dBc' et 'dBFS'. Par défaut : 'dBc'.

source: Signal-to-Noise and Distortion Ratio (SINAD)
fr: Rapport signal/bruit et distorsion (SINAD)

source: Compute Total Harmonic Distortion (THD).
fr: Calculer la distorsion harmonique totale (THD).

source: Number of harmonics to consider. Defaults to 5.
fr: Nombre d'harmoniques à considérer. Par défaut : 5.

source: Total Harmonic Distortion (THD)
fr: Distorsion harmonique totale (THD)

source: Compute Spurious-Free Dynamic Range (SFDR).
fr: Calculer la plage dynamique sans spurious (SFDR).

source: Spurious-Free Dynamic Range (SFDR)
fr: Plage dynamique sans spurious (SFDR)

source: Compute Signal-to-Noise Ratio (SNR).
fr: Calculer le rapport signal/bruit (SNR).

source: Signal-to-Noise Ratio (SNR)
fr: Rapport signal/bruit (SNR)

source: Compute sampling period
fr: Calculer la période d'échantillonnage

source: Sampling period
fr: Période d'échantillonnage

source: Compute mean sampling rate
fr: Calculer le taux d'échantillonnage moyen

source: Sampling rate
fr: Taux d'échantillonnage

source: Compute Full Width at Half Maximum (FWHM) of the input data
fr: Calculer la largeur totale à mi-hauteur (FWHM) des données d'entrée

source: Calculation method. Two types of methods are supported: a zero-crossing method and fitting methods (based on various models: Gauss, Lorentz, Voigt). Defaults to "zero-crossing".
fr: Méthode de calcul. Deux types de méthodes sont pris en charge : une méthode de croisement à zéro et des méthodes d'ajustement (basées sur divers modèles : Gauss, Lorentz, Voigt). Par défaut : "zero-crossing".

source: Lower X bound for the fitting. Defaults to None (no lower bound, i.e. the fitting starts from the first point).
fr: Borne X inférieure pour l'ajustement. Par défaut : None (pas de borne inférieure, c'est-à-dire que l'ajustement commence à partir du premier point).

source: Upper X bound for the fitting. Defaults to None (no upper bound, i.e. the fitting ends at the last point)
fr: Borne X supérieure pour l'ajustement. Par défaut : None (pas de borne supérieure, c'est-à-dire que l'ajustement se termine au dernier point)

source: FWHM segment coordinates
fr: Coordonnées du segment LMH

source: Compute Full Width at 1/e� of the input data (using a Gaussian model fitting).
fr: Calculer la largeur totale à 1/e² des données d'entrée (en utilisant un ajustement de modèle gaussien).

source: FW at 1/e² segment coordinates
fr: Coordonnées du segment LMH à 1/e²

source: Image Processing Algorithms
fr: Algorithmes de traitement d'image

source: Scale array `data` to fit [zmin, zmax] dynamic range
fr: Mettre à l'échelle le tableau `data` pour s'adapter à la plage dynamique [zmin, zmax]

source: Input data
fr: Données d'entrée

source: Minimum value of output data
fr: Valeur minimale des données de sortie

source: Maximum value of output data
fr: Valeur maximale des données de sortie

source: Scaled data
fr: Données mises à l'échelle

source: Normalization parameter (default: "maximum")
fr: Paramètre de normalisation (par défaut : "maximum")

source: Compute FFT of complex array `z`
fr: Calculer la FFT du tableau complexe `z`

source: Shift zero frequency to center (default: True)
fr: Décaler la fréquence nulle vers le centre (par défaut : True)

source: FFT of input data
fr: FFT des données d'entrée

source: Compute inverse FFT of complex array `z`
fr: Calculer la FFT inverse du tableau complexe `z`

source: Inverse FFT of input data
fr: FFT inverse des données d'entrée

source: Compute magnitude spectrum of complex array `z`
fr: Calculer le spectre de magnitude du tableau complexe `z`

source: Use log scale (default: False)
fr: Utiliser une échelle logarithmique (par défaut : False)

source: Magnitude spectrum of input data
fr: Spectre de magnitude des données d'entrée

source: Compute phase spectrum of complex array `z`
fr: Calculer le spectre de phase du tableau complexe `z`

source: Phase spectrum of input data (in degrees)
fr: Spectre de phase des données d'entrée (en degrés)

source: Compute power spectral density of complex array `z`
fr: Calculer la densité spectrale de puissance du tableau complexe `z`

source: Power spectral density of input data
fr: Densité spectrale de puissance des données d'entrée

source: Perform image pixel binning
fr: Effectuer le binning des pixels de l'image

source: Binning size along x (number of pixels to bin together)
fr: Binning le long de x (nombre de pixels à biner ensemble)

source: Binning size along y (number of pixels to bin together)
fr: Binning le long de y (nombre de pixels à biner ensemble)

source: Binning operation
fr: Opération de binning

source: Output data type (default: None, i.e. same as input)
fr: Type de données de sortie (par défaut : None, c'est-à-dire identique à l'entrée)

source: Binned data
fr: Données binnées

source: Compute flat-field correction
fr: Calculer la correction du champ plat

source: Raw data
fr: Données brutes

source: Flat-field data
fr: Données de champ plat

source: Threshold for flat-field correction (default: None)
fr: Seuil de correction du champ plat (par défaut : None)

source: Flat-field corrected data
fr: Données corrigées du champ plat

source: Return image centroid using Fourier algorithm
fr: Retourne le centre de gravité de l'image en utilisant l'algorithme de Fourier

source: Centroid coordinates (row, col)
fr: Coordonnées du centre de gravité (ligne, colonne)

source: Return absolute level
fr: Retourne le niveau absolu

source: Relative level (0.0 to 1.0)
fr: Niveau relatif (0.0 à 1.0)

source: Absolute level
fr: Niveau absolu

source: Return (x, y, radius) for the circle contour enclosing image values above threshold relative level (.5 means FWHM)
fr: Retourne (x, y, rayon) pour le contour du cercle contenant les valeurs d'image au-dessus du niveau relatif du seuil (.5 signifie FWHM)

source: Relative level (default: 0.5)
fr: Niveau relatif (par défaut : 0.5)

source: A tuple (x, y, radius)
fr: Un tuple (x, y, rayon)

source: Raises
fr: Lève

source: No contour was found
fr: Aucun contour n'a été trouvé

source: Return radial profile of image data
fr: Retourne le profil radial des données d'image

source: Input data (2D array)
fr: Tableau d'entrée (2D)

source: Coordinates of the center of the profile (x, y)
fr: Coordonnées du centre du profil (x, y)

source: Radial profile (X, Y) where X is the distance from the center (1D array) and Y is the average value of pixels at this distance (1D array)
fr: Profil radial (X, Y) où X est la distance du centre (tableau 1D) et Y est la valeur moyenne des pixels à cette distance (tableau 1D)

source: Return distance matrix from coords
fr: Retourne la matrice de distance à partir des coordonnées

source: List of coordinates
fr: Liste des coordonnées

source: Distance matrix
fr: Matrice de distance

source: Detect peaks in image data, return coordinates.
fr: Détecte les pics dans les données d'image, retourne les coordonnées.

source: If neighborhoods size is None, default value is the highest value between 50 pixels and the 1/40th of the smallest image dimension.
fr: Si la taille du voisinage est None, la valeur par défaut est la plus élevée entre 50 pixels et le 1/40ème de la plus petite dimension de l'image.

source: Detection threshold level is relative to difference between data maximum and minimum values.
fr: Le niveau de seuil de détection est relatif à la différence entre les valeurs maximales et minimales des données.

source: Neighborhood size (default: None)
fr: Taille du voisinage (par défaut : None)

source: Coordinates of peaks
fr: Coordonnées des pics

source: Find iso-valued contours in a 2D array, above relative level (.5 means FWHM), then fit contours with shape ('ellipse' or 'circle')
fr: Trouve les contours de valeur iso dans un tableau 2D, au-dessus du niveau relatif (.5 signifie FWHM), puis ajuste les contours avec la forme ('ellipse' ou 'cercle')

source: Shape to fit. Default is 'ellipse'
fr: Forme à ajuster. Par défaut : 'ellipse'

source: Coordinates of shapes
fr: Coordonnées des formes

source: Detect peaks in image from circle Hough transform, return circle coordinates.
fr: Détecte les pics dans l'image à partir de la transformée de Hough du cercle, retourne les coordonnées du cercle.

source: Minimum radius (default: None)
fr: Rayon minimum (par défaut : None)

source: Maximum radius (default: None)
fr: Rayon maximum (par défaut : None)

source: Number of radii (default: None)
fr: Nombre de rayons (par défaut : None)

source: Minimum distance between circles (default: 1)
fr: Distance minimale entre les cercles (par défaut : 1)

source: Coordinates of circles
fr: Coordonnées des cercles

source: Finds blobs in the given grayscale image using the Difference of Gaussians (DoG) method.
fr: Recherche les taches dans l'image en niveaux de gris donnée en utilisant la méthode de différence de Gauss (DoG).

source: The grayscale input image.
fr: L'image d'entrée en niveaux de gris.

source: The minimum blob radius in pixels.
fr: Le rayon minimum de la tache en pixels.

source: The maximum blob radius in pixels.
fr: Le rayon maximum de la tache en pixels.

source: The minimum overlap between two blobs in pixels. For instance, if two blobs are detected with radii of 10 and 12 respectively, and the ``overlap`` is set to 0.5, then the area of the smaller blob will be ignored and only the area of the larger blob will be returned.
fr: Le chevauchement minimum entre deux taches en pixels. Par exemple, si deux taches sont détectées avec des rayons de 10 et 12 respectivement, et que le chevauchement est défini sur 0,5, alors la zone de la plus petite tache sera ignorée et seule la zone de la plus grande tache sera retournée.

source: The absolute lower bound for scale space maxima. Local maxima smaller than ``threshold_rel`` are ignored. Reduce this to detect blobs with less intensities.
fr: La limite inférieure absolue pour les maxima de l'espace d'échelle. Les maxima locaux plus petits que ``threshold_rel`` sont ignorés. Réduisez ceci pour détecter les taches avec moins d'intensité.

source: If ``True``, exclude blobs from detection if they are too close to the border of the image. Border size is ``min_sigma``.
fr: Si ``True``, exclure les taches de la détection si elles sont trop proches du bord de l'image. La taille de la bordure est ``min_sigma``.

source: Coordinates of blobs
fr: Coordonnées des taches

source: Finds blobs in the given grayscale image using the Determinant of Hessian (DoH) method.
fr: Recherche les taches dans l'image en niveaux de gris donnée en utilisant la méthode du déterminant de Hessian (DoH).

source: If ``True``, the radius of each blob is returned as ``sqrt(sigma)`` for each detected blob.
fr: Si ``True``, le rayon de chaque tache est retourné comme ``sqrt(sigma)`` pour chaque tache détectée.

source: Finds blobs in the given grayscale image using the Laplacian of Gaussian (LoG) method.
fr: Recherche les taches dans l'image en niveaux de gris donnée en utilisant la méthode du Laplacien de Gauss (LoG).

source: Remove overlapping disks among coordinates
fr: Supprimer les disques qui se chevauchent parmi les coordonnées

source: The coordinates of the disks
fr: Les coordonnées des disques

source: The coordinates of the disks with overlapping disks removed
fr: Les coordonnées des disques avec les disques qui se chevauchent supprimés

source: Finds blobs in the given grayscale image using OpenCV's SimpleBlobDetector.
fr: Recherche les taches dans l'image en niveaux de gris donnée en utilisant le détecteur de taches simples d'OpenCV.

source: The minimum blob intensity.
fr: L'intensité minimale de la tache.

source: The maximum blob intensity.
fr: L'intensité maximale de la tache.

source: The minimum number of times a blob is detected before it is reported.
fr: Le nombre minimum de fois qu'une tache est détectée avant qu'elle ne soit signalée.

source: The minimum distance between blobs.
fr: La distance minimale entre les taches.

source: If ``True``, blobs are filtered by color.
fr: Si ``True``, les taches sont filtrées par couleur.

source: The color of the blobs to filter by.
fr: La couleur des taches à filtrer par.

source: If ``True``, blobs are filtered by area.
fr: Si ``True``, les taches sont filtrées par zone.

source: The minimum blob area.
fr: La zone minimale de la tache.

source: The maximum blob area.
fr: La zone maximale de la tache.

source: If ``True``, blobs are filtered by circularity.
fr: Si ``True``, les taches sont filtrées par circularité.

source: The minimum blob circularity.
fr: La circularité minimale de la tache.

source: The maximum blob circularity.
fr: La circularité maximale de la tache.

source: If ``True``, blobs are filtered by inertia.
fr: Si ``True``, les taches sont filtrées par inertie.

source: The minimum blob inertia ratio.
fr: Le rapport d'inertie minimale de la tache.

source: The maximum blob inertia ratio.
fr: Le rapport d'inertie maximale de la tache.

source: If ``True``, blobs are filtered by convexity.
fr: Si ``True``, les taches sont filtrées par convexité.

source: The minimum blob convexity.
fr: La convexité minimale de la tache.

source: The maximum blob convexity.
fr: La convexité maximale de la tache.

source: Data Type Conversion Algorithms
fr: Algorithmes de conversion de type de données

source: Return True if data type is an integer type
fr: Retourne True si le type de données est un type entier

source: Data type to check
fr: Type de données à vérifier

source: True if data type is an integer type
fr: True si le type de données est un type entier

source: Return True if data type is a complex type
fr: Retourne True si le type de données est un type complexe

source: True if data type is a complex type
fr: True si le type de données est un type complexe

source: Coordinate Conversion Algorithms
fr: Algorithmes de conversion de coordonnées

source: Convert circle center and radius to X diameter coordinates
fr: Convertit le centre et le rayon du cercle en coordonnées de diamètre X

source: Circle center X coordinate
fr: Abscisse du centre du cercle

source: Circle center Y coordinate
fr: Ordonnée du centre du cercle
