Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/algorithms.po
Languages: fr

source: Circle radius
fr: Rayon du cercle

source: Circle X diameter coordinates
fr: Coordonnées de diamètre X du cercle

source: Convert circle center and radius to X diameter coordinates (array version)
fr: Convertit le centre et le rayon du cercle en coordonnées de diamètre X (version tableau)

source: Circle center and radius, in the form of a 2D array (N, 3)
fr: Centre et rayon du cercle, sous la forme d'un tableau 2D (N, 3)

source: Circle X diameter coordinates, in the form of a 2D array (N, 4)
fr: Coordonnées de diamètre X du cercle, sous la forme d'un tableau 2D (N, 4)

source: Convert circle X diameter coordinates to center and radius
fr: Convertit les coordonnées de diamètre X du cercle en centre et rayon

source: Diameter start X coordinate
fr: Abscisse de début de diamètre du cercle

source: Diameter start Y coordinate
fr: Ordonnée de début de diamètre du cercle

source: Diameter end X coordinate
fr: Abscisse de fin de diamètre du cercle

source: Diameter end Y coordinate
fr: Ordonnée de fin de diamètre du cercle

source: Circle center and radius
fr: Centre et rayon du cercle

source: Convert circle X diameter coordinates to center and radius (array version)
fr: Convertit les coordonnées de diamètre X du cercle en centre et rayon (version tableau)

source: Convert ellipse center, axes and angle to X/Y diameters coordinates
fr: Convertit le centre, les axes et l'angle de l'ellipse en coordonnées de diamètres X/Y

source: Ellipse center X coordinate
fr: Abscisse du centre de l'ellipse

source: Ellipse center Y coordinate
fr: Ordonnée du centre de l'ellipse

source: Ellipse half larger axis
fr: Demi grand axe de l'ellipse

source: Ellipse half smaller axis
fr: Demi petit axe de l'ellipse

source: Ellipse angle
fr: Angle de l'ellipse

source: Ellipse X/Y diameters (major/minor axes) coordinates
fr: Coordonnées des diamètres X/Y (grands/petits axes) de l'ellipse

source: Convert ellipse center, axes and angle to X/Y diameters coordinates (array version)
fr: Convertit le centre, les axes et l'angle de l'ellipse en coordonnées de diamètres X/Y (version tableau)

source: Ellipse center, axes and angle, in the form of a 2D array (N, 5)
fr: Centre, axes et angle de l'ellipse, sous la forme d'un tableau 2D (N, 5)

source: Ellipse X/Y diameters (major/minor axes) coordinates, in the form of a 2D array (N, 8)
fr: Coordonnées des diamètres X/Y de l'ellipse (grands/petits axes), sous la forme d'un tableau 2D (N, 8)

source: Ellipse X/Y diameters (major/minor axes) coordinates,
fr: Coordonnées des diamètres X/Y (grands/petits axes) de l'ellipse,

source: in the form of a 2D array (N, 8)
fr: sous la forme d'un tableau 2D (N, 8)

source: Convert ellipse X/Y diameters coordinates to center, axes and angle
fr: Convertit les coordonnées de diamètres X/Y de l'ellipse en centre, axes et angle

source: major axis start X coordinate
fr: abscisse de début du grand axe

source: major axis start Y coordinate
fr: ordonnée de début du grand axe

source: major axis end X coordinate
fr: abscisse de fin du grand axe

source: major axis end Y coordinate
fr: ordonnée de fin du grand axe

source: minor axis start X coordinate
fr: abscisse de début du petit axe

source: minor axis start Y coordinate
fr: ordonnée de début du petit axe

source: minor axis end X coordinate
fr: abscisse de fin du petit axe

source: minor axis end Y coordinate
fr: ordonnée de fin du petit axe

source: Ellipse center, axes and angle
fr: Centre, axes et angle de l'ellipse

source: Convert ellipse X/Y diameters coordinates to center, axes and angle (array version)
fr: Convertit les coordonnées de diamètres X/Y de l'ellipse en centre, axes et angle (version tableau)

source: Ellipse X/Y diameters coordinates, in the form of a 2D array (N, 8)
fr: Coordonnées de diamètres X/Y de l'ellipse, sous la forme d'un tableau 2D (N, 8)
