Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/core.computation.po
Languages: fr

source: Computation (:mod:`cdl.core.computation`)
fr: Calcul (:mod:`cdl.core.computation`)

source: This package contains the computation functions used by the DataLab project. Those functions operate directly on DataLab objects (i.e. :class:`cdl.obj.SignalObj` and :class:`cdl.obj.ImageObj`) and are designed to be used in the DataLab pipeline, but can be used independently as well.
fr: Ce paquet contient les fonctions de calcul utilisées par le projet DataLab. Ces fonctions opèrent directement sur les objets DataLab (c'est-à-dire :class:`cdl.obj.SignalObj` et :class:`cdl.obj.ImageObj`) et sont conçues pour être utilisées dans le pipeline DataLab, mais peuvent également être utilisées indépendamment.

source: The :mod:`cdl.core.computation` package is the main entry point for the DataLab computation functions when manipulating DataLab objects. See the :mod:`cdl.algorithms` package for algorithms that operate directly on NumPy arrays.
fr: Le module :mod:`cdl.core.computation` est le point d'entrée principal pour les fonctions de calcul DataLab lors de la manipulation d'objets DataLab. Voir le module :mod:`cdl.algorithms` pour les algorithmes qui opèrent directement sur les tableaux NumPy.

source: Each computation module defines a set of computation objects, that is, functions that implement processing features and classes that implement the corresponding parameters (in the form of :py:class:`guidata.dataset.datatypes.Dataset` subclasses). The computation functions takes a DataLab object (e.g. :class:`cdl.obj.SignalObj`) and a parameter object (e.g. :py:class:`cdl.param.MovingAverageParam`) as input and return a DataLab object as output (the result of the computation). The parameter object is used to configure the computation function (e.g. the size of the moving average window).
fr: Chaque module de calcul définit un ensemble d'objets de calcul, c'est-à-dire des fonctions qui implémentent des fonctionnalités de traitement et des classes qui implémentent les paramètres correspondants (sous la forme de sous-classes :py:class:`guidata.dataset.datatypes.Dataset`). Les fonctions de calcul prennent un objet DataLab (par exemple :class:`cdl.obj.SignalObj`) et un objet de paramètre (par exemple :py:class:`cdl.param.MovingAverageParam`) en entrée et renvoient un objet DataLab en sortie (le résultat du calcul). L'objet de paramètre est utilisé pour configurer la fonction de calcul (par exemple, la taille de la fenêtre de moyenne mobile).

source: In DataLab overall architecture, the purpose of this package is to provide the computation functions that are used by the :mod:`cdl.core.gui.processor` module, based on the algorithms defined in the :mod:`cdl.algorithms` module and on the data model defined in the :mod:`cdl.obj` (or :mod:`cdl.core.model`) module.
fr: Dans l'architecture globale de DataLab, le but de ce paquet est de fournir les fonctions de calcul qui sont utilisées par le module :mod:`cdl.core.gui.processor`, basé sur les algorithmes définis dans le module :mod:`cdl.algorithms` et sur le modèle de données défini dans le module :mod:`cdl.obj` (ou :mod:`cdl.core.model`).

source: The computation modules are organized in subpackages according to their purpose. The following subpackages are available:
fr: Les modules de calcul sont organisés en sous-paquets en fonction de leur objectif. Les sous-paquets suivants sont disponibles :

source: :mod:`cdl.core.computation.base`: Common processing features
fr: :mod:`cdl.core.computation.base` : fonctionnalités de traitement communes

source: :mod:`cdl.core.computation.signal`: Signal processing features
fr: :mod:`cdl.core.computation.signal` : fonctionnalités de traitement du signal

source: :mod:`cdl.core.computation.image`: Image processing features
fr: :mod:`cdl.core.computation.image` : fonctionnalités de traitement d'image

source: Common processing features
fr: Fonctionnalités de traitement communes

source: Gaussian filter parameters
fr: Paramètres du filtre gaussien

source: Moving average parameters
fr: Paramètres de la moyenne mobile

source: Moving median parameters
fr: Paramètres de la médiane mobile

source: Threshold parameters
fr: Paramètres du seuillage

source: Data clipping parameters
fr: Paramètres du rognage des données

source: ROI Editor data
fr: Données de l'éditeur de ROI

source: Create ROIDataParam instance
fr: Créer une instance de ROIDataParam

source: Return True if there is no ROI
fr: Renvoie True s'il n'y a pas de ROI

source: FFT parameters
fr: Paramètres FFT

source: Signal processing features
fr: Fonctionnalités de traitement du signal

source: Create result signal object for compute_11 function
fr: Créer un objet de signal résultant pour la fonction compute_11

source: Parameters
fr: Paramètres

source: source signal
fr: signal source

source: name of the function
fr: nom de la fonction

source: Returns
fr: Renvoie

source: result signal object
fr: objet de signal résultant

source: Return type
fr: Type de retour

source: Create result signal object for compute_n1n function
fr: Créer un objet de signal résultant pour la fonction compute_n1n

source: source signal 1
fr: signal source 1

source: source signal 2
fr: signal source 2

source: Add signal to result signal :param dst: destination signal :type dst: SignalObj :param src: source signal :type src: SignalObj
fr: Ajouter un signal au signal résultant :param dst: signal de destination :type dst: SignalObj :param src: signal source :type src: SignalObj

source: Multiply signal to result signal :param dst: destination signal :type dst: SignalObj :param src: source signal :type src: SignalObj
fr: Multiplier le signal au signal résultant :param dst: signal de destination :type dst: SignalObj :param src: signal source :type src: SignalObj

source: Compute difference between two signals :param src1: source signal 1 :type src1: SignalObj :param src2: source signal 2 :type src2: SignalObj
fr: Calculer la différence entre deux signaux :param src1: signal source 1 :type src1: SignalObj :param src2: signal source 2 :type src2: SignalObj

source: Compute quadratic difference between two signals :param src1: source signal 1 :type src1: SignalObj :param src2: source signal 2 :type src2: SignalObj
fr: Calculer la différence quadratique entre deux signaux :param src1: signal source 1 :type src1: SignalObj :param src2: signal source 2 :type src2: SignalObj

source: Compute division between two signals :param src1: source signal 1 :type src1: SignalObj :param src2: source signal 2 :type src2: SignalObj
fr: Calculer la division entre deux signaux :param src1: signal source 1 :type src1: SignalObj :param src2: signal source 2 :type src2: SignalObj

source: Extract multiple regions of interest from data :param src: source signal :type src: SignalObj :param group: group of parameters :type group: gds.DataSetGroup
fr: Extraire plusieurs régions d'intérêt des données :param src: signal source :type src: SignalObj :param group: groupe de paramètres :type group: gds.DataSetGroup

source: signal with multiple regions of interest
fr: signal avec plusieurs régions d'intérêt

source: Extract single region of interest from data :param src: source signal :type src: SignalObj :param p: parameters :type p: gds.DataSet
fr: Extraire une seule région d'intérêt des données :param src: signal source :type src: SignalObj :param p: paramètres :type p: gds.DataSet

source: signal with single region of interest
fr: signal avec une seule région d'intérêt

source: Swap axes :param src: source signal :type src: SignalObj
fr: Permuter les axes :param src: signal source :type src: SignalObj

source: Compute absolute value :param src: source signal :type src: SignalObj
fr: Calculer la valeur absolue :param src: signal source :type src: SignalObj

source: Compute real part :param src: source signal :type src: SignalObj
fr: Calculer la partie réelle :param src: signal source :type src: SignalObj

source: Compute imaginary part :param src: source signal :type src: SignalObj
fr: Calculer la partie imaginaire :param src: signal source :type src: SignalObj

source: Convert signal data type parameters
fr: Convertir les paramètres du type de données du signal

source: Convert data type :param src: source signal :param p: parameters
fr: Convertir le type de données :param src: signal source :param p: paramètres

source: Result signal object
fr: Objet de signal résultant

source: Compute Log10 :param src: source signal :type src: SignalObj
fr: Calculer Log10 :param src: signal source :type src: SignalObj

source: Peak detection parameters
fr: Paramètres de détection de pics

source: Peak detection :param src: source signal :type src: SignalObj :param p: parameters :type p: PeakDetectionParam
fr: Détection de pics :param src: signal source :type src: SignalObj :param p: paramètres :type p: PeakDetectionParam

source: Normalize parameters
fr: Paramètres de normalisation

source: Normalize data :param src: source signal :type src: SignalObj :param p: parameters :type p: NormalizeYParam
fr: Normaliser les données :param src: signal source :type src: SignalObj :param p: paramètres :type p: NormalizeYParam

source: Compute derivative :param src: source signal :type src: SignalObj
fr: Calculer la dérivée :param src: signal source :type src: SignalObj

source: Compute integral :param src: source signal :type src: SignalObj
fr: Calculer l'intégrale :param src: signal source :type src: SignalObj

source: Signal calibration parameters
fr: Paramètres d'étalonnage du signal

source: Compute linear calibration :param src: source signal :type src: SignalObj :param p: parameters :type p: XYCalibrateParam
fr: Calculer l'étalonnage linéaire :param src: signal source :type src: SignalObj :param p: paramètres :type p: XYCalibrateParam

source: Compute threshold clipping :param src: source signal :type src: SignalObj :param p: parameters :type p: ThresholdParam
fr: Calculer le rognage du seuil :param src: signal source :type src: SignalObj :param p: paramètres :type p: ThresholdParam

source: Compute maximum data clipping :param src: source signal :type src: SignalObj :param p: parameters :type p: ClipParam
fr: Calculer le rognage des données maximales :param src: signal source :type src: SignalObj :param p: paramètres :type p: ClipParam

source: Compute gaussian filter :param src: source signal :type src: SignalObj :param p: parameters :type p: GaussianParam
fr: Calculer le filtre gaussien :param src: signal source :type src: SignalObj :param p: paramètres :type p: GaussianParam

source: Compute moving average :param src: source signal :type src: SignalObj :param p: parameters :type p: MovingAverageParam
fr: Calculer la moyenne mobile :param src: signal source :type src: SignalObj :param p: paramètres :type p: MovingAverageParam

source: Compute moving median :param src: source signal :type src: SignalObj :param p: parameters :type p: MovingMedianParam
fr: Calculer la médiane mobile :param src: signal source :type src: SignalObj :param p: paramètres :type p: MovingMedianParam

source: Compute Wiener filter :param src: source signal :type src: SignalObj
fr: Calculer le filtre de Wiener :param src: signal source :type src: SignalObj

source: Compute FFT :param src: source signal :type src: SignalObj :param p: parameters :type p: FFTParam
fr: Calculer FFT :param src: signal source :type src: SignalObj :param p: paramètres :type p: FFTParam

source: Compute iFFT :param src: source signal :type src: SignalObj :param p: parameters :type p: FFTParam
fr: Calculer iFFT :param src: signal source :type src: SignalObj :param p: paramètres :type p: FFTParam

source: Polynomial fitting parameters
fr: Paramètres de l'ajustement polynomial

source: FWHM parameters
fr: Paramètres LMH

source: Compute FWHM
fr: Calculer LMH

source: Compute FW at 1/e²
fr: Calculer largeur à 1/e²

source: Interpolation parameters
fr: Paramètres d'interpolation

source: Interpolate data :param src1: source signal 1 :type src1: SignalObj :param src2: source signal 2 :type src2: SignalObj :param p: parameters :type p: InterpolationParam
fr: Interpoler les données :param src1: signal source 1 :type src1: SignalObj :param src2: signal source 2 :type src2: SignalObj :param p: paramètres :type p: InterpolationParam

source: Resample parameters
fr: Paramètres de rééchantillonnage

source: Resample data :param src: source signal :type src: SignalObj :param p: parameters :type p: ResampleParam
fr: Rééchantillonner les données :param src: signal source :type src: SignalObj :param p: paramètres :type p: ResampleParam

source: Detrending parameters
fr: Paramètres d'élimination de tendance

source: Detrend data :param src: source signal :type src: SignalObj :param p: parameters :type p: DetrendingParam
fr: Éliminer la tendance des données :param src: signal source :type src: SignalObj :param p: paramètres :type p: DetrendingParam

source: Compute convolution of two signals :param src1: source signal 1 :type src1: SignalObj :param src2: source signal 2 :type src2: SignalObj
fr: Calculer la convolution de deux signaux :param src1: signal source 1 :type src1: SignalObj :param src2: signal source 2 :type src2: SignalObj

source: Image processing features
fr: Fonctionnalités de traitement d'image

source: Base image processing features
fr: Fonctionnalités de traitement d'image de base

source: Create result image object for compute_11 function
fr: Créer un objet d'image résultant pour la fonction compute_11

source: input image object
fr: objet d'image d'entrée

source: name of the processing function
fr: nom de la fonction de traitement

source: output image object
fr: objet d'image résultant

source: output signal object
fr: objet de signal résultant

source: Create result image object for compute_n1n function
fr: Créer un objet d'image résultant pour la fonction compute_n1n

source: Compute addition between two images
fr: Calculer l'addition entre deux images

source: Compute product between two images
fr: Calculer le produit entre deux images

source: Compute difference between two images :param src1: input image object :type src1: ImageObj :param src2: input image object :type src2: ImageObj
fr: Calculer la différence entre deux images :param src1: objet d'image d'entrée :type src1: ImageObj :param src2: objet d'image d'entrée :type src2: ImageObj

source: Compute quadratic difference between two images :param src1: input image object :type src1: ImageObj :param src2: input image object :type src2: ImageObj
fr: Calculer la différence quadratique entre deux images :param src1: objet d'image d'entrée :type src1: ImageObj :param src2: objet d'image d'entrée :type src2: ImageObj

source: Compute division between two images :param src1: input image object :type src1: ImageObj :param src2: input image object :type src2: ImageObj
fr: Calculer la division entre deux images :param src1: objet d'image d'entrée :type src1: ImageObj :param src2: objet d'image d'entrée :type src2: ImageObj

source: Flat-field parameters
fr: Paramètres de correction de champ plat

source: Compute flat field correction :param src1: raw data image object :type src1: ImageObj :param src2: flat field image object :type src2: ImageObj :param p: flat field parameters :type p: FlatFieldParam
fr: Calculer la correction de champ plat :param src1: objet d'image de données brutes :type src1: ImageObj :param src2: objet d'image de champ plat :type src2: ImageObj :param p: paramètres de champ plat :type p: FlatFieldParam

source: Log10 parameters
fr: Paramètres Log10

source: Compute log10(z+n) :param src: input image object :type src: ImageObj :param p: parameters :type p: LogP1Param
fr: Calculer log10(z+n) :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: LogP1Param

source: Rotate parameters
fr: Paramètres de rotation

source: Apply rotation to coords associated to image obj :param angle: rotation angle (in degrees) :type angle: float :param obj: image object :type obj: ImageObj :param orig: original image object :type orig: ImageObj :param coords: coordinates to rotate :type coords: numpy.ndarray
fr: Appliquer la rotation aux coordonnées associées à l'objet d'image :param angle: angle de rotation (en degrés) :type angle: float :param obj: objet d'image :type obj: ImageObj :param orig: objet d'image original :type orig: ImageObj :param coords: coordonnées à faire pivoter :type coords: numpy.ndarray

source: output data
fr: données de sortie

source: Apply rotation to coords associated to image obj
fr: Appliquer la rotation aux coordonnées associées à l'objet d'image

source: Rotate data :param src: input image object :type src: ImageObj :param p: parameters :type p: RotateParam
fr: Rotation des données :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: RotateParam

source: Rotate data 90° :param src: input image object :type src: ImageObj
fr: Rotation des données 90° :param src: objet d'image d'entrée :type src: ImageObj

source: Rotate data 270° :param src: input image object :type src: ImageObj
fr: Rotation des données 270° :param src: objet d'image d'entrée :type src: ImageObj

source: Apply HFlip to coords
fr: Appliquer HFlip aux coordonnées

source: Flip data horizontally :param src: input image object :type src: ImageObj
fr: Retourner les données horizontalement :param src: objet d'image d'entrée :type src: ImageObj

source: Apply VFlip to coords
fr: Appliquer VFlip aux coordonnées

source: Flip data vertically :param src: input image object :type src: ImageObj
fr: Retourner les données verticalement :param src: objet d'image d'entrée :type src: ImageObj

source: Grid parameters
fr: Paramètres de grille

source: Resize parameters
fr: Paramètres de redimensionnement

source: Zooming function :param src: input image object :type src: ImageObj :param p: parameters :type p: ResizeParam
fr: Fonction de zoom :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: ResizeParam

source: Binning parameters
fr: Paramètres de binning

source: Binning function on data :param src: input image object :type src: ImageObj :param param: parameters :type param: BinningParam
fr: Fonction de binning sur les données :param src: objet d'image d'entrée :type src: ImageObj :param param: paramètres :type param: BinningParam

source: Extract multiple regions of interest from data :param src: input image object :type src: ImageObj :param group: parameters defining the regions of interest :type group: gds.DataSetGroup
fr: Extraire plusieurs régions d'intérêt des données :param src: objet d'image d'entrée :type src: ImageObj :param group: paramètres définissant les régions d'intérêt :type group: gds.DataSetGroup

source: Extract single ROI :param src: input image object :type src: ImageObj :param p: ROI parameters :type p: gds.DataSet
fr: Extraire une seule région d'intérêt :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres de la région d'intérêt :type p: gds.DataSet

source: Horizontal or vertical profile parameters
fr: Paramètres de profil horizontal ou vertical

source: Compute horizontal or vertical profile :param src: input image object :param p: parameters
fr: Calculer le profil horizontal ou vertical :param src: objet d'image d'entrée :param p: paramètres

source: Output image object
fr: Objet d'image de sortie

source: Average horizontal or vertical profile parameters
fr: Paramètres de profil horizontal ou vertical moyen

source: Compute horizontal or vertical average profile :param src: input image object :param p: parameters
fr: Calculer le profil horizontal ou vertical moyen :param src: objet d'image d'entrée :param p: paramètres

source: Swap image axes :param src: input image object :type src: ImageObj
fr: Permuter les axes de l'image :param src: objet d'image d'entrée :type src: ImageObj

source: Compute absolute value :param src: input image object :type src: ImageObj
fr: Calculer la valeur absolue :param src: objet d'image d'entrée :type src: ImageObj

source: Compute real part :param src: input image object :type src: ImageObj
fr: Calculer la partie réelle :param src: objet d'image d'entrée :type src: ImageObj

source: Compute imaginary part :param src: input image object :type src: ImageObj
fr: Calculer la partie imaginaire :param src: objet d'image d'entrée :type src: ImageObj

source: Convert image data type parameters
fr: Convertir les paramètres du type de données de l'image

source: Convert image data type :param src: input image object :param p: parameters
fr: Convertir le type de données de l'image :param src: objet d'image d'entrée :param p: paramètres

source: Compute log10 :param src: input image object :type src: ImageObj
fr: Calculer log10 :param src: objet d'image d'entrée :type src: ImageObj

source: Image linear calibration parameters
fr: Paramètres d'étalonnage linéaire de l'image

source: Compute linear calibration :param src: input image object :type src: ImageObj :param param: calibration parameters :type param: ZCalibrateParam
fr: Calculer l'étalonnage linéaire :param src: objet d'image d'entrée :type src: ImageObj :param param: paramètres d'étalonnage :type param: ZCalibrateParam

source: Apply thresholding :param src: input image object :type src: ImageObj :param p: parameters :type p: ThresholdParam
fr: Appliquer le seuillage :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: ThresholdParam

source: Apply clipping :param src: input image object :type src: ImageObj :param p: parameters :type p: ClipParam
fr: Appliquer le rognage :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: ClipParam

source: Compute gaussian filter :param src: input image object :type src: ImageObj :param p: parameters :type p: GaussianParam
fr: Calculer le filtre gaussien :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: GaussianParam

source: Compute moving average :param src: input image object :type src: ImageObj :param p: parameters :type p: MovingAverageParam
fr: Calculer la moyenne mobile :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MovingAverageParam

source: Compute moving median :param src: input image object :type src: ImageObj :param p: parameters :type p: MovingMedianParam
fr: Calculer la médiane mobile :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MovingMedianParam

source: Compute Wiener filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Wiener :param src: objet d'image d'entrée :type src: ImageObj

source: Compute FFT :param src: input image object :type src: ImageObj :param p: parameters :type p: FFTParam
fr: Calculer FFT :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: FFTParam

source: Compute inverse FFT :param src: input image object :type src: ImageObj :param p: parameters :type p: FFTParam
fr: Calculer l'inverse de FFT :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: FFTParam

source: Butterworth filter parameters
fr: Paramètres du filtre de Butterworth

source: Compute Butterworth filter :param src: input image object :type src: ImageObj :param p: parameters :type p: ButterworthParam
fr: Calculer le filtre de Butterworth :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: ButterworthParam

source: Exec computation taking into account image x0, y0, dx, dy and ROIs
fr: Exécuter le calcul en tenant compte de l'image x0, y0, dx, dy et ROIs

source: computation function
fr: fonction de calcul

source: computation function arguments
fr: arguments de la fonction de calcul

source: Computation result
fr: Résultat du calcul
