Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/core.computation.po
Languages: fr

source: The computation function must take either a single argument (the data) or multiple arguments (the data followed by the computation parameters).
fr: La fonction de calcul doit prendre un seul argument (les données) ou de multiples arguments (les données suivies des paramètres de calcul).

source: Moreover, the computation function must return a single value or a NumPy array containing the result of the computation. This array contains the coordinates of points, polygons, circles or ellipses in the form [[x, y], ...], or [[x0, y0, x1, y1, ...], ...], or [[x0, y0, r], ...], or [[x0, y0, a, b, theta], ...].
fr: De plus, la fonction de calcul doit renvoyer une seule valeur ou un tableau NumPy contenant le résultat du calcul. Ce tableau contient les coordonnées des points, des polygones, des cercles ou des ellipses sous la forme [[x, y], ...], ou [[x0, y0, x1, y1, ...], ...], ou [[x0, y0, r], ...], ou [[x0, y0, a, b, theta], ...].

source: Return centroid coordinates :param data: input data :type data: numpy.ndarray
fr: Retourner les coordonnées du centre de gravité :param data: données d'entrée :type data: numpy.ndarray

source: centroid coordinates
fr: coordonnées du centre de gravité

source: Compute centroid :param image: input image :type image: ImageObj
fr: Calculer le centre de gravité :param image: image d'entrée :type image: ImageObj

source: Return diameter coords for the circle contour enclosing image values above threshold (FWHM) :param data: input data :type data: numpy.ndarray
fr: Retourner les coordonnées du diamètre pour le contour du cercle contenant les valeurs d'image au-dessus du seuil (LMH) :param data: données d'entrée :type data: numpy.ndarray

source: diameter coords
fr: coordonnées du diamètre

source: Compute minimum enclosing circle :param image: input image :type image: ImageObj
fr: Calculer le cercle minimum contenant :param image: image d'entrée :type image: ImageObj

source: Circle Hough transform parameters
fr: Paramètres de transformation de Hough circulaire

source: Compute Hough circles :param image: input image :type image: ImageObj :param p: parameters :type p: HoughCircleParam
fr: Calculer les cercles de Hough :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: HoughCircleParam

source: circle coordinates
fr: coordonnées du cercle

source: Exposure correction features
fr: Fonctionnalités de correction d'exposition

source: Exposure computation module
fr: Module de calcul d'exposition

source: Gamma adjustment parameters
fr: Paramètres d'ajustement gamma

source: Gamma correction :param src: input image object :type src: ImageObj :param p: parameters :type p: AdjustGammaParam
fr: Correction gamma :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: AdjustGammaParam

source: Logarithmic adjustment parameters
fr: Paramètres d'ajustement logarithmique

source: Compute log correction :param src: input image object :type src: ImageObj :param p: parameters :type p: AdjustLogParam
fr: Calculer la correction logarithmique :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: AdjustLogParam

source: Sigmoid adjustment parameters
fr: Paramètres d'ajustement sigmoïde

source: Compute sigmoid correction :param src: input image object :type src: ImageObj :param p: parameters :type p: AdjustSigmoidParam
fr: Calculer la correction sigmoïde :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: AdjustSigmoidParam

source: Intensity rescaling parameters
fr: Paramètres de rééchelonnement d'intensité

source: Rescale image intensity levels :param src: input image object :type src: ImageObj :param p: parameters :type p: RescaleIntensityParam
fr: Rééchelonner les niveaux d'intensité de l'image :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: RescaleIntensityParam

source: Histogram equalization parameters
fr: Paramètres d'égalisation d'histogramme

source: Histogram equalization :param src: input image object :type src: ImageObj :param p: parameters :type p: EqualizeHistParam
fr: Égalisation d'histogramme :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: EqualizeHistParam

source: Adaptive histogram equalization parameters
fr: Paramètres d'égalisation d'histogramme adaptatif

source: Adaptive histogram equalization :param src: input image object :type src: ImageObj :param p: parameters :type p: EqualizeAdaptHistParam
fr: Égalisation d'histogramme adaptatif :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: EqualizeAdaptHistParam

source: Restoration features
fr: Fonctionnalités de restauration

source: Restoration computation module
fr: Module de calcul de restauration

source: Total Variation denoising parameters
fr: Paramètres de débruitage de variation totale

source: Compute Total Variation denoising :param src: input image object :type src: ImageObj :param p: parameters :type p: DenoiseTVParam
fr: Calculer le débruitage de variation totale :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: DenoiseTVParam

source: Bilateral filter denoising parameters
fr: Paramètres de débruitage du filtre bilatéral

source: Compute bilateral filter denoising :param src: input image object :type src: ImageObj :param p: parameters :type p: DenoiseBilateralParam
fr: Calculer le débruitage du filtre bilatéral :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: DenoiseBilateralParam

source: Wavelet denoising parameters
fr: Paramètres de débruitage d'ondelettes

source: Compute Wavelet denoising :param src: input image object :type src: ImageObj :param p: parameters :type p: DenoiseWaveletParam
fr: Calculer le débruitage d'ondelettes :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: DenoiseWaveletParam

source: Denoise using White Top-Hat :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Débruitage à l'aide de White Top-Hat :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Morphological features
fr: Fonctionnalités morphologiques

source: Morphology computation module
fr: Module de calcul de morphologie

source: White Top-Hat parameters
fr: Paramètres de White Top-Hat

source: Compute White Top-Hat :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer White Top-Hat :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Compute Black Top-Hat :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer Black Top-Hat :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Compute Erosion :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer l'érosion :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Compute Dilation :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer la dilatation :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Compute morphological opening :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer l'ouverture morphologique :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Compute morphological closing :param src: input image object :type src: ImageObj :param p: parameters :type p: MorphologyParam
fr: Calculer la fermeture morphologique :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: MorphologyParam

source: Edge detection features
fr: Fonctionnalités de détection de contours

source: Edges computation module
fr: Module de calcul de contours

source: Canny filter parameters
fr: Paramètres du filtre de Canny

source: Compute Canny filter :param src: input image object :type src: ImageObj :param p: parameters :type p: CannyParam
fr: Calculer le filtre de Canny :param src: objet d'image d'entrée :type src: ImageObj :param p: paramètres :type p: CannyParam

source: Compute Roberts filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Roberts :param src: objet d'image d'entrée :type src: ImageObj

source: Compute Prewitt filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Prewitt :param src: objet d'image d'entrée :type src: ImageObj

source: Compute horizontal Prewitt filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Prewitt horizontal :param src: objet d'image d'entrée :type src: ImageObj

source: Compute vertical Prewitt filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Prewitt vertical :param src: objet d'image d'entrée :type src: ImageObj

source: Compute Sobel filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Sobel :param src: objet d'image d'entrée :type src: ImageObj

source: Compute horizontal Sobel filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Sobel horizontal :param src: objet d'image d'entrée :type src: ImageObj

source: Compute vertical Sobel filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Sobel vertical :param src: objet d'image d'entrée :type src: ImageObj

source: Compute Scharr filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Scharr :param src: objet d'image d'entrée :type src: ImageObj

source: Compute horizontal Scharr filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Scharr horizontal :param src: objet d'image d'entrée :type src: ImageObj

source: Compute vertical Scharr filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Scharr vertical :param src: objet d'image d'entrée :type src: ImageObj

source: Compute Farid filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Farid :param src: objet d'image d'entrée :type src: ImageObj

source: Compute horizontal Farid filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Farid horizontal :param src: objet d'image d'entrée :type src: ImageObj

source: Compute vertical Farid filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Farid vertical :param src: objet d'image d'entrée :type src: ImageObj

source: Compute Laplace filter :param src: input image object :type src: ImageObj
fr: Calculer le filtre de Laplace :param src: objet d'image d'entrée :type src: ImageObj

source: Detection features
fr: Fonctionnalités de détection

source: Blob detection computation module
fr: Module de calcul de détection de taches

source: Generic detection parameters
fr: Paramètres de détection génériques

source: Compute 2D peak detection :param image: input image :type image: ImageObj :param p: parameters :type p: Peak2DDetectionParam
fr: Calculer la détection de pics 2D :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: Peak2DDetectionParam

source: peak coordinates
fr: coordonnées du pic

source: Contour shape parameters
fr: Paramètres de forme de contour

source: Compute contour shape fit
fr: Calculer l'ajustement de la forme du contour

source: Base class for blob detection parameters
fr: Classe de base pour les paramètres de détection de taches

source: Blob detection using Difference of Gaussian method
fr: Détection de taches à l'aide de la méthode de différence de Gauss

source: Compute blobs using Difference of Gaussian method :param image: input image :type image: ImageObj :param p: parameters :type p: BlobDOGParam
fr: Calculer les taches à l'aide de la méthode de différence de Gauss :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: BlobDOGParam

source: blobs coordinates
fr: coordonnées des taches

source: Blob detection using Determinant of Hessian method
fr: Détection de taches à l'aide de la méthode du déterminant de Hessian

source: Compute blobs using Determinant of Hessian method :param image: input image :type image: ImageObj :param p: parameters :type p: BlobDOHParam
fr: Calculer les taches à l'aide de la méthode du déterminant de Hessian :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: BlobDOHParam

source: Blob detection using Laplacian of Gaussian method
fr: Détection de taches à l'aide de la méthode du Laplacien de Gauss

source: Compute blobs using Laplacian of Gaussian method :param image: input image :type image: ImageObj :param p: parameters :type p: BlobLOGParam
fr: Calculer les taches à l'aide de la méthode du Laplacien de Gauss :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: BlobLOGParam

source: Blob detection using OpenCV
fr: Détection de taches à l'aide d'OpenCV

source: Compute blobs using OpenCV :param image: input image :type image: ImageObj :param p: parameters :type p: BlobOpenCVParam
fr: Calculer les taches à l'aide d'OpenCV :param image: image d'entrée :type image: ImageObj :param p: paramètres :type p: BlobOpenCVParam
