Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/index.po
Languages: fr

source: Public features:
fr: Fonctionnalités publiques :

source: Internal features:
fr: Fonctionnalités internes :

source: The public Application Programming Interface (API) of DataLab offers a set of functions to access the DataLab features. Those functions are available in various submodules of the `sigima` and `datalab` packages. The `sigima` package is the computation engine of DataLab, while the `datalab` package provides the interface to access the application features. The following table lists the available submodules and their purpose:
fr: L'interface de programmation d'application (API) publique de DataLab offre un ensemble de fonctions pour accéder aux fonctionnalités de DataLab. Ces fonctions sont disponibles dans divers sous-modules des paquets `sigima` et `datalab`. Le paquet `sigima` est le moteur de calcul de DataLab, tandis que le paquet `datalab` fournit l'interface pour accéder aux fonctionnalités de l'application. Le tableau suivant répertorie les sous-modules disponibles et leur objectif :

source: Submodule
fr: Sous-module

source: Purpose
fr: Contenu

source: Algorithms for data analysis (operating on NumPy arrays) which purpose is to fill in the gaps of common scientific libraries (NumPy, SciPy, scikit-image, etc.), offering consistent tools for computation functions (see :mod:`sigima.proc`)
fr: Algorithmes pour l'analyse de données (opérant sur des tableaux NumPy) dont le but est de combler les lacunes des bibliothèques scientifiques courantes (NumPy, SciPy, scikit-image, etc.), offrant des outils cohérents pour les fonctions de calcul (voir :mod:`sigima.proc`)

source: Sets of parameters for configuring computation functions (these parameters are instances of :class:`guidata.dataset.DataSet` objects)
fr: Ensembles de paramètres pour configurer les fonctions de calcul (ces paramètres sont des instances d'objets :class:`guidata.dataset.DataSet`)

source: Object model for signals and images (:class:`sigima.objects.SignalObj` and :class:`sigima.objects.ImageObj`) and related functions
fr: Modèle objet pour les signaux et les images (:class:`sigima.objects.SignalObj` et :class:`sigima.objects.ImageObj`) et fonctions associées

source: Computation functions, which operate on signal and image objects (:class:`sigima.objects.SignalObj` or :class:`sigima.objects.ImageObj`)
fr: Fonctions de calcul, qui opèrent sur des objets signaux et images (:class:`sigima.objects.SignalObj` ou :class:`sigima.objects.ImageObj`)

source: Proxy objects to access the DataLab interface from a Python script or a remote application
fr: Objets proxy pour accéder à l'interface DataLab à partir d'un script Python ou d'une application distante
