Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/obj.po
Languages: fr

source: Object model (:mod:`cdl.obj`)
fr: Modèle de données (:mod:`cdl.obj`)

source: The :mod:`cdl.obj` module aims at providing all the necessary classes and functions to create and manipulate DataLab signal and image objects.
fr: Le module :mod:`cdl.obj` fournit les classes et fonctions nécessaires pour créer et manipuler des objets signal et image.

source: Those classes and functions are defined in other modules:
fr: Ces classes et fonctions sont définies dans d'autres modules :

source: The :mod:`cdl.obj` module is thus a convenient way to import all the objects at once. As a matter of fact, the following import statement is equivalent to the previous one:
fr: Le module :mod:`cdl.obj` est donc un moyen pratique d'importer tous les objets en une seule fois. En fait, l'instruction d'importation suivante est équivalente à la précédente :

source: Common objects
fr: Objets communs

source: ROI index is starting at 0 (or is simply 0 if there is no ROI).
fr: L'index de la ROI commence à 0 (ou est simplement 0 s'il n'y a pas de ROI).

source: Parameters
fr: Paramètres

source: Returns
fr: Renvoie

source: Array of shown results
fr: Tableau des résultats affichés

source: Object representing a geometrical shape serializable in signal/image metadata.
fr: Objet représentant une forme géométrique sérialisable dans les métadonnées du signal/image.

source: Result `array` is a NumPy 2-D array: each row is a result, optionnally associated to a ROI (first column value).
fr: Le tableau de résultats `array` est un tableau NumPy 2-D : chaque ligne est un résultat, éventuellement associé à une ROI (valeur de la première colonne).

source: shape coordinates (multiple shapes: one shape per row), first column is ROI index (0 if there is no ROI)
fr: coordonnées de la forme (plusieurs formes : une forme par ligne), la première colonne est l'index de la ROI (0 s'il n'y a pas de ROI)

source: Raises
fr: Lève

source: invalid argument
fr: argument invalide

source: Merge object resultshape with another's: obj <-- other_obj or simply merge this resultshape with obj if other_obj is None
fr: Fusionne la forme résultat de l'objet avec celle d'un autre : obj <-- other_obj ou fusionne simplement cette forme résultat avec obj si other_obj est None

source: Transform shape coordinates.
fr: Transforme les coordonnées de la forme.

source: function to transform coordinates
fr: fonction pour transformer les coordonnées

source: Iterate over metadata shape plot items.
fr: Itère sur les éléments de tracé de la forme de métadonnées.

source: numeric format (e.g. "%.3f")
fr: format numérique (par exemple "%.3f")

source: if True, show shape labels
fr: si True, affiche les étiquettes de forme

source: shape style option (e.g. "shape/drag")
fr: option de style de forme (par exemple "shape/drag")

source: Yields
fr: Produit (`yield`)

source: Plot item
fr: Item graphique

source: shape data
fr: données de forme

source: Shape types for image metadata
fr: Types de formes pour les métadonnées d'image

source: Rectangle shape
fr: Forme rectangulaire

source: Circle shape
fr: Forme circulaire

source: Ellipse shape
fr: Forme elliptique

source: Segment shape
fr: Forme segment

source: Marker shape
fr: Forme marqueur

source: Point shape
fr: Forme point

source: Polygon shape
fr: Forme polygonale

source: Uniform-law random signal/image parameters
fr: Paramètres de signal/image aléatoire de loi uniforme

source: Do something in case of integer min-max range
fr: Fait quelque chose en cas de plage min-max entière

source: Normal-law random signal/image parameters
fr: Paramètres de signal/image aléatoire de loi normale

source: Signal model
fr: Modèle de signal

source: Signal object
fr: Objet signal

source: Regenerate UUID
fr: Regénère l'UUID

source: This method is used to regenerate UUID after loading the object from a file. This is required to avoid UUID conflicts when loading objects from file without clearing the workspace first.
fr: Cette méthode est utilisée pour régénérer l'UUID après avoir chargé l'objet à partir d'un fichier. Cela est nécessaire pour éviter les conflits d'UUID lors du chargement d'objets à partir d'un fichier sans effacer l'espace de travail au préalable.

source: Copy object.
fr: Copie l'objet.

source: title
fr: titre

source: data type
fr: type de données

source: Copied object
fr: Objet copié

source: Change data type.
fr: Change le type de données.

source: Set xy data
fr: Définit les données xy

source: x data
fr: données x

source: y data
fr: données y

source: dx data (optional: error bars)
fr: données dx (optionnel : barres d'erreur)

source: dy data (optional: error bars)
fr: données dy (optionnel : barres d'erreur)

source: Get x data
fr: Récupère les données x

source: Get y data
fr: Récupère les données y

source: Get dx data
fr: Récupère les données dx

source: Get dy data
fr: Récupère les données dy

source: Return original data (if ROI is not defined or `roi_index` is None), or ROI data (if both ROI and `roi_index` are defined).
fr: Renvoie les données originales (si la ROI n'est pas définie ou si l'`roi_index` est None), ou les données de la ROI (si la ROI et l'`roi_index` sont définis).

source: ROI index
fr: index de la ROI

source: Data
fr: Données

source: Update plot item parameters from object data/metadata
fr: Met à jour les paramètres de l'élément de tracé à partir des données/métadonnées de l'objet

source: Takes into account a subset of plot item parameters. Those parameters may have been overriden by object metadata entries or other object data. The goal is to update the plot item accordingly.
fr: Prend en compte un sous-ensemble de paramètres d'élément de tracé. Ces paramètres peuvent avoir été remplacés par des entrées de métadonnées d'objet ou d'autres données d'objet. Le but est de mettre à jour l'élément de tracé en conséquence.

source: This is *almost* the inverse operation of `update_metadata_from_plot_item`.
fr: C'est *presque* l'opération inverse de `update_metadata_from_plot_item`.

source: plot item
fr: élément de tracé

source: Update metadata from plot item.
fr: Met à jour les métadonnées à partir de l'élément de tracé.

source: Takes into account a subset of plot item parameters. Those parameters may have been modified by the user through the plot item GUI. The goal is to update the metadata accordingly.
fr: Prend en compte un sous-ensemble de paramètres d'élément de tracé. Ces paramètres peuvent avoir été modifiés par l'utilisateur via l'interface graphique de l'élément de tracé. Le but est de mettre à jour les métadonnées en conséquence.

source: This is *almost* the inverse operation of `update_plot_item_parameters`.
fr: C'est *presque* l'opération inverse de `update_plot_item_parameters`.

source: Make plot item from data.
fr: Crée un élément de tracé à partir des données.

source: plot item to update from
fr: élément de tracé à mettre à jour à partir de

source: Update plot item from data.
fr: Met à jour l'élément de tracé à partir des données.

source: if True, data has changed
fr: si True, les données ont changé

source: Convert ROI coordinates to indexes.
fr: Convertit les coordonnées de la ROI en index.

source: coordinates
fr: coordonnées

source: Indexes
fr: Indices

source: Return type
fr: Type de retour

source: Convert ROI dataset group to ROI array data.
fr: Convertit le groupe de données de la ROI en données de tableau de la ROI.

source: ROI dataset group
fr: groupe de données de la ROI

source: ROI array data
fr: données de tableau de la ROI

source: Return a new ROI item from scratch
fr: Renvoyer un nouvel élément ROI à partir de zéro

source: format string
fr: chaîne de format

source: if True, add label
fr: si True, ajouter une étiquette

source: if True, ROI is editable
fr: si True, ROI est modifiable

source: Make plot item representing a Region of Interest.
fr: Créer un élément de tracé représentant une région d'intérêt.

source: Add label with title annotation
fr: Ajouter une étiquette avec une annotation de titre

source: title (if None, use signal title)
fr: titre (si None, utiliser le titre du signal)

source: Helper function that passes the visitor to the accept methods of all the items in this dataset
fr: Fonction d'aide qui transmet le visiteur aux méthodes accept des éléments dans cet ensemble de données

source: visitor object
fr: objet visiteur

source: Add object annotations from file (JSON).
fr: Ajouter des annotations d'objet à partir d'un fichier (JSON).

source: filename
fr: nom du fichier

source: Add object annotations (annotation plot items).
fr: Ajouter des annotations d'objet (éléments de tracé d'annotation).

source: annotation plot items
fr: éléments de tracé d'annotation

source: Get object annotations (JSON string describing annotation plot items)
fr: Obtenir les annotations d'objet (chaîne JSON décrivant les éléments de tracé d'annotation)

source: Check the dataset item values
fr: Vérifier les valeurs des éléments de l'ensemble de données

source: list of errors
fr: liste des erreurs

source: Check if data is valid, raise an exception if that's not the case
fr: Vérifier si les données sont valides, lever une exception si ce n'est pas le cas

source: if data type is not supported
fr: si le type de données n'est pas pris en charge

source: Deserialize the dataset
fr: Désérialiser l'ensemble de données

source: reader object
fr: objet lecteur

source: Open a dialog box to edit data set
fr: Ouvrir une boîte de dialogue pour modifier l'ensemble de données

source: parent widget (default is None, meaning no parent)
fr: widget parent (par défaut, None signifie pas de parent)

source: apply callback (default is None)
fr: callback d'application (par défaut, None)

source: if True, comment text is wordwrapped
fr: si True, le texte du commentaire est enveloppé

source: dialog size (QSize object or integer tuple (width, height))
fr: taille de la boîte de dialogue (objet QSize ou tuple d'entiers (largeur, hauteur))

source: Return data set comment
fr: Renvoyer le commentaire de l'ensemble de données

source: comment
fr: commentaire

source: Return data set icon
fr: Renvoyer l'icône de l'ensemble de données

source: icon
fr: icône

source: Returns all the DataItem objects from the DataSet instance. Ignore private items that have a name starting with an underscore (e.g. '_private_item = ...')
fr: Renvoie tous les objets DataItem de l'instance DataSet. Ignore les objets privés qui ont un nom commençant par un tiret bas (par exemple '_private_item = ...')

source: If True, deepcopy the DataItem list, else return the original.
fr: Si True, effectue une copie profonde de la liste DataItem, sinon renvoie l'original.

source: Return metadata option value
fr: Renvoyer la valeur de l'option de métadonnées

source: A metadata option is a metadata entry starting with an underscore. It is a way to store application-specific options in object metadata.
fr: Une option de métadonnées est une entrée de métadonnées commençant par un underscore. C'est un moyen de stocker des options spécifiques à l'application dans les métadonnées de l'objet.

source: option name
fr: nom de l'option

source: Option value
fr: Valeur de l'option

source: Valid option names:
fr: Noms d'options valides :

source: 'format': format string 'showlabel': show label
fr: 'format': chaîne de format 'showlabel': afficher l'étiquette

source: Return data set title
fr: Renvoyer le titre de l'ensemble de données

source: Get valid data type names
fr: Obtenir les noms de types de données valides

source: Valid data type names supported by this class
fr: Noms de types de données valides pris en charge par cette classe

source: Iterate over object result shapes.
fr: Itérer sur les formes de résultat de l'objet.

source: Result shape
fr: Forme résultat

source: Iterate over object ROI indexes ([0] if there is no ROI)
fr: Itérer sur les index de ROI de l'objet ([0] s'il n'y a pas de ROI)

source: Iterate over computing items encoded in metadata (if any).
fr: Itérer sur les éléments de calcul encodés dans les métadonnées (s'il y en a).

source: Return object number (used for short ID)
fr: Renvoyer le numéro de l'objet (utilisé pour l'ID court)

source: Read configuration from a UserConfig instance
fr: Lire la configuration à partir d'une instance UserConfig

source: UserConfig instance
fr: instance UserConfig

source: section name
fr: nom de la section

source: Remove metadata shapes and ROIs
fr: Supprimer les formes de métadonnées et les ROI

source: Reset metadata to default values
fr: Réinitialiser les métadonnées aux valeurs par défaut

source: Return object regions of interest array (one ROI per line).
fr: Renvoie le tableau des régions d'intérêt de l'objet (une ROI par ligne).

source: Regions of interest array
fr: Tableau des régions d'intérêt

source: Return True if ROI has changed since last call to this method.
fr: Renvoie True si la ROI a changé depuis le dernier appel à cette méthode.

source: The first call to this method will return True if ROI has not yet been set, or if ROI has been set and has changed since the last call to this method. The next call to this method will always return False if ROI has not changed in the meantime.
fr: Le premier appel à cette méthode renverra True si la ROI n'a pas encore été définie, ou si la ROI a été définie et a changé depuis le dernier appel à cette méthode. Le prochain appel à cette méthode renverra toujours False si la ROI n'a pas changé entre-temps.

source: True if ROI has changed
fr: True si la ROI a changé

source: Convert ROI array data to ROI dataset group.
fr: Convertit les données du tableau ROI en groupe de jeu de données ROI.

source: Serialize the dataset
fr: Sérialiser le jeu de données

source: writer object
fr: objet écrivain

source: Set default values
fr: Définir les valeurs par défaut

source: Set global properties for all data items in the dataset
fr: Définir les propriétés globales pour tous les éléments de données du jeu de données

source: realm name
fr: nom du domaine

source: properties to set
fr: propriétés à définir

source: Set metadata option value
fr: Définir la valeur de l'option de métadonnées

source: option value
fr: valeur de l'option

source: Short object ID
fr: ID court de l'objet

source: Edit data set with text input only
fr: Modifier le jeu de données avec une saisie de texte uniquement

source: Return readable string representation of the data set If debug is True, add more details on data items
fr: Renvoie une représentation lisible du jeu de données. Si debug est True, ajoute plus de détails sur les éléments de données

source: if True, add more details on data items
fr: si True, ajoute plus de détails sur les éléments de données

source: indentation string (default is None, meaning no indentation)
fr: chaîne d'indentation (par défaut, None signifie aucune indentation)

source: if True, align data items (default is False)
fr: si True, aligne les éléments de données (par défaut, False)

source: if True, show hidden data items (default is True)
fr: si True, affiche les éléments de données masqués (par défaut, True)

source: string representation of the data set
fr: représentation sous forme de chaîne du jeu de données

source: Apply transform function to result shape / annotations coordinates.
fr: Appliquer la fonction de transformation aux coordonnées de la forme / des annotations du résultat.

source: original object
fr: objet d'origine

source: transform function
fr: fonction de transformation

source: transform function parameter
fr: paramètre de la fonction de transformation

source: Update metadata view settings from Conf.view
fr: Mettre à jour les paramètres d'affichage des métadonnées à partir de Conf.view

source: Update geometric shape from another object (merge metadata).
fr: Mettre à jour la forme géométrique à partir d'un autre objet (fusionner les métadonnées).

source: other object, from which to update this object
fr: autre objet, à partir duquel mettre à jour cet objet

source: Open a dialog box to view data set
fr: Ouvrir une boîte de dialogue pour afficher le jeu de données

source: Write configuration to a UserConfig instance
fr: Écrire la configuration dans une instance UserConfig

source: Read a signal from a file.
fr: Lire un signal à partir d'un fichier.

source: File name.
fr: Nom de fichier.

source: Read a list of signals from a file.
fr: Lire une liste de signaux à partir d'un fichier.

source: List of signals.
fr: Liste de signaux.

source: Create a new Signal object.
fr: Créer un nouvel objet Signal.

source: signal title
fr: titre du signal

source: X data
fr: données X

source: Y data
fr: données Y

source: dX data (optional: error bars)
fr: données dX (facultatif : barres d'erreur)

source: dY data (optional: error bars)
fr: données dY (facultatif : barres d'erreur)

source: signal metadata
fr: métadonnées du signal

source: X, Y units (tuple of strings)
fr: unités X, Y (tuple de chaînes)

source: X, Y labels (tuple of strings)
fr: étiquettes X, Y (tuple de chaînes)

source: Create a new Signal object from a dialog box.
fr: Créer un nouvel objet Signal à partir d'une boîte de dialogue.

source: new signal parameters
fr: nouveaux paramètres du signal

source: additional parameters
fr: paramètres supplémentaires

source: Open a dialog box to edit parameters (default: False)
fr: Ouvrir une boîte de dialogue pour modifier les paramètres (par défaut : False)

source: parent widget
fr: widget parent

source: Signal object or None if canceled
fr: Objet Signal ou None si annulé

source: Create a new Signal dataset instance.
fr: Créer une nouvelle instance de jeu de données Signal.

source: dataset title (default: None, uses default title)
fr: titre du jeu de données (par défaut : None, utilise le titre par défaut)

source: signal type (default: None, uses default type)
fr: type de signal (par défaut : None, utilise le type par défaut)

source: X min (default: None, uses default value)
fr: X min (par défaut : None, utilise la valeur par défaut)

source: X max (default: None, uses default value)
fr: X max (par défaut : None, utilise la valeur par défaut)

source: signal size (default: None, uses default value)
fr: taille du signal (par défaut : None, utilise la valeur par défaut)

source: new signal dataset instance
fr: nouvelle instance de jeu de données signal

source: Signal types
fr: Types de signal

source: Signal filled with zeros
fr: Signal rempli de zéros

source: Gaussian function
fr: Fonction gaussienne

source: Lorentzian function
fr: Fonction lorentzienne

source: Voigt function
fr: Fonction de Voigt

source: Random signal (uniform law)
fr: Signal aléatoire (loi uniforme)

source: Random signal (normal law)
fr: Signal aléatoire (loi normale)

source: Sinusoid
fr: Fonction sinus

source: Cosinusoid
fr: Fonction cosinus

source: Sawtooth function
fr: Fonction en dents de scie

source: Triangle function
fr: Fonction triangle

source: Square function
fr: Fonction carrée

source: Cardinal sine
fr: Sinus cardinal

source: Step function
fr: Fonction échelon

source: New signal dataset
fr: Nouveau jeu de données signal

source: Parameters for Gaussian and Lorentzian functions
fr: Paramètres pour les fonctions gaussiennes et lorentziennes

source: Parameters for step function
fr: Paramètres pour la fonction d'étape

source: Parameters for periodic functions
fr: Paramètres pour les fonctions périodiques

source: Return frequency in Hz
fr: Renvoie la fréquence en Hz

source: Image model
fr: Modèle d'image

source: Image object
fr: Objet image

source: Set metadata from object: dict-like (only string keys are considered) or any other object (iterating over supported attributes)
fr: Définir les métadonnées à partir de l'objet : semblable à un dictionnaire

source: object
fr: objet

source: Get DICOM template
fr: Obtenir le modèle DICOM

source: Return image center X-axis coordinate
fr: Renvoie la coordonnée X du centre de l'image

source: Return image center Y-axis coordinate
fr: Renvoie la coordonnée Y du centre de l'image

source: Masked data
fr: Données masquées

source: update from plot item
fr: mettre à jour à partir de l'élément de tracé

source: Return ROI parameters dataset.
fr: Renvoie le jeu de données de paramètres de la ROI.

source: default values
fr: valeurs par défaut

source: ROI geometry
fr: géométrie de la ROI

source: Return masked data (areas outside defined regions of interest)
fr: Renvoie les données masquées (zones en dehors des régions d'intérêt définies)

source: Return masked view for data
fr: Retourne une vue masquée des données

source: Masked view
fr: Vue masquée

source: Invalidate mask data cache: force to rebuild it
fr: Invalider le cache des données masquées : force la reconstruction

source: title (if None, use image title)
fr: titre (si None, utilise le titre de l'image)

source: Read an image from a file.
fr: Lire une image à partir d'un fichier.

source: Read a list of images from a file.
fr: Lire une liste d'images à partir d'un fichier.

source: List of images.
fr: Liste d'images.

source: Create a new Image object
fr: Créer un nouvel objet Image

source: image title
fr: titre de l'image

source: image data
fr: données de l'image

source: image metadata
fr: métadonnées de l'image

source: X, Y, Z units (tuple of strings)
fr: unités X, Y, Z (tuple de chaînes)

source: X, Y, Z labels (tuple of strings)
fr: étiquettes X, Y, Z (tuple de chaînes)

source: Create a new Image object from dialog box.
fr: Créer un nouvel objet Image à partir d'une boîte de dialogue.

source: new image parameters
fr: nouveaux paramètres de l'image

source: New image object or None if user cancelled
fr: Nouvel objet image ou None si l'utilisateur a annulé

source: Create a new Image dataset instance.
fr: Créer une nouvelle instance de jeu de données Image.

source: image type (default: None, uses default type)
fr: type d'image (par défaut : None, utilise le type par défaut)

source: image height (default: None, uses default height)
fr: hauteur de l'image (par défaut : None, utilise la hauteur par défaut)

source: image width (default: None, uses default width)
fr: largeur de l'image (par défaut : None, utilise la largeur par défaut)

source: image data type (default: None, uses default data type)
fr: type de données de l'image (par défaut : None, utilise le type de données par défaut)

source: New image dataset instance
fr: Nouvelle instance de jeu de données image

source: Image types
fr: Types d'image

source: Image filled with zeros
fr: Image remplie de zéros

source: Empty image (filled with data from memory state)
fr: Image vide (remplie de données de l'état de la mémoire)

source: 2D Gaussian image
fr: Image gaussienne 2D

source: Image filled with random data (uniform law)
fr: Image remplie de données aléatoires (loi uniforme)

source: Image filled with random data (normal law)
fr: Image remplie de données aléatoires (loi normale)

source: New image dataset
fr: Nouveau jeu de données image

source: 2D Gaussian parameters
fr: Paramètres gaussiens 2D

source: ROI data geometry types
fr: Types de géométrie des données ROI

source: Image data types
fr: Types de données d'image

source: Return member from NumPy dtype
fr: Renvoie le membre à partir du dtype NumPy

source: Check if data types are valid
fr: Vérifie si les types de données sont valides

source: Unsigned integer number stored with 8 bits
fr: Entier non signé stocké avec 8 bits

source: Unsigned integer number stored with 16 bits
fr: Entier non signé stocké avec 16 bits

source: Signed integer number stored with 16 bits
fr: Entier signé stocké avec 16 bits

source: Float number stored with 32 bits
fr: Nombre flottant stocké avec 32 bits

source: Float number stored with 64 bits
fr: Nombre flottant stocké avec 64 bits
