Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/param.po
Languages: fr

source: Parameters (:mod:`cdl.param`)
fr: Paramètres (:mod:`cdl.param`)

source: The :mod:`cdl.param` module aims at providing all the dataset parameters that are used by the :mod:`cdl.core.computation` and :mod:`cdl.core.gui.processor` packages.
fr: Le module :mod:`cdl.param` fournit tous les paramètres de jeu de données utilisés par les modules :mod:`cdl.core.computation` et :mod:`cdl.core.gui.processor`.

source: Those datasets (:py:class:`guidata.dataset.datatypes.Dataset` subclasses) are defined in other modules:
fr: Ces jeux de données (sous-classes de :py:class:`guidata.dataset.datatypes.Dataset`) sont définis dans d'autres modules :

source: The :mod:`cdl.param` module is thus a convenient way to import all the sets of parameters at once.
fr: Le module :mod:`cdl.param` est donc un moyen pratique d'importer tous les ensembles de paramètres en une seule fois.

source: As a matter of fact, the following import statement is equivalent to the previous one:
fr: En fait, l'instruction d'importation suivante est équivalente à la précédente :

source: Common parameters
fr: Paramètres communs

source: Data clipping parameters
fr: Paramètres d'écrêtage

source: FFT parameters
fr: Paramètres FFT

source: Gaussian filter parameters
fr: Paramètres de filtre gaussien

source: Moving average parameters
fr: Paramètres de moyenne mobile

source: Moving median parameters
fr: Paramètres de médiane mobile

source: ROI Editor data
fr: Données de l'éditeur de ROI

source: Create ROIDataParam instance
fr: Créer une instance de ROIDataParam

source: Return True if there is no ROI
fr: Retourne True s'il n'y a pas de ROI

source: Threshold parameters
fr: Paramètres de seuillage

source: Signal parameters
fr: Paramètres des signaux

source: Convert signal data type parameters
fr: Convertir les paramètres de type de données du signal

source: FWHM parameters
fr: Paramètres de LMH

source: Normalize parameters
fr: Paramètres de normalisation

source: Peak detection parameters
fr: Paramètres de détection de pics

source: Polynomial fitting parameters
fr: Paramètres de régression polynomiale

source: Signal calibration parameters
fr: Paramètres de calibration du signal

source: Interpolation parameters
fr: Paramètres d'interpolation

source: Resample parameters
fr: Paramètres de rééchantillonnage

source: Detrending parameters
fr: Elimination de tendance

source: Image parameters
fr: Paramètres des images

source: Base image parameters
fr: Paramètres de base des images

source: Average horizontal or vertical profile parameters
fr: Paramètres de profil horizontal ou vertical moyen

source: Binning parameters
fr: Paramètres de binning

source: Butterworth filter parameters
fr: Paramètres de filtre Butterworth

source: Convert image data type parameters
fr: Convertir les paramètres de type de données de l'image

source: Flat-field parameters
fr: Paramètres de correction de champ plat

source: Grid parameters
fr: Paramètres de grille

source: Circle Hough transform parameters
fr: Paramètres de transformation de Hough circulaire

source: Log10 parameters
fr: Paramètres de log10

source: Horizontal or vertical profile parameters
fr: Paramètres de profil horizontal ou vertical

source: Resize parameters
fr: Paramètres de redimensionnement

source: Rotate parameters
fr: Paramètres de rotation

source: Image linear calibration parameters
fr: Paramètres de calibration linéaire de l'image

source: Exposure correction parameters
fr: Paramètres de correction d'exposition

source: Gamma adjustment parameters
fr: Paramètres d'ajustement gamma

source: Logarithmic adjustment parameters
fr: Paramètres d'ajustement logarithmique

source: Sigmoid adjustment parameters
fr: Paramètres d'ajustement sigmoïde

source: Adaptive histogram equalization parameters
fr: Paramètres d'égalisation d'histogramme adaptatif

source: Histogram equalization parameters
fr: Paramètres d'égalisation d'histogramme

source: Intensity rescaling parameters
fr: Paramètres de rééchelonnement d'intensité

source: Restoration parameters
fr: Paramètres de restauration

source: Bilateral filter denoising parameters
fr: Paramètres de débruitage par filtre bilatéral

source: Total Variation denoising parameters
fr: Paramètres de débruitage par variation totale

source: Wavelet denoising parameters
fr: Paramètres de débruitage par ondelettes

source: Morphological parameters
fr: Paramètres morphologiques

source: White Top-Hat parameters
fr: Paramètres de White Top-Hat

source: Edge detection parameters
fr: Paramètres de détection de contours

source: Canny filter parameters
fr: Paramètres de filtre Canny

source: Detection parameters
fr: Paramètres de détection

source: Blob detection using Difference of Gaussian method
fr: Détection de taches par méthode de différence de gaussiennes

source: Blob detection using Determinant of Hessian method
fr: Détection de taches par méthode du déterminant du Hessien

source: Blob detection using Laplacian of Gaussian method
fr: Détection de taches par méthode du Laplacien de gaussiennes

source: Blob detection using OpenCV
fr: Détection de taches par OpenCV

source: Contour shape parameters
fr: Paramètres de forme de contour
