Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/image/menu/help.po
Languages: fr

source: Online or Local documentation
fr: Documentation en ligne ou locale

source: Open the online or local documentation (english only for online version):
fr: Affiche la documentation en ligne ou locale (disponible uniquement en anglais pour la version en ligne) :

source: Show log files
fr: Afficher les journaux de bords

source: Open DataLab log viewer
fr: Affiche l'explorateur de journaux de bord de DataLab

source: See :ref:`ref-to-logviewer` for more details on log viewer.
fr: Voir la page :ref:`ref-to-logviewer` pour plus de détails sur les journaux de bord.

source: About DataLab installation
fr: Configuration d'installation de DataLab

source: Show information regarding your DataLab installation (this is typically needed for submitting a bug report).
fr: Affiche des informations sur votre configuration d'installation de DataLab (particulièrement utile pour signaler des anomalies de manière efficace).

source: See :ref:`ref-to-instviewer` for more details on this dialog box.
fr: Voir la page :ref:`ref-to-instviewer` pour plus de détails sur cette boîte de dialogue.

source: About
fr: À propos

source: Open the "About DataLab" dialog box:
fr: Affiche la boîte de dialogue "A propos de DataLab"
