Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/common/overview.po
Languages: fr

source: Overview and basic concepts of DataLab, the open-source scientific data analysis and visualization platform
fr: Vue d'ensemble et concepts de base de DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques

source: DataLab, workspace, scientific, data, analysis, visualization, platform
fr: DataLab, espace de travail, scientifique, données, analyse, visualisation, plateforme

source: Overview
fr: Vue d'ensemble

source: Basic concepts
fr: Concepts de base

source: Working with DataLab is very easy. The user interface is intuitive and self-explanatory. The main window is divided into two main areas:
fr: Travailler avec DataLab est très simple. L'interface est intuitive et appréhendable facilement. La fenêtre principale est divisée en deux zones principales :

source: The left area shows the list of data sets which are currently loaded in DataLab, distibuted over two tabs: **Signals** and **Images**. The user can switch between the two tabs by clicking on the corresponding tab: this switches the main window to the corresponding panel, as well as the menu and toolbar contents. Below the list of data sets, a **Properties** view shows information about the currently selected data set.
fr: La zone de gauche affiche la liste des jeux de données actuellement chargés dans DataLab, répartis sur deux onglets : **Signaux** et **Images**. L'utilisateur peut basculer entre les deux onglets en cliquant sur l'onglet correspondant : cela bascule la fenêtre principale vers le panneau correspondant, ainsi que le contenu du menu et de la barre d'outils. Sous la liste des jeux de données, une vue **Propriétés** affiche des informations sur le jeu de données actuellement sélectionné.

source: The right area shows the visualization of the currently selected data set. The visualization is updated automatically when the user selects a new data set in the list of data sets.
fr: La zone de droite affiche la visualisation du jeu de données actuellement sélectionné. La visualisation est mise à jour automatiquement lorsque l'utilisateur sélectionne un nouveau jeu de données dans la liste des jeux de données.

source: DataLab main window, at startup.
fr: Fenêtre principale de DataLab, au démarrage.

source: Internal data model and workspace
fr: Modèle de données interne et espace de travail

source: DataLab has its own internal data model, in which data sets are organized around a tree structure. Each panel in the main window corresponds to a branch of the tree. Each data set shown in the panels corresponds to a leaf of the tree. Inside the data set, the data is organized in an object-oriented way, with a set of attributes and methods. The data model is described in more details in the API section (see :mod:`sigima.objects`).
fr: DataLab a son propre modèle de données interne, dans lequel les jeux de données sont organisés autour d'une structure arborescente. Chaque panneau de la fenêtre principale correspond à une branche de l'arbre. Chaque jeu de données affiché dans les panneaux correspond à une feuille de l'arbre. À l'intérieur du jeu de données, les données sont organisées de manière orientée objet, avec un ensemble d'attributs et de méthodes. Le modèle de données est décrit plus en détail dans la section API (voir :mod:`sigima.objects`).

source: For each data set (1D signal or 2D image), not only the data itself is stored, but also a set of metadata, which describes the data or the way it has to be displayed. The metadata is stored in a dictionary, which is accessible through the ``metadata`` attribute of the data set (and may also be browsed in the **Properties** view, with the **Metadata** button).
fr: Pour chaque jeu de données (signal 1D ou image 2D), non seulement les données elles-mêmes sont stockées, mais aussi un ensemble de métadonnées, qui décrit les données ou la façon dont elles doivent être affichées. Les métadonnées sont stockées dans un dictionnaire, qui est accessible via l'attribut ``metadata`` du jeu de données (et peuvent également être parcourues dans la vue **Propriétés**, avec le bouton **Métadonnées**).

source: The DataLab **Workspace** is defined as the collection of all data sets which are currently loaded in DataLab, in both the **Signals** and **Images** panels.
fr: L'**Espace de travail** de DataLab est défini comme l'ensemble de tous les jeux de données actuellement chargés dans DataLab, dans les panneaux **Signaux** et **Images**.

source: Loading and saving the workspace
fr: Chargement et enregistrement de l'espace de travail

source: The following actions are available to manage the workspace from the **File** menu:
fr: Les actions suivantes sont disponibles pour gérer l'espace de travail depuis le menu **Fichier** :

source: **Open HDF5 file**: load a workspace from an HDF5 file.
fr: **Ouvrir un fichier HDF5** : charger un espace de travail à partir d'un fichier HDF5.

source: **Save to HDF5 file**: save the current workspace to an HDF5 file.
fr: **Enregistrer dans un fichier HDF5** : enregistrer l'espace de travail actuel dans un fichier HDF5.

source: **Browse HDF5 file**: open the :ref:`h5browser` to explore the content of an HDF5 file and import data sets into the workspace.
fr: **Parcourir un fichier HDF5** : ouvrir le :ref:`h5browser` pour explorer le contenu d'un fichier HDF5 et importer des jeux de données dans l'espace de travail.

source: Data sets may also be saved or loaded individually, using data formats such as `.txt` or `.npy` for 1D signals (see :ref:`open_signal` for the list of supported formats), , or `.tiff` or `.dcm` for 2D images (see :ref:`open_image` for the list of supported formats).
fr: Les jeux de données peuvent également être enregistrés ou chargés individuellement, en utilisant des formats de données tels que `.txt` ou `.npy` pour les signaux 1D (voir :ref:`open_signal` pour la liste des formats pris en charge), ou `.tiff` ou `.dcm` pour les images 2D (voir :ref:`open_image` pour la liste des formats pris en charge).

source: Interactive object creation and processing
fr: Création et traitement interactifs d'objets

source: DataLab provides an interactive workflow for creating objects and adjusting processing parameters, allowing you to fine-tune results without creating multiple objects.
fr: DataLab fournit un flux de travail interactif pour créer des objets et ajuster les paramètres de traitement, vous permettant d'affiner les résultats sans créer plusieurs objets.

source: Interactive object creation
fr: Création d'objets interactifs

source: When creating a new signal or image using the creation functions (e.g., Gaussian signal, 2D peak image, etc.), DataLab stores the creation parameters in the object's metadata. This enables interactive parameter adjustment after creation:
fr: Lors de la création d'un nouveau signal ou d'une nouvelle image à l'aide des fonctions de création (par exemple, signal gaussien, image de pic 2D, etc.), DataLab stocke les paramètres de création dans les métadonnées de l'objet. Cela permet d'ajuster les paramètres de manière interactive après la création :

source: Create a signal or image using **Operations** > **Create** menu
fr: Créer un signal ou une image en utilisant le menu **Opérations** > **Créer**

source: Select the created object in the list
fr: Sélectionner l'objet créé dans la liste

source: A **Creation** tab appears in the Properties panel (bottom-left)
fr: Un onglet **Création** apparaît dans le panneau des propriétés (en bas à gauche)

source: Modify any creation parameter (amplitude, frequency, size, etc.)
fr: Modifier n'importe quel paramètre de création (amplitude, fréquence, taille, etc.)

source: Click **Apply** to regenerate the object with new parameters
fr: Cliquer sur **Appliquer** pour régénérer l'objet avec les nouveaux paramètres

source: The object is updated in-place, preserving any subsequent processing or analysis results. This is particularly useful for:
fr: L'objet est mis à jour sur place, préservant tous les résultats de traitement ou d'analyse ultérieurs. Cela est particulièrement utile pour :

source: Exploring different parameter values without cluttering the workspace
fr: Explorer différentes valeurs de paramètres sans encombrer l'espace de travail

source: Fine-tuning object characteristics while observing the results
fr: Affiner les caractéristiques de l'objet tout en observant les résultats

source: Educational purposes to demonstrate parameter effects
fr: Objectifs pédagogiques pour démontrer les effets des paramètres

source: Interactive creation is only available for objects created with parameter classes (not for imported data from files).
fr: La création interactive n'est disponible que pour les objets créés avec des classes de paramètres (pas pour les données importées à partir de fichiers).

source: Interactive 1-to-1 processing
fr: Traitement interactif 1-vers-1

source: When applying a 1-to-1 processing operation that has configurable parameters (e.g., Gaussian filter, threshold, morphological operations), DataLab stores the processing metadata, enabling parameter adjustment and re-processing:
fr: Lors de l'application d'une opération de traitement 1-vers-1 qui a des paramètres configurables (par exemple, filtre gaussien, seuil, opérations morphologiques), DataLab stocke les métadonnées de traitement, permettant l'ajustement des paramètres et le re-traitement :

source: Apply a processing operation with parameters (e.g., **Processing** > **Filtering** > **Gaussian filter**)
fr: Appliquer une opération de traitement avec des paramètres (par exemple, **Traitement** > **Filtrage** > **Filtre gaussien**)

source: The result object contains processing metadata (parameters, source object, function name)
fr: L'objet résultant contient des métadonnées de traitement (paramètres, objet source, nom de la fonction)

source: Select the processed object in the list
fr: Sélectionner l'objet traité dans la liste

source: A **Processing** tab appears in the Properties panel
fr: Un onglet **Traitement** apparaît dans le panneau des propriétés

source: Modify processing parameters (e.g., filter sigma value)
fr: Modifier les paramètres de traitement (par exemple, valeur sigma du filtre)

source: Click **Apply** to re-process with updated parameters
fr: Cliquer sur **Appliquer** pour re-traiter avec les paramètres mis à jour

source: The processed object is updated in-place with the new results. This workflow is ideal for:
fr: L'objet traité est mis à jour sur place avec les nouveaux résultats. Ce flux de travail est idéal pour :

source: Iteratively tuning filter parameters while observing results in real-time
fr: Ajustement itératif des paramètres du filtre tout en observant les résultats en temps réel

source: Adjusting threshold values without creating multiple intermediate objects
fr: Ajustement des valeurs de seuil sans créer plusieurs objets intermédiaires

source: Experimenting with different morphological structure element sizes
fr: Expérimentation avec différentes tailles d'éléments de structure morphologique

source: Educational demonstrations of parameter effects on processing results
fr: Démonstrations éducatives des effets des paramètres sur les résultats du traitement

source: **Processing metadata requirements:**
fr: **Exigences en matière de métadonnées de traitement :**

source: Only works for 1-to-1 processing functions with parameter classes
fr: Ne fonctionne que pour les fonctions de traitement 1-vers-1 avec des classes de paramètres

source: Processing functions without parameters (e.g., absolute value, inverse) work as before
fr: Les fonctions de traitement sans paramètres (par exemple, valeur absolue, inverse) fonctionnent comme auparavant

source: Source object must still exist for re-processing (error shown if deleted)
fr: L'objet source doit toujours exister pour le re-traitement (erreur affichée s'il est supprimé)

source: **Not supported for:**
fr: **Non pris en charge pour :**

source: 2-to-1 processing (operations combining two objects)
fr: Traitement 2-vers-1 (opérations combinant deux objets)

source: n-to-1 processing (operations aggregating multiple objects)
fr: Traitement n-vers-1 (opérations agrégeant plusieurs objets)

source: These patterns don't benefit significantly from interactive parameter adjustment
fr: Ces modèles ne bénéficient pas de manière significative de l'ajustement interactif des paramètres

source: Example workflow
fr: Exemple de flux de travail

source: Here's a typical workflow using interactive processing:
fr: Voici un flux de travail typique utilisant le traitement interactif :

source: **Create a test signal**: Operations > Create > Gaussian signal
fr: **Créer un signal de test** : Opérations > Créer > Signal gaussien

source: Initial parameters: amplitude=1.0, mu=50, sigma=10
fr: Paramètres initiaux : amplitude=1.0, mu=50, sigma=10

source: **Adjust creation parameters**: In the Creation tab, change sigma to 20, click Apply
fr: **Ajuster les paramètres de création** : Dans l'onglet Création, changer sigma à 20, cliquer sur Appliquer

source: Signal is regenerated with new width
fr: Le signal est régénéré avec une nouvelle largeur

source: **Apply Gaussian filter**: Processing > Filtering > Gaussian filter
fr: **Appliquer le filtre gaussien** : Traitement > Filtrage > Filtre gaussien

source: Initial sigma=2.0
fr: Sigma initial=2.0

source: **Fine-tune filtering**: In the Processing tab, try sigma=1.0, then sigma=5.0
fr: **Ajuster le filtrage** : Dans l'onglet Traitement, essayer sigma=1.0, puis sigma=5.0

source: Each Apply updates the filtered result
fr: Chaque application met à jour le résultat filtré

source: Compare different smoothing levels without creating multiple objects
fr: Comparer différents niveaux de lissage sans créer plusieurs objets

source: This interactive approach provides immediate visual feedback and keeps your workspace organized by avoiding proliferation of test objects with slightly different parameters.
fr: Cette approche interactive fournit un retour visuel immédiat et garde votre espace de travail organisé en évitant la prolifération d'objets de test avec des paramètres légèrement différents.
