Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/common/settings.po
Languages: fr

source: These settings affect only the visualization of results on plots. They do not affect the actual computation or storage of results in metadata.
fr: Ces paramètres n'affectent que la visualisation des résultats sur les graphiques. Ils n'affectent pas le calcul réel ou le stockage des résultats dans les métadonnées.

source: I/O
fr: Entrée/sortie

source: The I/O settings tab controls input/output operations:
fr: L'onglet des préférences d'entrée/sortie contrôle les opérations d'entrée/sortie :

source: I/O settings tab
fr: Onglet des préférences d'entrée/sortie

source: **Clear workspace before loading HDF5 file**
fr: **Effacer l'espace de travail avant de charger le fichier HDF5**

source: When enabled, the workspace is cleared before loading an HDF5 file.
fr: Si le réglage est activé, l'espace de travail est effacé avant de charger un fichier HDF5.

source: **Ask before clearing workspace**
fr: **Demander avant d'effacer l'espace de travail**

source: When enabled, a confirmation dialog is displayed before clearing the workspace.
fr: Si le réglage est activé, une boîte de dialogue de confirmation est affichée avant d'effacer l'espace de travail.

source: **HDF5 full path in title**
fr: **Chemin complet HDF5 dans le titre**

source: When enabled, the full path of the HDF5 dataset is used as the title for the signal/image object. When disabled, only the dataset name is used.
fr: Si le réglage est activé, le chemin complet du jeu de données HDF5 est utilisé comme titre pour l'objet signal/image. Lorsque désactivé, seul le nom du jeu de données est utilisé.

source: **HDF5 file name in title**
fr: **Nom de fichier HDF5 dans le titre**

source: When enabled, the HDF5 file name is appended as a suffix to the title of the signal/image object.
fr: Si le réglage est activé, le nom du fichier HDF5 est ajouté comme suffixe au titre de l'objet signal/image.

source: The Console settings tab configures the internal console for debugging and advanced users:
fr: L'onglet des préférences de console configure la console interne pour le débogage et les utilisateurs avancés :

source: Console settings tab
fr: Onglet des préférences de console

source: **Console enabled**
fr: **Console activée**

source: Enable the internal Python console for debugging and advanced scripting.
fr: Activer la console Python interne pour le débogage et les scripts avancés.

source: **Show console on error**
fr: **Afficher la console en cas d'erreur**

source: When enabled, the console is automatically shown when an error occurs in the application. This is useful for debugging as it allows you to see the error traceback.
fr: Si le réglage est activé, la console est automatiquement affichée lorsqu'une erreur se produit dans l'application. Ceci est utile pour le débogage car cela permet de voir la trace d'erreur.

source: **External editor path**
fr: **Chemin de l'éditeur externe**

source: Path to an external text editor to use for editing Python code from the console.
fr: Chemin vers un éditeur de texte externe à utiliser pour éditer du code Python depuis la console.

source: **External editor arguments**
fr: **Arguments de l'éditeur externe**

source: Command-line arguments to pass to the external editor.
fr: Arguments de ligne de commande à passer à l'éditeur externe.
