Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/common/settings.po
Languages: fr

source: Settings of DataLab, the open-source scientific data analysis and visualization platform
fr: Préférences de DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques

source: DataLab, settings, scientific, data, analysis, visualization, platform
fr: DataLab, préférences, scientifique, données, analyse, visualisation, plateforme

source: Settings
fr: Préférences

source: DataLab provides a comprehensive settings dialog to customize the application behavior, visualization defaults, and I/O operations. The settings are organized into five tabs: General, Processing, Visualization, I/O, and Console.
fr: DataLab propose une boîte de dialogue de préférences complète pour personnaliser le comportement de l'application, les paramètres de visualisation par défaut et les opérations d'entrée/sortie. Les préférences sont organisées en cinq onglets : Général, Traitement, Visualisation, Entrée/sortie et Console.

source: General
fr: Général

source: The General settings tab contains main window and general feature settings:
fr: L'onglet des préférences générales contient les paramètres de la fenêtre principale et les paramètres généraux :

source: General settings tab
fr: Onglet des préférences générales

source: **Color mode**
fr: **Mode couleur**

source: Choose the color mode for the application interface (e.g., light, dark, or auto).
fr: Choisir le mode couleur de l'interface de l'application (par exemple, clair, sombre ou automatique).

source: **Process isolation**
fr: **Isolation des processus**

source: When enabled, each computation runs in a separate process, preventing the application from freezing during long computations. This is the recommended setting for better responsiveness.
fr: Si le réglage est activé, chaque calcul s'exécute dans un processus séparé, empêchant l'application de geler pendant les longs calculs. Il s'agit du paramètre recommandé pour une meilleure réactivité.

source: **RPC server**
fr: **Serveur RPC**

source: Enable the RPC (Remote Procedure Call) server to communicate with external applications, such as your own scripts running in Spyder, Jupyter, or other software. This allows programmatic control of DataLab.
fr: Activer le serveur RPC (Remote Procedure Call) pour communiquer avec des applications externes, telles que vos propres scripts s'exécutant dans Spyder, Jupyter ou d'autres logiciels. Cela permet un contrôle programmatique de DataLab.

source: **Memory threshold**
fr: **Seuil de mémoire**

source: Set a threshold (in MB) below which a warning is displayed before loading new data. This helps prevent out-of-memory errors when working with large datasets. Set to 0 to disable the warning.
fr: Définir un seuil (en Mo) en dessous duquel un avertissement est affiché avant de charger de nouvelles données. Cela permet d'éviter les erreurs de mémoire insuffisante lors du travail avec de grands ensembles de données. Mettre à 0 pour désactiver l'avertissement.

source: **Third-party plugins**
fr: **Plugins tiers**

source: Enable or disable third-party plugins at startup.
fr: Activer ou désactiver les plugins tiers au démarrage.

source: **Plugins path**
fr: **Chemin des plugins**

source: Specify the directory path where DataLab should look for third-party plugins. DataLab will also discover plugins in your PYTHONPATH.
fr: Spécifier le chemin du répertoire où DataLab doit rechercher les plugins tiers. DataLab découvrira également les plugins dans votre PYTHONPATH.

source: Processing
fr: Traitement

source: The Processing settings tab controls computation behavior and default parameters:
fr: L'onglet des préférences de traitement contrôle le comportement des calculs et les paramètres par défaut :

source: Processing settings tab
fr: Onglet des préférences de traitement

source: **Operation mode**
fr: **Mode d'opération**

source: Choose the operation mode for computations taking N inputs:
fr: Choisir le mode d'opération pour les calculs prenant N entrées :

source: **Single**: single operand mode
fr: **Single** : mode opérande unique

source: **Pairwise**: pairwise operation mode
fr: **Pairwise** : mode opération par paire

source: These operation modes determine how DataLab handles computations involving multiple objects. They apply to two types of operations:
fr: Ces modes d'opération déterminent comment DataLab gère les calculs impliquant plusieurs objets. Ils s'appliquent à deux types d'opérations :

source: **N→1 operations**: Combine N (≥2) objects into 1 output (e.g. sum, average)
fr: **Opérations N→1** : Combiner N (≥2) objets en 1 sortie (par exemple somme, moyenne)

source: **N+1→N operations**: Apply an operation between N (≥1) objects and 1 operand to produce N outputs (e.g. difference, division)
fr: **Opérations N+1→N** : Appliquer une opération entre N (≥1) objets et 1 opérande pour produire N sorties (par exemple différence, division)

source: **Single operand mode** (default): Operations are applied independently within each group.
fr: **Mode opérande unique** (par défaut) : Les opérations sont appliquées indépendamment dans chaque groupe.

source: For **N→1 operations**: All objects in each group are combined into one result per group. Example with groups G1={A, B} and G2={C, D}, sum operation:
fr: Pour les **opérations N→1** : Tous les objets de chaque groupe sont combinés en un seul résultat par groupe. Exemple avec les groupes G1={A, B} et G2={C, D}, opération de somme :

source: Result: Σ(A,B) and Σ(C,D) (one per group)
fr: Résultat : Σ(A,B) et Σ(C,D) (un par groupe)

source: For **N+1→N operations**: Each selected object is combined with a single reference operand. Example with groups G1={A, B} and G2={C, D}, difference with reference R:
fr: Pour les **opérations N+1→N** : Chaque objet sélectionné est combiné avec un seul opérande de référence. Exemple avec les groupes G1={A, B} et G2={C, D}, différence avec la référence R :

source: In G1: A-R, B-R
fr: Dans G1 : A-R, B-R

source: In G2: C-R, D-R
fr: Dans G2 : C-R, D-R

source: **Pairwise operation mode**: Objects from different groups are combined at matching positions (all groups must have the same number of objects).
fr: **Mode opération par paire** : Les objets de différents groupes sont combinés aux positions correspondantes (tous les groupes doivent avoir le même nombre d'objets).

source: For **N→1 operations**: Objects at the same position in each group are combined. Example with groups G1={A, B} and G2={C, D}, sum operation:
fr: Pour les **opérations N→1** : Les objets à la même position dans chaque groupe sont combinés. Exemple avec les groupes G1={A, B} et G2={C, D}, opération de somme :

source: Result: A+C and B+D (pairing by position)
fr: Résultat : A+C et B+D (appariement par position)

source: For **N+1→N operations**: Objects at matching positions are combined pairwise. Example with groups G1={A, B}, G2={C, D}, difference with group G3={E, F}:
fr: Pour les **opérations N+1→N** : Les objets aux positions correspondantes sont combinés par paires. Exemple avec les groupes G1={A, B}, G2={C, D}, différence avec le groupe G3={E, F} :

source: New group 1: A-E, B-F
fr: Nouveau groupe 1 : A-E, B-F

source: New group 2: C-E, D-F
fr: Nouveau groupe 2 : C-E, D-F

source: **Use signal bounds for new signals**
fr: **Utiliser les bornes du signal pour les nouveaux signaux**

source: When enabled, the xmin and xmax values for new signals are initialized from the current signal's bounds. When disabled, default values are used.
fr: Si le réglage est activé, les valeurs xmin et xmax pour les nouveaux signaux sont initialisées à partir des bornes du signal actuel. Lorsque désactivé, les valeurs par défaut sont utilisées.

source: **Use image dimensions for new images**
fr: **Utiliser les dimensions d'image pour les nouvelles images**

source: When enabled, the width and height values for new images are initialized from the current image's dimensions. When disabled, default values are used.
fr: Si le réglage est activé, les valeurs de largeur et de hauteur pour les nouvelles images sont initialisées à partir des dimensions de l'image actuelle. Lorsque désactivé, les valeurs par défaut sont utilisées.

source: **FFT shift**
fr: **Décalage FFT**

source: Enable FFT shift to center the zero-frequency component in the frequency spectrum for easier visualization and analysis.
fr: Activer le décalage FFT pour centrer la composante de fréquence nulle dans le spectre de fréquences pour une visualisation et une analyse plus faciles.

source: **Extract multiple ROIs in a single object**
fr: **Extraire plusieurs ROI dans un seul objet**

source: When enabled, multiple ROIs (Regions of Interest) are extracted into a single object. When disabled, each ROI is extracted into a separate object.
fr: Si le réglage est activé, plusieurs ROI (Régions d'Intérêt) sont extraites dans un seul objet. Lorsque désactivé, chaque ROI est extraite dans un objet séparé.

source: **Ignore warnings**
fr: **Ignorer les avertissements**

source: Suppress warning messages during computations.
fr: Supprimer les messages d'avertissement pendant les calculs.

source: **X-array compatibility behavior**
fr: **Comportement de compatibilité des tableaux X**

source: Choose the behavior when X arrays are incompatible in multi-signal computations:
fr: Choisir le comportement lorsque les tableaux X sont incompatibles dans les calculs multi-signaux :

source: **Ask**: display a confirmation dialog (default)
fr: **Demander** : afficher une boîte de dialogue de confirmation (par défaut)

source: **Interpolate**: automatically interpolate signals
fr: **Interpoler** : interpoler automatiquement les signaux

source: Result management
fr: Gestion des résultats

source: **Keep results in metadata after computation**
fr: **Conserver les résultats dans les métadonnées après le calcul**

source: When enabled, results from previous analyses are kept in the object's metadata after computation. When disabled, results are removed. This option is disabled by default to avoid confusion from outdated results.
fr: Si le réglage est activé, les résultats des analyses précédentes sont conservés dans les métadonnées de l'objet après le calcul. Lorsque désactivé, les résultats sont supprimés. Cette option est désactivée par défaut pour éviter toute confusion due à des résultats obsolètes.

source: **Show results dialog automatically after processing**
fr: **Afficher automatiquement la boîte de dialogue des résultats après le traitement**

source: When enabled, the results dialog is shown automatically after each processing operation producing results. When disabled, the results dialog is not shown automatically but results can still be viewed using the dedicated button or menu option.
fr: Si le réglage est activé, la boîte de dialogue des résultats est affichée automatiquement après chaque opération de traitement produisant des résultats. Lorsque désactivé, la boîte de dialogue des résultats n'est pas affichée automatiquement, mais les résultats peuvent toujours être consultés à l'aide du bouton ou de l'option de menu dédiée.

source: Visualization
fr: Visualisation

source: The Visualization settings tab controls how data is displayed. This tab is organized into four sub-tabs: Common, Signals, Images, and Results.
fr: L'onglet des préférences de visualisation contrôle comment les données sont affichées. Cet onglet est organisé en quatre sous-onglets : Commun, Signaux, Images et Résultats.

source: Common settings
fr: Paramètres communs

source: The Common sub-tab contains settings that apply to all visualizations:
fr: Le sous-onglet Commun contient des paramètres qui s'appliquent à toutes les visualisations :

source: Visualization settings - Common sub-tab
fr: Préférences de visualisation - Sous-onglet Commun

source: **Plot toolbar position**
fr: **Position de la barre d'outils de tracé**

source: Choose where to position the plot toolbar (top, bottom, left, or right of the plot).
fr: Choisir où positionner la barre d'outils de tracé (en haut, en bas, à gauche ou à droite du tracé).

source: **Ignore title insertion message**
fr: **Ignorer le message d'insertion de titre**

source: Suppress the information message when inserting an object title as an annotation label.
fr: Supprimer le message d'information lors de l'insertion d'un titre d'objet comme étiquette d'annotation.

source: Signals
fr: Signaux

source: The Signals sub-tab contains settings specific to signal visualizations:
fr: Le sous-onglet Signaux contient des paramètres spécifiques aux visualisations de signaux :

source: Visualization settings - Signals sub-tab
fr: Préférences de visualisation - Sous-onglet Signaux

source: **Default line width**
fr: **Épaisseur par défaut**

source: Default line width for curves representing signals. This setting affects all signal visualizations unless overridden individually. Note: for signals exceeding the line width performance threshold (see below), the line width is automatically clamped to 1.0 for optimal rendering performance.
fr: Épaisseur de trait par défaut pour les courbes représentant les signaux. Ce paramètre affecte toutes les visualisations de signaux, sauf si elles sont remplacées individuellement. Remarque : pour les signaux dépassant le seuil de performance de l'épaisseur de trait (voir ci-dessous), l'épaisseur de trait est automatiquement plafonnée à 1,0 pour des performances de rendu optimales.

source: **Line width performance threshold**
fr: **Seuil de performance de l'épaisseur de trait**

source: For signals with more than this number of points (default: 1,000), line width is automatically limited to 1.0 for performance reasons. This prevents the ~10x rendering slowdown caused by Qt's raster engine when drawing thick lines (width > 1.0) on large datasets. For smaller signals, the configured default line width applies normally. This optimization is transparent and requires no user intervention.
fr: Pour les signaux comportant plus de ce nombre de points (par défaut : 1 000), l'épaisseur de trait est automatiquement limitée à 1,0 pour des raisons de performance. Cela évite le ralentissement du rendu d'environ 10x causé par le moteur raster de Qt lors du dessin de lignes épaisses (largeur > 1,0) sur de grands ensembles de données. Pour les signaux plus petits, l'épaisseur de trait par défaut configurée s'applique normalement. Cette optimisation est transparente et ne nécessite aucune intervention de l'utilisateur.

source: **Use auto downsampling**
fr: **Utiliser le sous-échantillonnage automatique**

source: Enable automatic downsampling for large signals to improve performance and visualization clarity.
fr: Activer le sous-échantillonnage automatique pour les grands signaux afin d'améliorer les performances et la clarté de la visualisation.

source: **Downsampling max points**
fr: **Nombre maximum de points de sous-échantillonnage**

source: Maximum number of points to display when downsampling is enabled (default: 10,000).
fr: Nombre maximum de points à afficher lorsque le sous-échantillonnage est activé (par défaut : 10 000).

source: **Autoscale margin**
fr: **Marge d'échelle automatique**

source: Percentage of margin to add around data when auto-scaling signal plots. A value of 0.2% adds a small margin for better visualization. Set to 0% for no margin (exact data bounds).
fr: Pourcentage de marge à ajouter autour des données lors de la mise à l'échelle automatique des tracés de signaux. Une valeur de 0,2 % ajoute une petite marge pour une meilleure visualisation. Mettre à 0 % pour aucune marge (bornes de données exactes).

source: **DateTime format (s/min/h)**
fr: **Format DateTime (s/min/h)**

source: Format string for datetime X-axis labels when using standard time units (s, min, h). Uses Python's strftime format codes (e.g., %H:%M:%S for hours:minutes:seconds).
fr: Chaîne de format pour les étiquettes de l'axe X datetime lors de l'utilisation d'unités de temps standard (s, min, h). Utilise les codes de format strftime de Python (par exemple, %H:%M:%S pour heures:minutes:secondes).

source: **DateTime format (ms/μs/ns)**
fr: **Format DateTime (ms/μs/ns)**

source: Format string for datetime X-axis labels when using sub-second time units (ms, μs, ns). Uses Python's strftime format codes (e.g., %H:%M:%S.%f for hours:minutes:seconds.microseconds).
fr: Chaîne de format pour les étiquettes de l'axe X datetime lors de l'utilisation d'unités de temps infra-secondes (ms, μs, ns). Utilise les codes de format strftime de Python (par exemple, %H:%M:%S.%f pour heures:minutes:secondes.microsecondes).

source: **Results: edit shape styles**
fr: **Résultats : modifier les styles de forme**

source: Click this button to configure the visual style for annotation shapes (rectangles, circles, segments, etc.) displayed on signal plots. This includes:
fr: Cliquer sur ce bouton pour configurer le style visuel des formes d'annotation (rectangles, cercles, segments, etc.) affichées sur les tracés de signaux. Cela inclut :

source: Line style, color, and width
fr: Style de ligne, couleur et largeur

source: Fill pattern, color, and transparency
fr: Motif de remplissage, couleur et transparence

source: Symbol shape, size, and colors
fr: Forme du symbole, taille et couleurs

source: These settings apply to all result shapes drawn on signal plots (e.g., peak markers, FWHM indicators, feature detection results).
fr: Ces paramètres s'appliquent à toutes les formes de résultats dessinées sur les tracés de signaux (par exemple, les marqueurs de pics, les indicateurs FWHM, les résultats de détection de caractéristiques).

source: **Results: edit marker styles**
fr: **Résultats : modifier les styles de marqueur**

source: Click this button to configure the visual style for cursor markers on signal plots. This includes:
fr: Cliquer sur ce bouton pour configurer le style visuel des marqueurs de curseur sur les tracés de signaux. Cela inclut :

source: Symbol appearance
fr: Apparence du symbole

source: Text label formatting and positioning
fr: Formatage et positionnement des étiquettes de texte

source: Background transparency
fr: Transparence de l'arrière-plan

source: These settings apply to cursor-type markers used in signal analysis results.
fr: Ces paramètres s'appliquent aux marqueurs de type curseur utilisés dans les résultats d'analyse de signaux.

source: The Images sub-tab contains settings specific to image visualizations:
fr: Le sous-onglet Images contient des paramètres spécifiques aux visualisations d'images :

source: Visualization settings - Images sub-tab
fr: Préférences de visualisation - Sous-onglet Images

source: **Lock aspect ratio to 1:1**
fr: **Verrouiller le rapport d'aspect à 1:1**

source: When enabled, the aspect ratio of images is locked to 1:1. When disabled, the aspect ratio is determined by the physical pixel size (default and recommended setting).
fr: Si le réglage est activé, le rapport d'aspect des images est verrouillé à 1:1. Lorsque désactivé, le rapport d'aspect est déterminé par la taille physique du pixel (paramètre par défaut et recommandé).

source: **Eliminate outliers**
fr: **Éliminer les valeurs aberrantes**

source: Percentage of the highest and lowest values to eliminate from the image histogram. Recommended values are below 1%.
fr: Pourcentage des valeurs les plus élevées et les plus basses à éliminer de l'histogramme de l'image. Les valeurs recommandées sont inférieures à 1 %.

source: Percentage of margin to add around data when auto-scaling image plots. A value of 0.2% adds a small margin for better visualization. Set to 0% for no margin (exact data bounds).
fr: Pourcentage de marge à ajouter autour des données lors de la mise à l'échelle automatique des tracés d'images. Une valeur de 0,2 % ajoute une petite marge pour une meilleure visualisation. Mettre à 0 % pour aucune marge (bornes de données exactes).

source: **Default image visualization settings**
fr: **Paramètres de visualisation d'image par défaut**

source: Click this button to configure default visualization settings for images (colormap, interpolation, contrast, etc.).
fr: Cliquer sur ce bouton pour configurer les paramètres de visualisation par défaut pour les images (carte de couleurs, interpolation, contraste, etc.).

source: Click this button to configure the visual style for annotation shapes displayed on image plots. Parameters are similar to signal shapes but optimized for image visualization (e.g., different colors for better visibility on images).
fr: Cliquer sur ce bouton pour configurer le style visuel des formes d'annotation affichées sur les tracés d'images. Les paramètres sont similaires à ceux des formes de signaux mais optimisés pour la visualisation d'images (par exemple, différentes couleurs pour une meilleure visibilité sur les images).

source: Click this button to configure the visual style for cursor markers on image plots.
fr: Cliquer sur ce bouton pour configurer le style visuel des marqueurs de curseur sur les tracés d'images.

source: Results
fr: Résultats

source: The Results sub-tab contains settings for displaying analysis results on plots:
fr: L'onglet des préférences de résultats contient des paramètres pour l'affichage des résultats d'analyse sur les graphiques :

source: Visualization settings - Results sub-tab
fr: Préférences de visualisation - Sous-onglet Résultats

source: These settings control how analysis results are displayed on plots to prevent performance issues with large datasets:
fr: Ces paramètres contrôlent la façon dont les résultats d'analyse sont affichés sur les graphiques afin de limiter les problèmes de performance avec de grands ensembles de données :

source: **Maximum shapes to draw**
fr: **Nombre maximum de formes à dessiner**

source: Maximum number of geometry shapes to draw on the plot (default: 1,000). When the number of shapes exceeds this limit, only the first N shapes are drawn and a warning label is displayed.
fr: Nombre maximum de formes géométriques à dessiner sur le graphique (par défaut : 1 000). Lorsque le nombre de formes dépasse cette limite, seules les N premières formes sont dessinées et une étiquette d'avertissement est affichée.

source: **Maximum cells in label**
fr: **Nombre maximum de cellules dans l'étiquette**

source: Maximum number of table cells (rows × columns) to display in merged result labels on plots (default: 100). When the number of cells exceeds this limit, the table is truncated.
fr: Nombre maximum de cellules de tableau (lignes × colonnes) à afficher dans les étiquettes de résultats fusionnés sur les graphiques (par défaut : 100). Lorsque le nombre de cellules dépasse cette limite, le tableau est tronqué.

source: **Maximum columns in label**
fr: **Nombre maximum de colonnes dans l'étiquette**

source: Maximum number of columns to display in merged result labels (default: 15). When the number of columns exceeds this limit, only the first N columns are displayed.
fr: Nombre maximum de colonnes à afficher dans les étiquettes de résultats fusionnés (par défaut : 15). Lorsque le nombre de colonnes dépasse cette limite, seules les N premières colonnes sont affichées.

source: **Show the merged result label by default**
fr: **Afficher l'étiquette de résultat fusionné par défaut**

source: When enabled, the merged result label is shown on the plot by default for new objects. This setting can be toggled per-object using the checkbox in the Properties panel.
fr: Si le réglage est activé, l'étiquette de résultat fusionné est affichée sur le graphique par défaut pour les nouveaux objets. Ce paramètre peut être basculé par objet à l'aide de la case à cocher dans le panneau Propriétés.
