Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/index.po
Languages: fr

source: Contents:
fr: Sommaire :

source: Getting started with DataLab, the open platform for signal and image processing
fr: Premiers pas avec DataLab, la plateforme open-source de traitement de signaux et d'images

source: DataLab, signal processing, image processing, open platform, scientific data, industrial data, industrial-grade software
fr: DataLab, traitement de signaux, traitement d'images, plateforme ouverte, données scientifiques, données industrielles, logiciel industriel

source: Getting started
fr: Premiers pas

source: DataLab is an open platform for signal and image processing, designed to be used by scientists, engineers, and researchers in academia and industry, while offering the reliability of industrial-grade software. It is a versatile software that can be used for a wide range of applications, from simple data analysis to complex signal processing and image analysis tasks.
fr: DataLab est une plateforme ouverte de traitement de signaux et d'images, conçue pour être utilisée par les scientifiques, ingénieurs et chercheurs du monde académique et industriel, tout en offrant la fiabilité d'un logiciel industriel. C'est un logiciel polyvalent qui peut être utilisé pour un large éventail d'applications, de l'analyse de données simple aux tâches complexes de traitement de signaux et d'analyse d'images.

source: DataLab integrates seemlessly into your workflow thanks to three main operating modes:
fr: DataLab s'intègre parfaitement dans votre flux de travail grâce à trois modes de fonctionnement principaux :

source: **Stand-alone application**, with a graphical user interface that allows you to interact with your data and visualize the results of your analysis in real time.
fr: **Application autonome**, avec une interface graphique qui vous permet d'interagir avec vos données et de visualiser les résultats de votre analyse en temps réel.

source: **Python library**, allowing you to integrate DataLab functions (or graphical user interfaces) into your own Python scripts and programs or Jupyter notebooks.
fr: **Bibliothèque Python**, vous permettant d'intégrer les fonctions de DataLab (ou les interfaces graphiques) dans vos propres scripts et programmes Python ou des notebooks Jupyter.

source: **Remotely controlled** from your own software, or from an IDE (e.g., Spyder) or a Jupyter notebook, using the DataLab API.
fr: **Piloté à distance** depuis votre propre logiciel, ou depuis un IDE (par exemple Spyder) ou un notebook Jupyter, en utilisant l'API de DataLab.

source: DataLab leverages the power of Python and its scientific ecosystem, through the use of the following libraries:
fr: DataLab s'appuie sur la puissance de Python et de son écosystème scientifique, grâce à l'utilisation des bibliothèques suivantes :

source: `NumPy <https://numpy.org/>`_ for numerical computing (arrays, linear algebra, etc.)
fr: `NumPy <https://numpy.org/>`_ pour le calcul numérique (tableaux, algèbre linéaire, etc.)

source: `SciPy <https://www.scipy.org/>`_ for scientific computing (interpolation, special functions, etc.)
fr: `SciPy <https://www.scipy.org/>`_ pour le calcul scientifique (interpolation, fonctions spéciales, etc.)

source: `scikit-image <https://scikit-image.org/>`_ and `OpenCV <https://opencv.org/>`_ for image processing
fr: `scikit-image <https://scikit-image.org/>`_ et `OpenCV <https://opencv.org/>`_ pour le traitement d'images

source: `PyWavelets <https://pywavelets.readthedocs.io/en/latest/>`_ for wavelet transform
fr: `PyWavelets <https://pywavelets.readthedocs.io/en/latest/>`_ pour la transformée en ondelettes

source: `PlotPyStack <https://github.com/PlotPyStack/>`_ for Qt-based interactive data visualization
fr: `PlotPyStack <https://github.com/PlotPyStack/>`_ pour la visualisation interactive de données basée sur Qt

source: <svg version="1.1" width="1.0em" height="1.0em" class="sd-octicon sd-octicon-package sd-text-info" viewBox="0 0 16 16" aria-hidden="true"><path d="m8.878.392 5.25 3.045c.54.314.872.89.872 1.514v6.098a1.75 1.75 0 0 1-.872 1.514l-5.25 3.045a1.75 1.75 0 0 1-1.756 0l-5.25-3.045A1.75 1.75 0 0 1 1 11.049V4.951c0-.624.332-1.201.872-1.514L7.122.392a1.75 1.75 0 0 1 1.756 0ZM7.875 1.69l-4.63 2.685L8 7.133l4.755-2.758-4.63-2.685a.248.248 0 0 0-.25 0ZM2.5 5.677v5.372c0 .09.047.171.125.216l4.625 2.683V8.432Zm6.25 8.271 4.625-2.683a.25.25 0 0 0 .125-.216V5.677L8.75 8.432Z"></path></svg> Installation
fr: Installation

source: How to install DataLab on your computer
fr: Comment installer DataLab sur votre ordinateur

source: Use cases and key strengths of DataLab
fr: Cas d'utilisation et points forts de DataLab

source: <svg version="1.1" width="1.0em" height="1.0em" class="sd-octicon sd-octicon-star sd-text-info" viewBox="0 0 16 16" aria-hidden="true"><path d="M8 .25a.75.75 0 0 1 .673.418l1.882 3.815 4.21.612a.75.75 0 0 1 .416 1.279l-3.046 2.97.719 4.192a.751.751 0 0 1-1.088.791L8 12.347l-3.766 1.98a.75.75 0 0 1-1.088-.79l.72-4.194L.818 6.374a.75.75 0 0 1 .416-1.28l4.21-.611L7.327.668A.75.75 0 0 1 8 .25Zm0 2.445L6.615 5.5a.75.75 0 0 1-.564.41l-3.097.45 2.24 2.184a.75.75 0 0 1 .216.664l-.528 3.084 2.769-1.456a.75.75 0 0 1 .698 0l2.77 1.456-.53-3.084a.75.75 0 0 1 .216-.664l2.24-2.183-3.096-.45a.75.75 0 0 1-.564-.41L8 2.694Z"></path></svg> Key features
fr: Fonctionnalités clés

source: Feature matrix of DataLab
fr: Matrice des fonctionnalités de DataLab

source: <svg version="1.1" width="1.0em" height="1.0em" class="sd-octicon sd-octicon-mortar-board sd-text-info" viewBox="0 0 16 16" aria-hidden="true"><path d="M7.693 1.066a.747.747 0 0 1 .614 0l7.25 3.25a.75.75 0 0 1 0 1.368L13 6.831v2.794c0 1.024-.81 1.749-1.66 2.173-.893.447-2.075.702-3.34.702-.278 0-.55-.012-.816-.036a.75.75 0 0 1 .133-1.494c.22.02.45.03.683.03 1.082 0 2.025-.221 2.67-.543.69-.345.83-.682.83-.832V7.503L8.307 8.934a.747.747 0 0 1-.614 0L4 7.28v1.663c.296.105.575.275.812.512.438.438.688 1.059.688 1.796v3a.75.75 0 0 1-.75.75h-3a.75.75 0 0 1-.75-.75v-3c0-.737.25-1.358.688-1.796.237-.237.516-.407.812-.512V6.606L.443 5.684a.75.75 0 0 1 0-1.368ZM2.583 5 8 7.428 13.416 5 8 2.572ZM2.5 11.25v2.25H4v-2.25c0-.388-.125-.611-.25-.735a.697.697 0 0 0-.5-.203.707.707 0 0 0-.5.203c-.125.124-.25.347-.25.735Z"></path></svg> Tutorials
fr: Tutoriels

source: Tutorials to learn how to use DataLab
fr: Tutoriels pour apprendre à utiliser DataLab
