Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/installation_offline.po
Languages: fr

source: Offline installation guide for DataLab on systems without internet access
fr: Guide d'installation hors ligne de DataLab sur des systèmes sans accès Internet

source: DataLab, offline, installation, Python, pip, wheel, no internet, Windows, Linux, macOS
fr: DataLab, hors ligne, installation, Python, pip, wheel, sans internet, Windows, Linux, macOS

source: Offline Installation
fr: Installation hors ligne

source: This guide explains how to install DataLab on a system **without internet access**.
fr: Ce guide explique comment installer DataLab sur un système **sans accès Internet**.

source: This page focuses on **offline installation using pip** (Python package manager). For other offline installation methods, see the :ref:`installation_offline_alternatives` section below.
fr: Cette page se concentre sur **l'installation hors ligne avec pip** (gestionnaire de paquets Python). Pour les autres méthodes d'installation hors ligne, consultez la section :ref:`installation_offline_alternatives` ci-dessous.

source: Offline installation via pip
fr: Installation hors ligne via pip

source: This method works on **any operating system** with **Python 3.9 to 3.14**. It assumes you have an online machine available to download packages, and a separate offline machine where DataLab will be installed.
fr: Cette méthode fonctionne sur **tout système d'exploitation** avec **Python 3.9 à 3.14**. Elle suppose que vous disposez d'une machine en ligne pour télécharger les paquets, et d'une machine hors ligne distincte où DataLab sera installé.

source: Requirements
fr: Prérequis

source: Offline machine
fr: Machine hors ligne

source: GNU/Linux, Windows, or macOS
fr: GNU/Linux, Windows ou macOS

source: Python 3.9 to 3.14 installed with the **same major version** as the online machine
fr: Python 3.9 à 3.14 installé avec la **même version majeure** que la machine en ligne

source: No assumptions regarding installed packages
fr: Aucune hypothèse concernant les paquets installés

source: **Version compatibility is critical:**
fr: **La compatibilité des versions est critique :**

source: ✅ **Allowed:** Python 3.10.2 ↔ Python 3.10.11 (same major version)
fr: ✅ **Autorisé :** Python 3.10.2 ↔ Python 3.10.11 (même version majeure)

source: ❌ **Not allowed:** Python 3.10.x ↔ Python 3.11.x (different major versions)
fr: ❌ **Non autorisé :** Python 3.10.x ↔ Python 3.11.x (versions majeures différentes)

source: SciPy, NumPy, and scikit-image are highly dependent on the Python major version. Both machines must use the same major Python version for reliable offline installation.
fr: SciPy, NumPy et scikit-image dépendent fortement de la version majeure de Python. Les deux machines doivent utiliser la même version majeure de Python pour une installation hors ligne fiable.

source: To check your Python version, run:
fr: Pour vérifier votre version de Python, exécutez :

source: Online machine
fr: Machine en ligne

source: Windows, Linux, or macOS
fr: Windows, Linux ou macOS

source: Python with the **same major version** as the offline machine
fr: Python avec la **même version majeure** que la machine hors ligne

source: ``pip`` installed
fr: ``pip`` installé

source: Preparing packages (online machine)
fr: Préparation des paquets (machine en ligne)

source: Download all required **Wheel packages** for offline installation.
fr: Téléchargez tous les **paquets Wheel** nécessaires pour l'installation hors ligne.

source: Create a folder for packages
fr: Créer un dossier pour les paquets

source: Download DataLab and dependencies
fr: Télécharger DataLab et ses dépendances

source: This command downloads:
fr: Cette commande télécharge :

source: ``numpy``, ``scipy``, ``scikit-image``, and other dependencies
fr: ``numpy``, ``scipy``, ``scikit-image`` et d'autres dépendances

source: Expected folder structure
fr: Structure de dossier attendue

source: After downloading, your folder should contain files similar to:
fr: Après le téléchargement, votre dossier devrait contenir des fichiers similaires à :

source: The ``[platform]`` suffix in the wheel filenames will vary depending on your system: ``win_amd64`` (Windows), ``manylinux`` (Linux), ``macosx`` (macOS).
fr: Le suffixe ``[platform]`` dans les noms de fichiers wheel variera en fonction de votre système : ``win_amd64`` (Windows), ``manylinux`` (Linux), ``macosx`` (macOS).

source: Transfer to offline machine
fr: Transfert vers la machine hors ligne

source: Transfer the ``datalab-offline`` folder to your offline machine using:
fr: Transférez le dossier ``datalab-offline`` vers votre machine hors ligne en utilisant :

source: USB drive
fr: Clé USB

source: Network share
fr: Partage réseau

source: Any other approved method in your organization
fr: Toute autre méthode approuvée dans votre organisation

source: Offline installation
fr: Installation hors ligne

source: On the offline machine, navigate to the folder and install DataLab.
fr: Sur la machine hors ligne, naviguez vers le dossier et installez DataLab.

source: Navigate to the folder
fr: Naviguer vers le dossier

source: Install DataLab offline
fr: Installer DataLab hors ligne

source: The ``--no-index`` option tells pip not to connect to the internet, and ``--find-links .`` tells pip to look for packages in the current directory.
fr: L'option ``--no-index`` indique à pip de ne pas se connecter à Internet, et ``--find-links .`` indique à pip de rechercher les paquets dans le répertoire courant.

source: Verification
fr: Vérification

source: To verify that DataLab is installed correctly, run:
fr: Pour vérifier que DataLab est correctement installé, exécutez :

source: This should launch the DataLab application.
fr: Cela devrait lancer l'application DataLab.

source: Optional: Virtual environment
fr: Optionnel : Environnement virtuel

source: It is recommended to install DataLab in a virtual environment to avoid conflicts with other Python packages.
fr: Il est recommandé d'installer DataLab dans un environnement virtuel pour éviter les conflits avec d'autres paquets Python.

source: Create and activate a virtual environment
fr: Créer et activer un environnement virtuel

source: Install DataLab in the virtual environment
fr: Installer DataLab dans l'environnement virtuel

source: Launch DataLab
fr: Lancer DataLab

source: WinPython for offline usage
fr: WinPython pour une utilisation hors ligne

source: `WinPython <https://winpython.github.io/>`_ is particularly well-suited for offline installations as it provides a portable, self-contained Python environment.
fr: `WinPython <https://winpython.github.io/>`_ est particulièrement adapté aux installations hors ligne car il fournit un environnement Python portable et autonome.

source: Prepare on online machine
fr: Préparation sur la machine en ligne

source: Download WinPython with the **same major Python version** as your target system
fr: Téléchargez WinPython avec la **même version majeure de Python** que votre système cible

source: Install WinPython
fr: Installez WinPython

source: Open the *WinPython Command Prompt*
fr: Ouvrez l'*invite de commandes WinPython*

source: Download packages:
fr: Téléchargez les paquets :

source: Install on offline machine
fr: Installation sur la machine hors ligne

source: Transfer WinPython and the ``datalab-offline`` folder to the offline machine
fr: Transférez WinPython et le dossier ``datalab-offline`` vers la machine hors ligne

source: Install DataLab:
fr: Installez DataLab :

source: Benefits of WinPython
fr: Avantages de WinPython

source: **Portable:** No installation required, can run from USB drive
fr: **Portable :** Aucune installation requise, peut fonctionner depuis une clé USB

source: **Self-contained:** All dependencies included
fr: **Autonome :** Toutes les dépendances incluses

source: **Ideal for restricted environments:** No admin rights needed
fr: **Idéal pour les environnements restreints :** Aucun droit administrateur nécessaire

source: **Multiple versions:** Can have multiple Python versions side by side
fr: **Versions multiples :** Peut avoir plusieurs versions de Python côte à côte

source: Quick summary
fr: Résumé rapide

source: The complete workflow in four steps:
fr: Le flux de travail complet en quatre étapes :

source: **On online machine:** Download packages
fr: **Sur la machine en ligne :** Télécharger les paquets

source: **Transfer:** Copy the ``datalab-offline`` folder to the offline machine
fr: **Transfert :** Copier le dossier ``datalab-offline`` vers la machine hors ligne

source: **On offline machine:** Install offline
fr: **Sur la machine hors ligne :** Installer hors ligne

source: **Verify:** Launch DataLab
fr: **Vérification :** Lancer DataLab

source: Other offline installation methods
fr: Autres méthodes d'installation hors ligne

source: While this guide focuses on pip-based offline installation, DataLab can also be installed offline using other methods:
fr: Bien que ce guide se concentre sur l'installation hors ligne avec pip, DataLab peut également être installé hors ligne en utilisant d'autres méthodes :

source: Stand-alone installer (Windows)
fr: Installateur autonome (Windows)

source: :octicon:`info;1em;sd-text-info` :bdg-info-line:`Windows` **Recommended for offline installation**
fr: :octicon:`info;1em;sd-text-info` :bdg-info-line:`Windows` **Recommandé pour l'installation hors ligne**

source: The **all-in-one installer** is the simplest way to install DataLab offline on Windows. It does not require any Python distribution or internet connection on the target machine.
fr: L'**installateur tout-en-un** est le moyen le plus simple d'installer DataLab hors ligne sur Windows. Il ne nécessite aucune distribution Python ni connexion Internet sur la machine cible.

source: **Advantages:**
fr: **Avantages :**

source: No Python installation required
fr: Aucune installation Python requise

source: Single executable file
fr: Fichier exécutable unique

source: Self-contained with all dependencies
fr: Autonome avec toutes les dépendances

source: No internet connection needed during installation
fr: Aucune connexion Internet nécessaire pendant l'installation

source: Works on air-gapped systems
fr: Fonctionne sur des systèmes isolés

source: **How to use:**
fr: **Comment l'utiliser :**

source: On a machine with internet access, download the installer from the `DataLab Releases <https://github.com/DataLab-Platform/DataLab/releases>`_ page
fr: Sur une machine avec accès Internet, téléchargez l'installateur depuis la page `DataLab Releases <https://github.com/DataLab-Platform/DataLab/releases>`_

source: Transfer the installer executable to the offline machine (USB drive, network share, etc.)
fr: Transférez l'exécutable de l'installateur vers la machine hors ligne (clé USB, partage réseau, etc.)

source: Run the installer on the offline machine
fr: Exécutez l'installateur sur la machine hors ligne

source: For more information, see :ref:`install_aioinstaller`.
fr: Pour plus d'informations, consultez :ref:`install_aioinstaller`.

source: WinPython distribution (Windows)
fr: Distribution WinPython (Windows)

source: `DataLab-WinPython <https://github.com/DataLab-Platform/DataLab-WinPython>`_ is a portable Python distribution that includes DataLab and all its dependencies.
fr: `DataLab-WinPython <https://github.com/DataLab-Platform/DataLab-WinPython>`_ est une distribution Python portable qui inclut DataLab et toutes ses dépendances.

source: Portable (can run from USB drive)
fr: Portable (peut fonctionner depuis une clé USB)

source: No installation required
fr: Aucune installation requise

source: Includes full Python environment
fr: Inclut un environnement Python complet

source: Can be extended with additional packages
fr: Peut être étendu avec des paquets supplémentaires

source: Ideal for restricted environments
fr: Idéal pour les environnements restreints

source: Download DataLab-WinPython from the `releases page <https://github.com/DataLab-Platform/DataLab-WinPython/releases>`_
fr: Téléchargez DataLab-WinPython depuis la `page des versions <https://github.com/DataLab-Platform/DataLab-WinPython/releases>`_

source: Transfer to the offline machine
fr: Transférez vers la machine hors ligne

source: Extract and run
fr: Extrayez et exécutez

source: For more information, see :ref:`install_winpython`.
fr: Pour plus d'informations, consultez :ref:`install_winpython`.

source: Conda offline installation
fr: Installation hors ligne avec Conda

source: Conda packages can also be installed offline using a similar approach to pip:
fr: Les paquets Conda peuvent également être installés hors ligne en utilisant une approche similaire à pip :

source: **On online machine:** Download the conda package and dependencies:
fr: **Sur la machine en ligne :** Téléchargez le paquet conda et ses dépendances :

source: Or use ``conda list --explicit`` to create a specification file.
fr: Ou utilisez ``conda list --explicit`` pour créer un fichier de spécification.

source: **Transfer** the downloaded packages to the offline machine
fr: **Transférez** les paquets téléchargés vers la machine hors ligne

source: **On offline machine:** Install from the local packages:
fr: **Sur la machine hors ligne :** Installez à partir des paquets locaux :

source: For more information about offline conda installation, see the `Conda documentation <https://conda.io/projects/conda/en/latest/user-guide/tasks/manage-pkgs.html#installing-packages-offline>`_.
fr: Pour plus d'informations sur l'installation hors ligne avec conda, consultez la `documentation Conda <https://conda.io/projects/conda/en/latest/user-guide/tasks/manage-pkgs.html#installing-packages-offline>`_.

source: For standard online installation, see :ref:`install_conda`.
fr: Pour l'installation en ligne standard, consultez :ref:`install_conda`.

source: For standard online installation methods, see :ref:`installation`.
fr: Pour les méthodes d'installation en ligne standard, consultez :ref:`installation`.
