Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/contributing/contribute_code.po
Languages: fr

source: Contribute code
fr: Contribuer au code

source: This page explains how you can contribute code to the project.
fr: Cette page explique comment vous pouvez contribuer au code du projet.

source: The :ref:`guidelines` page presents the coding guidelines that you should follow when contributing to the project.
fr: Les règles de codage sont présentées dans la page :ref:`guidelines`.

source: Fork the project
fr: Forker le projet

source: The first step is to fork the project on GitHub. You can do that by visiting `DataLab GitHub project <https://github.com/Codra-Ingenierie-Informatique/DataLab/>`_ and clicking on the "Fork" button on the top right corner of the page.
fr: La première étape est de forker le projet sur GitHub. Vous pouvez le faire en visitant le projet DataLab et en cliquant sur le bouton "Fork" en haut à droite de la `page GitHub du projet <https://github.com/Codra-Ingenierie-Informatique/DataLab/>`_.

source: Once you have forked the project, you will have a copy of the project in your own GitHub account. Then you can clone the project on your computer and start working on it.
fr: Une fois que vous avez forké le projet, vous aurez une copie du projet dans votre propre compte GitHub. Ensuite, vous pouvez cloner le projet sur votre ordinateur et commencer à travailler dessus.

source: Submit a pull request
fr: Soumettre une pull request

source: Once you have made some changes, you can submit a pull request to the original project. To do that, go to your forked project on GitHub and click on the "Pull request" button on the top right corner of the page.
fr: Dès que vous avez apporté des modifications, vous pouvez soumettre une pull request au projet original. Pour ce faire, allez sur votre projet forké sur GitHub et cliquez sur le bouton "Pull request" en haut à droite de la page.

source: Then you will have to fill a form to describe your pull request. Once you have submitted the pull request, the project maintainers will review your changes and merge them if they are satisfied.
fr: Ensuite vous devrez remplir un formulaire pour décrire votre pull request. Une fois que vous avez soumis la pull request, les mainteneurs du projet examineront vos modifications et les fusionneront s'ils sont satisfaits.

source: During the review process, the project maintainers will check that your code follows the coding guidelines and that it does not break the existing tests. If your code does not follow the coding guidelines, you will have to fix it before your pull request can be merged.
fr: Lors du processus de revue, les mainteneurs du projet vérifieront que votre code suit les règles de codage et qu'il ne casse pas les tests existants. Si votre code ne suit pas les directives de codage, vous devrez le corriger avant que votre pull request puisse être fusionnée.
