Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/contributing/dependencies.po
Languages: fr

source: About Dependencies
fr: A propos des dépendances

source: Dependencies are an important part of any software project, and they can significantly affect the development process. In this section, we will discuss the dependencies used in our project, how to manage them, and best practices for keeping them up to date.
fr: Les dépendances sont une partie importante de tout projet logiciel, et elles peuvent affecter considérablement le processus de développement. Dans cette section, nous allons discuter des dépendances utilisées dans notre projet, comment les gérer et les meilleures pratiques pour les maintenir à jour.

source: Managing Dependencies
fr: Gérer les dépendances

source: Dependencies in DataLab Project are defined in the `pyproject.toml` file, as officially recommended by the Python packaging authority (see `Writing your pyproject.toml <https://packaging.python.org/en/latest/guides/writing-pyproject-toml/>`_).
fr: Les dépendances du projet DataLab sont définies dans le fichier `pyproject.toml`, comme recommandé officiellement par l'autorité de packaging Python (voir `Writing your pyproject.toml <https://packaging.python.org/en/latest/guides/writing-pyproject-toml/>`_).

source: The `pyproject.toml` file contains many sections, but the most relevant for dependencies are:
fr: "Le fichier `pyproject.toml` contient de nombreuses sections, mais les plus pertinentes pour les dépendances sont :

source: `[project.dependencies]`: This section lists the direct dependencies of the application. These are the packages that the application needs to run.
fr: `[project.dependencies]`: Cette section liste les dépendances directes de l'application. Ce sont les paquets dont l'application a besoin pour fonctionner.

source: `[project.optional-dependencies]`: This section lists optional dependencies that can be installed to enable additional features. These dependencies are not required for the core functionality of the application but can enhance its capabilities.
fr: `[project.optional-dependencies]`: Cette section liste les dépendances optionnelles qui peuvent être installées pour activer des fonctionnalités supplémentaires. Ces dépendances ne sont pas nécessaires au fonctionnement de base de l'application, mais peuvent améliorer ses capacités.

source: Among the optional dependencies, we have:
fr: Parmi les dépendances optionnelles, nous avons :

source: `qt`: This group contains dependencies needed for the Qt-based graphical user interface (currently, PyQt5).
fr: `qt`: Ce groupe contient les dépendances nécessaires à l'interface utilisateur graphique basée sur Qt (actuellement, PyQt5).

source: `opencv`: This group contains dependencies needed for computer vision tasks requiring OpenCV.
fr: `opencv`: Ce groupe contient les dépendances nécessaires aux tâches de vision par ordinateur nécessitant OpenCV.

source: `dev`: This group contains dependencies needed for development and testing (linters, formatters, etc.).
fr: `dev`: Ce groupe contient les dépendances nécessaires au développement et aux tests (linters, formateurs, etc.).

source: `doc`: This group contains dependencies needed for building the documentation (Sphinx, etc.).
fr: `doc`: Ce groupe contient les dépendances nécessaires à la construction de la documentation (Sphinx, etc.).

source: `test`: This group contains dependencies needed for running the tests (pytest, etc.).
fr: `test`: Ce groupe contient les dépendances nécessaires à l'exécution des tests (pytest, etc.).

source: Deploying Dependencies
fr: Déployer les dépendances

source: Production
fr: En production

source: In production, we recommend using the package manager that is most suitable for your environment and that you are most comfortable with. All package managers (e.g., `pip`, `conda`) are directly or indirectly using the information from the `pyproject.toml` file to install the dependencies.
fr: En production, nous recommandons d'utiliser le gestionnaire de paquets qui convient le mieux à votre environnement et avec lequel vous êtes le plus à l'aise. Tous les gestionnaires de paquets (par exemple, `pip`, `conda`) utilisent directement ou indirectement les informations du fichier `pyproject.toml` pour installer les dépendances.

source: See :ref:`installation` for more information on how to install DataLab and its dependencies.
fr: Voir :ref:`installation` pour plus d'informations sur la façon d'installer DataLab et ses dépendances.

source: Development
fr: En développement

source: In development, you may also use the `requirements.txt` file to make it easier to install the dependencies in a virtual environment or container.
fr: En développement, vous pouvez également utiliser le fichier `requirements.txt` pour faciliter l'installation des dépendances dans un environnement virtuel ou un conteneur.

source: The `requirements.txt` file is generated from the `pyproject.toml` file using `toml-to-requirements` tool. This file is useful for quickly installing the dependencies in a virtual environment or container.
fr: Le fichier `requirements.txt` est généré à partir du fichier `pyproject.toml` en utilisant l'outil `toml-to-requirements`. Ce fichier est utile pour installer rapidement les dépendances dans un environnement virtuel ou un conteneur.

source: Adding New Dependencies
fr: Ajouter de nouvelles dépendances

source: When adding new dependencies to the project, please follow these rules:
fr: Lors de l'ajout de nouvelles dépendances au projet, veuillez suivre ces règles :

source: If it is a direct dependency, that is a package that the application needs to run, add it to the `[project.dependencies]` section in the `pyproject.toml` file, and specify the version range that is compatible with the application, in order to avoid breaking changes.
fr: Si c'est une dépendance directe, c'est-à-dire un paquet dont l'application a besoin pour fonctionner, ajoutez-le à la section `[project.dependencies]` dans le fichier `pyproject.toml`, et spécifiez la plage de versions compatible avec l'application, afin d'éviter les changements incompatibles.

source: If it is an optional dependency, that is a package that can be installed to enable additional features, add it to the appropriate section in the `[project.optional-dependencies]` section in the `pyproject.toml` file.
fr: Si c'est une dépendance optionnelle, c'est-à-dire un paquet qui peut être installé pour activer des fonctionnalités supplémentaires, ajoutez-le à la section appropriée dans la section `[project.optional-dependencies]` du fichier `pyproject.toml`.

source: For the `dev` dependencies, unless it's absolutely necessary, do not specify a version range, as it may limit the ability to use the latest version of the package.
fr: Pour les dépendances `dev`, sauf si c'est absolument nécessaire, ne spécifiez pas de plage de versions, car cela peut limiter la capacité à utiliser la dernière version du paquet.

source: For the other optional dependencies, specify the version range that is compatible with the application, in order to avoid breaking changes.
fr: Pour les autres dépendances optionnelles, spécifiez la plage de versions compatible avec l'application, afin d'éviter les changements incompatibles.

source: In other words, except for the `dev` dependencies, always specify a version range that is compatible with the application.
fr: En d'autres termes, sauf pour les dépendances `dev`, spécifiez toujours une plage de versions compatible avec l'application.
