Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/contributing/gitworkflow.po
Languages: fr

source: Git Workflow
fr: Workflow Git

source: This document describes the Git workflow used in the DataLab project, based on a ``main`` branch, a ``develop`` branch, and feature-specific branches. It also defines how bug fixes are managed.
fr: Ce document décrit le workflow Git utilisé dans le projet DataLab, basé sur une branche ``main``, une branche ``develop`` et des branches spécifiques aux fonctionnalités. Il définit également comment les correctifs de bogues sont gérés.

source: This workflow is a simplified version of the `Gitflow Workflow <https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow>`_. It has been adapted to suit the needs of the DataLab project at the current stage of development. In the near future, we may consider adopting a more complex workflow, e.g. by adding release branches.
fr: Ce workflow est une version simplifiée du `Gitflow Workflow <https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow>`_. Il a été adapté pour répondre aux besoins du projet DataLab à l'étape actuelle de développement. À l'avenir, nous pourrions envisager d'adopter un workflow plus complexe, par exemple en ajoutant des branches de publication.

source: Branching Model
fr: Modèle de branches

source: Main Branches
fr: Branches principales

source: ``main``: Represents the stable, production-ready version of the project.
fr: ``main`` : Représente la version stable et prête pour la production du projet.

source: ``develop``: Used for ongoing development and integration of new features.
fr: ``develop`` : Utilisé pour le développement continu et l'intégration de nouvelles fonctionnalités.

source: Feature Branches
fr: Branches de fonctionnalités

source: ``feature/feature_name``: Used for the development of new features.
fr: ``feature/feature_name`` : Utilisé pour le développement de nouvelles fonctionnalités.

source: Created from ``develop``.
fr: Créé à partir de ``develop``.

source: Merged back into ``develop`` once completed.
fr: Fusionné de nouveau dans ``develop`` une fois terminé.

source: Deleted after merging.
fr: Supprimé après la fusion.

source: Release Branch
fr: Branche de maintenance

source: ``release``: Represents the current maintenance line for patch releases.
fr: ``release`` : Représente la ligne de maintenance actuelle pour les versions correctives.

source: Created from ``main`` after a stable release when the first patch is needed.
fr: Créé à partir de ``main`` après une version stable lorsque le premier correctif est nécessaire.

source: Accepts ``fix/xxx`` and ``hotfix/xxx`` branch merges.
fr: Accepte les fusions des branches ``fix/xxx`` et ``hotfix/xxx``.

source: Merged back into ``main`` for each patch release tag (e.g., 1.0.1, 1.0.2).
fr: Fusionné de nouveau dans ``main`` pour chaque tag de version corrective (par exemple, 1.0.1, 1.0.2).

source: Reset or recreated when starting a new minor/major release cycle.
fr: Réinitialisé ou recréé lors du démarrage d'un nouveau cycle de version mineure/majeure.

source: The ``release`` branch is not versioned (no ``release/1.0.x``). It always represents "the current maintenance line." When a new minor version is released (e.g., 1.2.0), the old ``release`` branch is deleted and a new one is created from the fresh tag when the first patch for 1.2.1 is needed.
fr: La branche ``release`` n'est pas versionnée (pas de ``release/1.0.x``). Elle représente toujours « la ligne de maintenance actuelle ». Lorsqu'une nouvelle version mineure est publiée (par exemple, 1.2.0), l'ancienne branche ``release`` est supprimée et une nouvelle est créée à partir du nouveau tag lorsque le premier correctif pour 1.2.1 est nécessaire.

source: Bug Fix Branches
fr: Branches de correction d'anomalies

source: ``fix/xxx``: Used for general bug fixes that are not urgent.
fr: ``fix/xxx`` : Utilisé pour les corrections générales d'anomalies qui ne sont pas urgentes.

source: Created from ``develop`` (for next feature release) or ``release`` (for patch release).
fr: Créé à partir de ``develop`` (pour la prochaine version de fonctionnalité) ou ``release`` (pour la version corrective).

source: Merged back into the originating branch once completed.
fr: Fusionné de nouveau dans la branche d'origine une fois terminé.

source: ``hotfix/xxx``: Used for urgent production-critical fixes.
fr: ``hotfix/xxx`` : Utilisé pour les corrections urgentes critiques pour la production.

source: Created from ``release`` (if exists) or ``main`` (if no ``release`` branch yet).
fr: Créé à partir de ``release`` (si elle existe) ou ``main`` (si aucune branche ``release`` n'existe encore).

source: Merged back into ``release`` or ``main``.
fr: Fusionné de nouveau dans ``release`` ou ``main``.

source: The fix is then cherry-picked into ``develop``.
fr: La correction est ensuite sélectionnée dans ``develop``.

source: Hotfixes (high-priority fixes) will be integrated in the next maintenance release (X.Y.Z -> Z+1), while fixes (low-priority fixes) will be integrated in the next feature release (X.Y -> Y+1).
fr: Les correctifs urgents (correctifs de haute priorité) seront intégrés dans la prochaine version de maintenance (X.Y.Z -> Z+1), tandis que les correctifs (correctifs de basse priorité) seront intégrés dans la prochaine version de fonctionnalité (X.Y -> Y+1).

source: Documentation Branches
fr: Branches de documentation

source: When working on documentation that is not related to source code (e.g. training materials, user guides), branches should be named using the ``doc/`` prefix.
fr: Lors de la rédaction de documentation qui n'est pas liée au code source (par exemple, les supports de formation, les guides utilisateur), les branches doivent être nommées en utilisant le préfixe ``doc/``.

source: Examples:
fr: Exemples :

source: This naming convention improves clarity by clearly separating documentation efforts from code-related development (features, fixes, etc.).
fr: Cette convention de nommage améliore la clarté en séparant clairement les efforts de documentation du développement lié au code (fonctionnalités, corrections, etc.).

source: Workflow for New Features
fr: Workflow pour les nouvelles fonctionnalités

source: Create a new feature branch from ``develop``:
fr: Créer une nouvelle branche de fonctionnalité à partir de ``develop`` :

source: Develop the feature and commit changes.
fr: Développer la fonctionnalité et valider les modifications.

source: Merge the feature branch back into ``develop``:
fr: Fusionner la branche de fonctionnalité de nouveau dans ``develop`` :

source: Delete the feature branch:
fr: Supprimer la branche de fonctionnalité :

source: Do not leave feature branches unmerged for too long. Regularly rebase them on ``develop`` to minimize conflicts.
fr: Ne pas laisser les branches de fonctionnalités non fusionnées trop longtemps. Les réorganiser régulièrement sur ``develop`` pour minimiser les conflits.

source: Workflow for Regular Bug Fixes
fr: Workflow pour les corrections d'anomalies régulières

source: For next feature release (target: ``develop``):
fr: Pour la prochaine version de fonctionnalité (cible : ``develop``) :

source: Create a bug fix branch from ``develop``:
fr: Créer une branche de correction d'anomalie à partir de ``develop`` :

source: Apply the fix and commit changes.
fr: Appliquer la correction et valider les modifications.

source: Merge the fix branch back into ``develop``:
fr: Fusionner la branche de correction de nouveau dans ``develop`` :

source: Delete the fix branch:
fr: Supprimer la branche de correction :

source: For current maintenance release (target: ``release``):
fr: Pour la version de maintenance actuelle (cible : ``release``) :

source: Create a bug fix branch from ``release``:
fr: Créer une branche de correction d'anomalie à partir de ``release`` :

source: Merge the fix branch back into ``release``:
fr: Fusionner la branche de correction de nouveau dans ``release`` :

source: Do not create a ``fix/xxx`` branch from a ``develop/feature_name`` branch. Always branch from ``develop`` or ``release`` to ensure fixes are correctly propagated.
fr: Ne pas créer une branche ``fix/xxx`` à partir d'une branche ``develop/feature_name``. Toujours créer une branche à partir de ``develop`` ou ``release`` pour garantir que les corrections sont correctement propagées.

source: Workflow for Critical Hotfixes
fr: Workflow pour les correctifs urgents

source: Create a hotfix branch from ``release`` (or ``main`` if no ``release`` branch exists):
fr: Créer une branche de correctif urgent à partir de ``release`` (ou ``main`` si aucune branche ``release`` n'existe) :

source: Merge the fix back into ``release`` (or ``main``):
fr: Fusionner la correction de nouveau dans ``release`` (ou ``main``) :

source: Cherry-pick the fix into ``develop``:
fr: Faire un cherry-pick du correctif dans ``develop`` :

source: Delete the hotfix branch:
fr: Supprimer la branche de correctif urgent :

source: Do not merge ``fix/xxx`` or ``hotfix/xxx`` directly into ``main`` without following the workflow. Ensure hotfixes are cherry-picked into ``develop`` to avoid losing fixes in future releases.
fr: Ne pas fusionner ``fix/xxx`` ou ``hotfix/xxx`` directement dans ``main`` sans suivre le workflow. Assurez-vous que les correctifs urgents ont fait l'objet de cherry-pick dans ``develop`` pour éviter de perdre des correctifs dans les futures versions.

source: Workflow for Patch Releases
fr: Workflow pour les versions correctives

source: When ready to release a patch version (e.g., 1.0.1, 1.0.2):
fr: Dès qu'une version corrective est prête à être publiée (par exemple, 1.0.1, 1.0.2) :

source: Ensure the ``release`` branch contains all desired fixes.
fr: S'assurer que la branche ``release`` contient toutes les corrections souhaitées.

source: Merge ``release`` into ``main``:
fr: Fusionner ``release`` dans ``main`` :

source: Tag the release on ``main``:
fr: Taguer la version sur ``main`` :

source: Keep the ``release`` branch for additional patches in the same minor version series.
fr: Conserver la branche ``release`` pour des correctifs supplémentaires dans la même série de versions mineures.

source: Workflow for Minor/Major Releases
fr: Workflow pour les versions mineures/majeures

source: When ready to release a new minor or major version (e.g., 1.1.0, 2.0.0):
fr: Dès qu'une nouvelle version mineure ou majeure est prête à être publiée (par exemple, 1.1.0, 2.0.0) :

source: Merge ``develop`` into ``main``:
fr: Fusionner ``develop`` dans ``main`` :

source: Delete the old ``release`` branch (if exists):
fr: Supprimer l'ancienne branche ``release`` (si elle existe) :

source: Create a new ``release`` branch from ``main`` when the first patch for 1.1.1 is needed:
fr: Créer une nouvelle branche ``release`` à partir de ``main`` lorsque le premier correctif pour 1.1.1 est nécessaire :

source: Best Practices
fr: Bonnes pratiques

source: Regularly **rebase feature branches** on ``develop`` to stay up to date:
fr: Réorganiser régulièrement les branches de fonctionnalités sur ``develop`` pour rester à jour :

source: Avoid long-lived branches to minimize merge conflicts.
fr: Éviter les branches de longue durée pour minimiser les conflits de fusion.

source: Ensure bug fixes in ``release`` or ``main`` are **always cherry-picked** to ``develop``.
fr: S'assurer que les corrections de bogues dans ``release`` ou ``main`` sont **toujours sélectionnées** dans ``develop``.

source: Clearly differentiate between ``fix/xxx`` (non-urgent fixes) and ``hotfix/xxx`` (critical production fixes).
fr: Différencier clairement entre ``fix/xxx`` (correctifs non urgents) et ``hotfix/xxx`` (correctifs critiques pour la production).

source: When creating the ``release`` branch, update CHANGELOG to indicate which version it targets (e.g., add a comment in the merge commit: "Create release branch for v1.0.x maintenance").
fr: Lors de la création de la branche ``release``, mettre à jour le CHANGELOG pour indiquer la version qu'elle cible (par exemple, ajouter un commentaire dans le commit de fusion : "Créer une branche de maintenance pour v1.0.x").

source: The ``release`` branch always represents the current maintenance line. To know which version it targets, check the most recent tag on ``main`` or the CHANGELOG.
fr: La branche ``release`` représente toujours la ligne de maintenance actuelle. Pour savoir quelle version elle cible, vérifiez le tag le plus récent sur ``main`` ou le CHANGELOG.

source: Takeaway
fr: Conclusion

source: This workflow ensures a structured yet flexible development process while keeping ``main`` stable and ``develop`` always updated with the latest changes.
fr: Ce workflow garantit un processus de développement structuré mais flexible tout en maintenant ``main`` stable et ``develop`` toujours à jour avec les dernières modifications.

source: The ``release`` branch provides a dedicated maintenance line for patch releases, allowing ``develop`` to proceed with new features without interference. This solves the problem of coordinating unreleased changes across the PlotPyStack ecosystem (DataLab, Sigima, PlotPy, guidata, PythonQwt) by providing a stable branch for CI testing during maintenance cycles.
fr: La branche ``release`` fournit une ligne de maintenance dédiée pour les versions correctives, permettant à ``develop`` de poursuivre avec de nouvelles fonctionnalités sans interférence. Cela résout le problème de la coordination des modifications non publiées à travers l'écosystème PlotPyStack (DataLab, Sigima, PlotPy, guidata, PythonQwt) en fournissant une branche stable pour les tests CI pendant les cycles de maintenance.
