Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/contributing/roadmap.po
Languages: fr

source: Roadmap
fr: Feuille de route

source: This document outlines the current and future development plans for DataLab:
fr: Ce document décrit les plans de développement actuels et futurs de DataLab :

source: It includes information about [funding sources](#funding), and [future evolution](#future-milestones).
fr: Il contient des informations sur les [sources de financement](#funding) et les [jalons futurs](#future-milestones).

source: It also provides a summary of [past milestones](#past-milestones) to give context to the project's evolution.
fr: Il fournit également un résumé des [jalons passés](#past-milestones) pour donner un contexte à l'évolution du projet.

source: 📈 Funding
fr: 📈 Financement

source: ℹ️ As an open-source project, DataLab relies on the support of various organizations and grants to fund its development and maintenance. The project's roadmap is shaped by the needs and priorities of its users, as well as the availability of resources. Funded work is prioritized and scheduled accordingly, while community contributions are welcomed and encouraged.
fr: ℹ️ En tant que projet open-source, DataLab s'appuie sur le soutien de diverses organisations et subventions pour financer son développement et sa maintenance. La feuille de route du projet est façonnée par les besoins et les priorités de ses utilisateurs, ainsi que par la disponibilité des ressources. Le travail financé est priorisé et programmé en conséquence, tandis que les contributions de la communauté sont les bienvenues et encouragées.

source: From the project’s inception in 2023, the development of DataLab has been funded by the following grants and organizations:
fr: Depuis le début du projet en 2023, le développement de DataLab a été financé par les subventions et organisations suivantes :

source: Funding
fr: Financement

source: [CEA](https://www.cea.fr/) - French Alternative Energies and Atomic Energy Commission:<br>• DataLab was initially created for analyzing data from CEA's Laser Megajoule (LMJ) facility<br>• Interfaced with the LMJ control system, DataLab is used to process and visualize signals and images acquired with plasma diagnostics (devices such as cameras, digitizers, spectrometers, etc.)<br>• It is also used for R&D activities around the LMJ facility (e.g., metrology, data analysis, etc.)<br>• CEA is the major investor in DataLab and the main contributor to the project: CEA scientists and engineers are actively involved in the roadmap
fr: [CEA](https://www.cea.fr/) - Commissariat à l'énergie atomique et aux énergies alternatives :<br>• DataLab a été initialement créé pour analyser les données de la structure Laser Mégajoule (LMJ) du CEA<br>• Interfacé avec le système de contrôle du LMJ, DataLab est utilisé pour traiter et visualiser les signaux et images acquis avec des diagnostics plasmas (appareils tels que caméras, numériseurs, spectromètres, etc.)<br>• Il est également utilisé pour des activités de R&D autour de l'installation LMJ (métrologie, analyse de données, etc.)<br>• Le CEA est le principal investisseur dans DataLab et le principal contributeur au projet : les ingénieurs du CEA participent activement à la feuille de route

source: [CODRA](https://codra.net/), a software engineering company and software publisher, has supported DataLab’s open-source journey since its inception:<br>• Open-source project management and communication (social media, website, etc.)<br>• Conferences and events: [SciPy 2024](https://cfp.scipy.org/2024/talk/G3MC9L/), [PyData Paris 2024](https://www.youtube.com/watch?v=lBEu-DeHyz0&list=PLJjbbmRgu6RqGMOhahm2iE6NUkIYIaEDK), [Open Source Experience 2024](https://pretalx.com/pydata-paris-2024/talk/WTDVCC/), etc.<br>• Documentation: tutorials, videos, and more
fr: [CODRA](https://codra.net/), société d’ingénierie en informatique et éditeur de logiciels, soutient le projet open source DataLab depuis sa création :<br>• Gestion de projet open source et communication (réseaux sociaux, site web, etc.)<br>• Conférences et événements : [SciPy 2024](https://cfp.scipy.org/2024/talk/G3MC9L/), [PyData Paris 2024](https://www.youtube.com/watch?v=lBEu-DeHyz0&list=PLJjbbmRgu6RqGMOhahm2iE6NUkIYIaEDK), [Open Source Experience 2024](https://pretalx.com/pydata-paris-2024/talk/WTDVCC/), etc.<br>• Documentation : tutoriels, vidéos, et bien plus

source: [NLnet Foundation](https://nlnet.nl/), as part of the NGI0 Commons Fund backed by the European Commission, funded the [redesign of DataLab’s core architecture](https://nlnet.nl/project/DataLab/) — a major overhaul included in the 1.0 release (November 2025):<br>• The goal was to decouple the data model, computation, and I/O from the UI<br>• This led to the creation of the [Sigima](https://sigima.readthedocs.io/en/latest/) library, which now handles data processing independently of DataLab’s GUI<br>• This redesign improves maintainability, testability, and extensibility of the codebase<br>• This also enables DataLab to be used as a library (through Sigima) in other software projects, fostering integration and reuse
fr: La [Fondation NLnet](https://nlnet.nl/), dans le cadre du NGI0 Commons Fund soutenu par la Commission européenne, a financé la [refonte de l'architecture de base de DataLab](https://nlnet.nl/project/DataLab/) - une refonte majeure intégrée à la version 1.0 (novembre 2025) :<br>• L'objectif était de découpler le modèle de données, le calcul et l'E/S de l'interface utilisateur<br>• Cela a conduit à la création de la bibliothèque [Sigima](https://sigima.readthedocs.io/fr/latest/), qui gère désormais le traitement des données indépendamment de l'interface graphique de DataLab<br>• Cette refonte améliore la maintenabilité, la testabilité et l'extensibilité de la base de code<br>• Cela permet également à DataLab d'être utilisé comme une bibliothèque (via Sigima) dans d'autres projets logiciels, favorisant l'intégration et la réutilisation

source: 🏗️ Future Milestones
fr: 🏗️ Jalons futurs

source: ℹ️ The following tasks are long-term goals for DataLab. They are not scheduled for any specific release and may evolve over time based on user needs and project direction.
fr: ℹ️ Les tâches suivantes sont des objectifs à long terme pour DataLab. Elles ne sont pas programmées pour une version spécifique et peuvent évoluer au fil du temps en fonction des besoins des utilisateurs et de l'orientation du projet.

source: The following table summarizes the future evolutions and maintenance plans for DataLab that are detailed in the sections below.
fr: Le tableau suivant résume les évolutions futures et les plans de maintenance de DataLab qui sont détaillés dans les sections ci-dessous.

source: Milestone type
fr: Type de jalon

source: 🔄 Future Evolutions
fr: 🔄 Evolutions futures

source: • Support for data acquisition<br>• Web frontend<br>• Support for time series<br>• Database connectors<br>• Jupyter plugin for interactive data analysis<br>• Spyder plugin for interactive data analysis<br>• Jupyter kernel interface for DataLab
fr: • Prise en charge de l'acquisition de données<br>• Interface Web<br>• Prise en charge des séries temporelles<br>• Connecteurs de base de données<br>• Plugin Jupyter pour l'analyse de données interactive<br>• Plugin Spyder pour l'analyse de données interactive<br>• Interface de noyau Jupyter pour DataLab

source: • Transition to gRPC for remote control<br>• Drop Qt5 support and migrate to Qt6
fr: • Passer à gRPC pour le contrôle à distance<br>• Abandonner la prise en charge de Qt5 et migrer vers Qt6

source: 🧱 Other Tasks
fr: 🧱 Autres tâches

source: • Create a DataLab plugin template
fr: • Créer un modèle de plugin DataLab

source: 🔄 Support for Data Acquisition
fr: 🔄 Prise en charge de l'acquisition de données

source: Adding support for data acquisition would be a major step forward in making DataLab not only a platform for signal and image processing, but also a **versatile tool for real-time experimental workflows**. The idea would be to allow users to acquire data directly from various hardware devices (e.g., cameras, digitizers, spectrometers, etc.) **within DataLab itself**.
fr: Ajouter la prise en charge de l'acquisition de données serait une avancée majeure pour faire de DataLab non seulement une plateforme de traitement des signaux et des images, mais aussi un **outil polyvalent pour les flux de travail expérimentaux en temps réel**. L'idée serait de permettre aux utilisateurs d'acquérir des données directement à partir de divers appareils matériels (caméras, numériseurs, spectromètres, etc.) **au sein même de DataLab**.

source: Such a feature would enable **seamless integration between acquisition and analysis**, allowing users to process and visualize data immediately after it is captured, without needing to switch tools or export/import files.
fr: Une telle fonctionnalité permettrait une **intégration transparente entre l'acquisition et l'analyse**, permettant aux utilisateurs de traiter et de visualiser les données immédiatement après leur capture, sans avoir à changer d'outil ou à exporter/importer des fichiers.

source: While no formal design has been established yet, a viable approach could be to:
fr: Bien qu'aucun travail de conception formel n'ait encore été établi, une approche viable pourrait être de :

source: Introduce a **new plugin family dedicated to data acquisition**, following the modular architecture of DataLab;
fr: Introduire une **nouvelle famille de plugins dédiée à l'acquisition de données**, suivant l'architecture modulaire de DataLab ;

source: Define a **generic API for acquisition plugins**, ensuring flexibility and compatibility across device types;
fr: Définir une **API générique pour les plugins d'acquisition**, garantissant flexibilité et compatibilité entre les types de dispositifs ;

source: **Leverage existing solutions** such as [PyMoDAQ](https://pymodaq.cnrs.fr/), a Python-based data acquisition framework already compatible with a wide range of laboratory instruments.
fr: **Tirer parti des solutions existantes** telles que [PyMoDAQ](https://pymodaq.cnrs.fr/), un cadre d'acquisition de données basé sur Python déjà compatible avec un large éventail d'instruments de laboratoire.

source: A potential **collaboration with the PyMoDAQ development team** could be explored, to benefit from their ecosystem and avoid duplicating efforts. This would also help foster interoperability and promote open standards in the Python scientific instrumentation community.
fr: Une **collaboration potentielle avec l'équipe de développement de PyMoDAQ** pourrait être envisagée, pour bénéficier de leur écosystème et éviter de dupliquer les efforts. Cela aiderait également à favoriser l'interopérabilité et à promouvoir des normes ouvertes dans la communauté d'instrumentation scientifique Python.

source: 🌐 Web Frontend
fr: 🌐 Interface Web

source: As DataLab's modular architecture evolves, a natural next step is to provide a **web-based frontend** to complement the existing desktop application.
fr: À mesure que l'architecture modulaire de DataLab évolue, une étape naturelle consiste à fournir une **interface Web** pour compléter l'application de bureau existante.

source: A web frontend would allow users to:
fr: Une interface Web permettrait aux utilisateurs de :

source: **Run DataLab remotely** (e.g. from a server) and access it via a browser;
fr: Exécuter DataLab à distance (par exemple depuis un serveur) et y accéder via un navigateur ;

source: Perform processing and visualization tasks without needing a local Python environment;
fr: Effectuer des tâches de traitement et de visualisation sans avoir besoin d'un environnement Python local ;

source: Facilitate **collaborative data analysis**, sharing sessions or results with colleagues;
fr: Faciliter l'**analyse de données collaborative**, le partage de sessions ou de résultats avec des collègues ;

source: Integrate with JupyterHub, dashboards, or lab management tools for centralized usage.
fr: Intégrer JupyterHub, des tableaux de bord ou des outils de gestion de laboratoire pour une utilisation centralisée.

source: This frontend could be built on top of the [Sigima](https://sigima.readthedocs.io/en/latest/) library (that was recently created from the externalization of DataLab's processing functionalities), exposing its features through a web interface — possibly leveraging tools like **JupyterLab extensions**, **Panel**, or **Dash**, depending on the chosen stack.
fr: Cette interface pourrait être construite sur la base de la bibliothèque [Sigima](https://sigima.readthedocs.io/fr/latest/) (qui a été récemment créée à partir de l'externalisation des fonctionnalités de traitement de DataLab), exposant ses fonctionnalités via une interface Web - en utilisant éventuellement des outils tels que **JupyterLab extensions**, **Panel** ou **Dash**, en fonction de la pile choisie.

source: While still exploratory, this direction would increase **accessibility and portability** of DataLab, especially in academic and industrial environments.
fr: Bien que toujours exploratoire, cette direction augmenterait l'**accessibilité et la portabilité** de DataLab, en particulier dans les environnements académiques et industriels.

source: ℹ️ The web frontend shall not replace the desktop application, but rather complement it by providing a different access mode. DataLab's philosophy is to remain a **local application** that does not require a server to run, ensuring data privacy and security. More precisely, the web frontend will empower users to run DataLab on a server and access it remotely - typically on a local network, but it will not be a cloud-based solution or a first step towards a fully cloud-based application which would be against the project's philosophy.
fr: ℹ️ L'interface Web ne doit pas remplacer l'application de bureau, mais plutôt la compléter en fournissant un mode d'accès différent. La philosophie de DataLab est de rester une **application locale** qui ne nécessite pas de serveur pour fonctionner, garantissant la confidentialité et la sécurité des données. Plus précisément, l'interface Web permettra aux utilisateurs d'exécuter DataLab sur un serveur et d'y accéder à distance - généralement sur un réseau local, mais ce ne sera pas une solution basée sur le cloud ou une première étape vers une application entièrement basée sur le cloud, ce qui irait à l'encontre de la philosophie du projet.

source: ⏱️ Support for Time Series
fr: ⏱️ Prise en charge des séries temporelles

source: DataLab currently focuses on generic signal and image processing, but many use cases — especially in scientific instrumentation and experimental physics — involve **time series data**.
fr: DataLab se concentre actuellement sur le traitement générique des signaux et des images, mais de nombreux cas d'utilisation - en particulier dans l'instrumentation scientifique et la physique expérimentale - impliquent des **données de séries temporelles**.

source: Adding dedicated support for time series would make it easier to:
fr: Ajouter une prise en charge dédiée des séries temporelles faciliterait :

source: Handle signals with associated timestamps or non-uniform sampling;
fr: Prendre en charge des signaux avec des horodatages associés ou un échantillonnage non uniforme ;

source: Perform time-aware processing and visualization (e.g., event alignment, time-based filtering, resampling);
fr: Effectuer un traitement et une visualisation sensibles au temps (alignement d'événements, filtrage basé sur le temps, rééchantillonnage) ;

source: Integrate with external systems generating time-indexed data.
fr: Intégrer des systèmes externes générant des données indexées dans le temps.

source: This feature is tracked in [Issue #27](https://github.com/DataLab-Platform/DataLab/issues/27), where potential use cases and design considerations are discussed.
fr: Cette fonctionnalité est tracée par l'[Issue #27](https://github.com/DataLab-Platform/DataLab/issues/27), où les cas d'utilisation potentiels et les considérations de conception sont discutés.

source: Introducing robust time series handling would broaden DataLab’s applicability in domains such as data logging, slow control, and real-time monitoring.
fr: Introduire une gestion robuste des séries temporelles élargirait l'applicabilité de DataLab dans des domaines tels que l'enregistrement de données, le contrôle lent et la surveillance en temps réel.

source: 🗃️ Database Connectors
fr: 🗃️ Connecteurs de base de données

source: Currently, DataLab operates primarily on files and in-memory data structures. Adding **connectors to databases** would significantly extend its capabilities, especially for users dealing with large, structured, or historical datasets.
fr: Actuellement, DataLab fonctionne principalement sur des fichiers et des structures de données en mémoire. L'ajout de **connecteurs aux bases de données** étendrait considérablement ses capacités, en particulier pour les utilisateurs traitant de grands ensembles de données structurées ou historiques.

source: This feature would allow DataLab to:
fr: Cette fonctionnalité permettrait à DataLab de :

source: **Query and load data** from SQL or NoSQL databases (e.g. PostgreSQL, SQLite, MongoDB, etc.);
fr: **Interroger et charger des données** à partir de bases de données SQL ou NoSQL (PostgreSQL, SQLite, MongoDB, etc.) ;

source: Support metadata-driven workflows, where experiments or datasets are referenced from a database;
fr: Prendre en charge des flux de travail pilotés par les métadonnées, où les expériences ou ensembles de données sont référencés à partir d'une base de données ;

source: **Store analysis results** or annotations back into a database for traceability and reproducibility;
fr: **Stocker les résultats d'analyse** ou les annotations dans une base de données pour la traçabilité et la reproductibilité ;

source: Facilitate integration into lab information management systems (LIMS) or enterprise data infrastructures.
fr: Faciliter l'intégration dans les systèmes de gestion de l'information de laboratoire (LIMS) ou les infrastructures de données d'entreprise.

source: The design could include:
fr: Le design pourrait inclure :

source: A **plugin-based system** for supporting various database backends;
fr: Un **système basé sur des plugins** pour prendre en charge divers backends de base de données ;

source: A simple configuration interface for connection settings and query management;
fr: Une interface de configuration simple pour les paramètres de connexion et la gestion des requêtes ;

source: Integration with pandas or SQLAlchemy for flexible data exchange.
fr: Intégration avec pandas ou SQLAlchemy pour un échange de données flexible.

source: This evolution would help bridge the gap between **data acquisition, analysis, and long-term storage**, enabling more robust scientific data workflows.
fr: Cette évolution aiderait à combler le fossé entre **l'acquisition de données, l'analyse et le stockage à long terme**, permettant des flux de travail scientifiques plus robustes.

source: 📓 Jupyter Plugin for Interactive Data Analysis
fr: 📓 Plugin Jupyter pour l'analyse de données interactive

source: Although DataLab can already be remotely controlled from a Jupyter notebook — thanks to its existing remote control capabilities (see {ref}`ref-to-remote-control`) — the user experience could be greatly enhanced by developing a **dedicated Jupyter plugin**.
fr: Bien que DataLab puisse déjà être contrôlé à distance depuis un notebook Jupyter - grâce à ses capacités de contrôle à distance existantes (voir {ref}`ref-to-remote-control`) - l'expérience utilisateur pourrait être considérablement améliorée en développant un **plugin Jupyter dédié**.

source: This plugin would provide a **tighter integration** between Jupyter and DataLab, offering the following features:
fr: Ce plugin offrirait une **intégration plus étroite** entre Jupyter et DataLab, offrant les fonctionnalités suivantes :

source: Use DataLab as a **Jupyter kernel**, enabling direct access to its processing capabilities from within a notebook;
fr: Utiliser DataLab comme un **noyau Jupyter**, permettant un accès direct à ses capacités de traitement depuis un notebook ;

source: **Display numerical results from DataLab in Jupyter**, and vice versa — for example, importing results computed in a Jupyter notebook into the DataLab interface;
fr: **Afficher les résultats numériques de DataLab dans Jupyter**, et vice versa - par exemple, importer des résultats calculés dans un notebook Jupyter dans l'interface DataLab ;

source: Allow **interactive data manipulation**: use DataLab for efficient signal and image operations, and Jupyter for custom or home-made data analysis routines;
fr: Autoriser la **manipulation interactive des données** : utiliser DataLab pour des opérations efficaces sur les signaux et les images, et Jupyter pour des routines d'analyse de données personnalisées ou faites maison ;

source: Bridge scripting and GUI workflows, making DataLab more attractive for scientific users familiar with Jupyter environments.
fr: Créer un pont entre les flux de travail de script et d'interface graphique, rendant DataLab plus attrayant pour les utilisateurs scientifiques familiers avec les environnements Jupyter.

source: Technically, this plugin could rely on the **Jupyter kernel interface** to expose DataLab's capabilities in an interactive programming context.
fr: Techniquement, ce plugin pourrait s'appuyer sur l'**interface de noyau Jupyter** pour exposer les capacités de DataLab dans un contexte de programmation interactive.

source: Such integration would reinforce DataLab’s role in the scientific Python ecosystem and facilitate reproducible, notebook-driven analysis workflows.
fr: Une telle intégration renforcerait le rôle de DataLab dans l'écosystème scientifique Python et faciliterait les flux de travail d'analyse pilotés par des notebooks reproductibles.

source: 🧩 Spyder Plugin for Interactive Data Analysis
fr: 🧩 Plugin Spyder pour l'analyse de données interactive

source: A plugin for the [Spyder IDE](https://www.spyder-ide.org/) would address the **same use cases as the Jupyter plugin**, providing seamless integration between DataLab and Spyder’s interactive environment.
fr: Un plugin pour l'[IDE Spyder](https://www.spyder-ide.org/) répondrait aux **mêmes cas d'utilisation que le plugin Jupyter**, offrant une intégration transparente entre DataLab et l'environnement interactif de Spyder.

source: This plugin would allow users to:
fr: Ce plugin permettrait aux utilisateurs de :

source: Interact with DataLab directly from Spyder;
fr: Interagir avec DataLab directement depuis Spyder ;

source: Visualize or send data between the DataLab GUI and the Spyder console;
fr: Visualiser ou envoyer des données entre l'interface DataLab et la console Spyder ;

source: Use DataLab’s processing capabilities in real time while scripting custom analysis workflows in Spyder.
fr: Utiliser les capacités de traitement de DataLab en temps réel tout en scriptant des flux de travail d'analyse personnalisés dans Spyder.

source: As with the Jupyter integration, this plugin could be implemented by leveraging the **Jupyter kernel interface** (see {ref}`ref-to-remote-control`), which Spyder already supports internally.
fr: Comme pour l'intégration Jupyter, ce plugin pourrait être mis en œuvre en s'appuyant sur l'**interface de noyau Jupyter** (voir {ref}`ref-to-remote-control`), que Spyder prend déjà en charge en interne.
