Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/contributing/roadmap.po
Languages: fr

source: Such a plugin would enhance DataLab's usability for scientists and engineers who prefer Spyder’s integrated development environment for exploratory analysis.
fr: Un tel plugin améliorerait l'utilisabilité de DataLab pour les scientifiques et les ingénieurs qui préfèrent l'environnement de développement intégré de Spyder pour l'analyse exploratoire.

source: 🧠 Jupyter Kernel Interface for DataLab
fr: 🧠 Interface de noyau Jupyter pour DataLab

source: Implementing a native **Jupyter kernel interface** for DataLab would provide a more integrated way to use it from other environments such as **Jupyter notebooks, Spyder, or Visual Studio Code**.
fr: Mettre en œuvre une interface de **noyau Jupyter** native pour DataLab fournirait un moyen plus intégré de l'utiliser à partir d'autres environnements tels que **Jupyter notebooks, Spyder ou Visual Studio Code**.

source: This interface would allow:
fr: Cette interface permettrait :

source: Direct control of DataLab from third-party tools that support Jupyter kernels;
fr: Contrôle direct de DataLab à partir d'outils tiers qui prennent en charge les noyaux Jupyter ;

source: **Two-way data exchange**: e.g., displaying DataLab results inside a notebook, or visualizing Jupyter-generated data inside the DataLab GUI;
fr: **Échange de données bidirectionnel** : par exemple, afficher les résultats de DataLab dans un notebook, ou visualiser les données générées par Jupyter dans l'interface DataLab ;

source: Tighter integration into scripting workflows and IDEs beyond simple remote control.
fr: Intégration plus étroite dans les flux de travail de script et les IDE au-delà d'un simple contrôle à distance.

source: However, based on initial exploration, implementing a full Jupyter kernel may be **non-trivial and potentially time-consuming**. Given that remote control already enables communication between DataLab and Jupyter (see {ref}`ref-to-remote-control`), the added value of a full kernel integration should be carefully evaluated against its complexity and maintenance cost.
fr: Cependant, sur la base d'explorations initiales, la mise en œuvre d'un noyau Jupyter complet peut être **non triviale et potentiellement chronophage**. Étant donné que le contrôle à distance permet déjà la communication entre DataLab et Jupyter (voir {ref}`ref-to-remote-control`), la valeur ajoutée d'une intégration complète du noyau doit être soigneusement évaluée par rapport à sa complexité et à son coût de maintenance.

source: This option remains open for discussion depending on user demand and development resources.
fr: Cette option reste ouverte à la discussion en fonction de la demande des utilisateurs et des ressources de développement.

source: 🛠️ Maintenance Plan
fr: 🛠️ Plan de maintenance

source: 🔄 2026: Transition to gRPC for Remote Control
fr: 🔄 2026 : Passer à gRPC pour le contrôle à distance

source: DataLab currently relies on XML-RPC for remote control, which may become a limitation for more advanced or high-performance use cases. If the need arises for a more **efficient, robust, and extensible communication protocol**, a switch to **gRPC** is under consideration.
fr: DataLab s'appuie actuellement sur XML-RPC pour le contrôle à distance, ce qui peut devenir une limitation pour des cas d'utilisation plus avancés ou haute performance. Si le besoin se fait sentir pour un protocole de communication plus **efficace, robuste et extensible**, un passage à **gRPC** est envisagé.

source: This improvement is tracked in [Issue #18](https://github.com/DataLab-Platform/DataLab/issues/18).
fr: Cette amélioration est tracée par l'[Issue #18](https://github.com/DataLab-Platform/DataLab/issues/18).

source: 🚫 2025: Drop Qt5 Support and Migrate to Qt6
fr: 🚫 2025 : Abandonner la prise en charge de Qt5 et migrer vers Qt6

source: With the **end-of-life of Qt5 scheduled for mid-2025**, DataLab will fully migrate to **Qt6**. This transition is expected to be **straightforward**, thanks to:
fr: Avec la **fin de vie de Qt5 prévue pour mi-2025**, DataLab migrera entièrement vers **Qt6**. Cette transition devrait être **simple**, grâce à :

source: The use of the `qtpy` abstraction layer;
fr: L'utilisation de la couche d'abstraction `qtpy` ;

source: The fact that the `PlotPyStack` library is already compatible with Qt6.
fr: La bibliothèque `PlotPyStack` est déjà compatible avec Qt6.

source: This change will ensure compatibility with future versions of Qt and modern Python environments.
fr: Ce changement garantira la compatibilité avec les futures versions de Qt et les environnements Python modernes.

source: 🧩 Create a DataLab Plugin Template
fr: 🧩 Créer un modèle de plugin DataLab

source: To encourage community contributions and facilitate the development of extensions, a **template for creating DataLab plugins** is planned.
fr: Pour encourager les contributions de la communauté et faciliter le développement d'extensions, un **modèle pour créer des plugins DataLab** est prévu.

source: This template would:
fr: Ce modèle permettrait :

source: Provide a ready-to-use scaffold with best practices;
fr: Fournir une structure prête à l'emploi avec les meilleures pratiques ;

source: Help new developers quickly understand the plugin architecture;
fr: Aider les nouveaux développeurs à comprendre rapidement l'architecture des plugins ;

source: Promote consistency and modularity across third-party plugins.
fr: Promouvoir la cohérence et la modularité entre les plugins tiers.

source: The task is tracked in [Issue #26](https://github.com/DataLab-Platform/DataLab/issues/26).
fr: Cette tâche est tracée par l'[Issue #26](https://github.com/DataLab-Platform/DataLab/issues/26).

source: 🏆 Past Milestones
fr: 🏆 Jalons passés

source: From version 0.9 to 1.0, DataLab has undergone significant development and enhancements. The project has evolved from a simple data analysis tool to a powerful platform for processing and visualizing signals and images.
fr: De la version 0.9 à 1.0, DataLab a connu un développement et des améliorations significatifs. Le projet a évolué d'un simple outil d'analyse de données à une plateforme puissante pour le traitement et la visualisation des signaux et des images.

source: Those enhancements have been made possible thanks to the support of the following organizations (see [Funding](#funding) for more details):
fr: Ces améliorations ont été rendues possibles grâce au soutien des organisations suivantes (voir [Financement](#funding) pour plus de détails) :

source: [CEA](https://www.cea.fr/): French Alternative Energies and Atomic Energy Commission
fr: [CEA](https://www.cea.fr/): Commissariat à l'énergie atomique et aux énergies alternatives

source: [CODRA](https://codra.net/en/): software engineering company and software publisher
fr: [CODRA](https://codra.net/en/): société d'ingénierie en informatique et éditeur de logiciels

source: [NLnet](https://nlnet.nl/): NLnet Foundation, as part of the NGI0 Commons Fund
fr: [NLnet](https://nlnet.nl/): Fondation NLnet, dans le cadre du NGI0 Commons Fund

source: The following table summarizes the major past milestones of DataLab, including the release dates and a brief description of the features or enhancements introduced in each version.
fr: Le tableau suivant résume les principaux jalons passés de DataLab, y compris les dates de publication et une brève description des fonctionnalités ou améliorations introduites dans chaque version.

source: Milestone
fr: Jalon

source: • Interactive object editing: modify creation/processing parameters and recompute objects<br>• New object creation: parametric signal/image generators, Poisson noise, complex-valued objects<br>• Enhanced processing: pulse features, ideal filters, 2D resampling, convolution, projections<br>• ROI & annotations: copy/paste, import/export, grid creation, inverse ROI logic<br>• Visualization: merged result labels, datetime support, performance optimizations<br>• File formats: FT-Lab (.sig, .ima), coordinated text files, improved HDF5 support<br>• Non-uniform coordinates and polynomial calibration<br>• Public API enhancements for programmability
fr: • Édition interactive des objets : modifier les paramètres de création/de traitement et recalculer les objets<br>• Nouvelle création d'objets : générateurs de signaux/images paramétriques, bruit de Poisson, objets à valeurs complexes<br>• Traitement amélioré : fonctionnalités d'impulsion, filtres idéaux, rééchantillonnage 2D, convolution, projections<br>• ROI et annotations : copier/coller, importer/exporter, création de grille, logique ROI inverse<br>• Visualisation : étiquettes de résultats fusionnées, prise en charge des dates et heures, optimisations des performances<br>• Formats de fichiers : FT-Lab (.sig, .ima), fichiers texte coordonnés, prise en charge améliorée de HDF5<br>• Coordonnées non uniformes et étalonnage polynomial<br>• Améliorations de l'API publique pour la programmabilité

source: • ANDOR SIF images: add support for background images<br>• Array editor: new copy all, export, and paste features<br>• Fourier analysis: new zero padding feature for signals and images<br>• ROI editor: ROI selection tool now active by default<br>• Signal processing: X-Y mode, abscissa/ordinate find features, full width at y=...<br>• Public API: add `group_id` and `set_current` arguments to add methods
fr: • Images ANDOR SIF : ajouter la prise en charge des images de fond<br>• Éditeur de tableau : nouvelles fonctionnalités de copie, d'exportation et de collage<br>• Analyse de Fourier : nouvelle fonctionnalité de remplissage nul pour les signaux et les images<br>• Éditeur de ROI : l'outil de sélection de ROI est désormais actif par défaut<br>• Traitement du signal : mode X-Y, fonctionnalités de recherche d'abscisse/ordonnée, largeur complète à y=...<br>• API publique : ajouter les arguments `group_id` et `set_current` aux méthodes d'ajout

source: • Open all signals or images from a folder (recursively)<br>• ROI editor: add options to create ROIs from coordinates
fr: • Ouvrir tous les signaux ou images d'un dossier (récursivement)<br>• Éditeur de ROI : ajouter des options pour créer des ROI à partir de coordonnées

source: • New pairwise operand mode (the operation is done on each pair of signals/images)<br>• New polygonal ROI feature<br>• Support Windows 7 SP1 to Windows 11 with a single installer
fr: • Nouveau mode d'opérande par paires (l'opération est effectuée sur chaque paire de signaux/images)<br>• Nouvelle fonctionnalité de ROI polygonal<br>• Prise en charge de Windows 7 SP1 à Windows 11 avec un seul installateur

source: • Introduce ROI support across all processing features<br>• Add arithmetic operations on signals and images<br>• New Ubuntu package for native installation on Linux<br>• New Conda package for all platforms (Windows, Linux, MacOS)
fr: • Introduire la prise en charge des ROI dans toutes les fonctionnalités de traitement<br>• Ajouter des opérations arithmétiques sur les signaux et les images<br>• Nouveau package Ubuntu pour une installation native sur Linux<br>• Nouveau package Conda pour toutes les plateformes (Windows, Linux, MacOS)

source: • New validation process for signal and image features<br>• Add support for binary images (unlocking new processing features)
fr: • Nouveau processus de validation pour les fonctionnalités de signal et d'image<br>• Ajouter la prise en charge des images binaires (déverrouillage de nouvelles fonctionnalités de traitement)

source: • New MSI installer for the stand-alone version on Windows<br>• Add support for large text/CSV files (> 1 GB)<br>• Add auto downsampling feature
fr: • Nouvel installateur MSI pour la version autonome sur Windows<br>• Ajouter la prise en charge de fichiers texte/CSV volumineux (> 1 Go)<br>• Ajouter une fonctionnalité de sous-échantillonnage automatique

source: • HDF5 browser: multiple file support, detailed info on groups and attributes<br>• New Debian package for native installation on Linux
fr: • Navigateur HDF5 : prise en charge de plusieurs fichiers, informations détaillées sur les groupes et les attributs<br>• Nouveau package Debian pour une installation native sur Linux

source: • Add a tour and demo feature<br>• Add tutorials to the documentation<br>• Add a Text file import assistant
fr: • Ajouter une visite et une fonctionnalité de démonstration<br>• Ajouter des tutoriels à la documentation<br>• Ajouter un assistant d'importation de fichiers texte

source: • Add features for reordering signals and images (e.g. drag-and-drop)<br>• Add 1D convolution, interpolation, resampling and detrending features
fr: • Ajouter des fonctionnalités pour réorganiser les signaux et les images (par exemple, glisser-déposer)<br>• Ajouter des fonctionnalités de convolution 1D, d'interpolation, de rééchantillonnage et de désajustement

source: • Develop a very simple DataLab plugin to demonstrate the plugin system<br>• Allow to disable the automatic refresh when doing multiple processing steps<br>• Serialize curve and image styles in HDF5 files<br>• Improve curve readability
fr: • Développer un plugin DataLab très simple pour démontrer le système de plugins<br>• Permettre de désactiver le rafraîchissement automatique lors de plusieurs étapes de traitement<br>• Sérialiser les styles de courbe et d'image dans des fichiers HDF5<br>• Améliorer la lisibilité des courbes

source: • Run computations in a separate process<br>• Add a plugin system: API for third-party extensions<br>• Add a macro-command system<br>• Add an XML-RPC server to allow DataLab remote control
fr: • Exécuter des calculs dans un processus séparé<br>• Ajouter un système de plugin : API pour les extensions tierces<br>• Ajouter un système de macro-commande<br>• Ajouter un serveur XML-RPC pour permettre le contrôle à distance de DataLab
