Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: Avoids ambiguity in cross-panel operations
fr: Évite l'ambiguïté dans les opérations inter-panneaux

source: Fixed group numbering for new groups
fr: Numérotation de groupe fixe pour les nouveaux groupes

source: **Configuration:**
fr: Réinitialisation de la configuration de DataLab :

source: **Version-specific folders**: Major version coexistence (`.DataLab_v1`, `.DataLab_v2`, etc.)
fr: **Dossiers spécifiques à la version** : Coexistence des versions majeures (`.DataLab_v1`, `.DataLab_v2`, etc.)

source: Allows v0.x and v1.x to run simultaneously
fr: Permet à v0.x et v1.x de s'exécuter simultanément

source: **Public API & Remote Control:**
fr: API publique (locale ou distante) :

source: Enhanced metadata handling with function name context
fr: **Amélioration de la gestion des métadonnées en ajoutant le contexte du nom de la fonction aux résultats** :

source: `add_group`, `add_signal`, `add_image` methods with `group_id` and `set_current` arguments
fr: Méthodes `add_group`, `add_signal`, `add_image` avec arguments `group_id` et `set_current`

source: `get_object_uuids` with optional `group` filter
fr: `get_object_uuids` avec filtre `group` optionnel

source: Multiple API improvements for better programmability
fr: Plusieurs améliorations de l'API pour une meilleure programmabilité

source: **Processing infrastructure (for developers):**
fr: **Infrastructure de traitement (pour les développeurs) :**

source: New `@computation_function` decorator for computation functions
fr: Ajout d'un nouveau décorateur `@computation_function` pour marquer et enregistrer les fonctions de calcul

source: Renamed computation functions (removed "compute_" prefix)
fr: Renommé les fonctions de calcul pour supprimer le préfixe redondant "compute_" (par exemple, `compute_fft` ➝ `fft`)

source: Refactored `BaseProcessor` methods with clear naming:
fr: Méthodes `BaseProcessor` refactorisées avec des noms clairs :

source: **No backward compatibility maintained** for these internal changes (closes [Issue #180](https://github.com/DataLab-Platform/DataLab/issues/180))
fr: **Aucune compatibilité ascendante n'est maintenue** pour ces modifications internes (ceci clôture [Issue #180](https://github.com/DataLab-Platform/DataLab/issues/180))

source: 🛠️ Bug Fixes since version 0.20
fr: 🛠️ Correctifs depuis la version 0.20

source: **Performance fixes:**
fr: **Corrections de performances :**

source: **Switching between images with many results**: Dramatic improvement (66s → <1ms) when navigating images with hundreds of shapes
fr: **Passage entre images avec de nombreux résultats** : Amélioration spectaculaire (66s → <1ms) lors de la navigation entre des images avec des centaines de formes

source: **Plot cleanup robustness**: Fixed errors when removing analysis results
fr: **Robustesse du nettoyage des graphiques** : Correction d'erreurs occasionnelles lors de la suppression des résultats d'analyse des graphiques

source: **Critical fix**: Result labels now properly excluded from cleanup to prevent disappearance
fr: **Correction critique** : Les éléments d'étiquette de résultat sont désormais correctement exclus du nettoyage pour éviter une suppression accidentelle

source: **Cross-panel & group handling:**
fr: **Gestion inter-panneaux et des groupes :**

source: **Cross-panel computation groups**: Fixed inconsistent group organization for image-to-signal operations
fr: **Groupes de calculs inter-panneaux** : Correction de l'organisation incohérente des groupes pour les opérations image vers signal

source: **File import ordering**: Consistent alphabetical sorting across all platforms
fr: **Ordre d'importation des fichiers** : Correction de l'ordre incohérent des fichiers entre les plateformes lors de l'importation d'images/signaux

source: **Action state updates:**
fr: **Mises à jour de l'état des actions :**

source: Fixed action enable states not updating after annotation/metadata operations
fr: Correction des états d'activation des actions ne se mettant pas à jour après les opérations d'annotation/métadonnées

source: UI now immediately reflects current object state
fr: L'interface utilisateur reflète désormais immédiatement l'état actuel de l'objet

source: **Result management:**
fr: **Gestion des résultats :**

source: Fixed result label deletion to permanently remove associated metadata
fr: Correction de la suppression des étiquettes de résultats pour supprimer définitivement les métadonnées associées

source: Fixed duplicate results parameter metadata cleanup
fr: Correction du nettoyage des métadonnées de paramètres de résultats en double

source: **Result coordinate fixes**: Corrected shifted results on images with ROIs and shifted origin ([Issue #106](https://github.com/DataLab-Platform/DataLab/issues/106))
fr: **Corrections des coordonnées des résultats** : Correction des résultats décalés sur les images avec des ROI et une origine décalée ([Issue #106](https://github.com/DataLab-Platform/DataLab/issues/106))

source: **Profile extraction indices**: Fixed wrong indices with ROI ([Issue #107](https://github.com/DataLab-Platform/DataLab/issues/107))
fr: **Indices d'extraction de profil** : Correction des indices erronés avec ROI ([Issue #107](https://github.com/DataLab-Platform/DataLab/issues/107))

source: **ROI-related fixes:**
fr: **Corrections liées aux ROI :**

source: Fixed multi-image ROI extraction not saving ROI in first object ([Issue #120](https://github.com/DataLab-Platform/DataLab/issues/120))
fr: Correction de l'extraction de ROI multi-image ne sauvegardant pas la ROI dans le premier objet ([Issue #120](https://github.com/DataLab-Platform/DataLab/issues/120))

source: Fixed AttributeError when extracting multiple ROIs on single image with multiple selections ([Issue #121](https://github.com/DataLab-Platform/DataLab/issues/121))
fr: Correction de l'AttributeError lors de l'extraction de plusieurs ROI sur une seule image avec plusieurs sélections ([Issue #121](https://github.com/DataLab-Platform/DataLab/issues/121))

source: Fixed mask refresh issues ([Issue #122](https://github.com/DataLab-Platform/DataLab/issues/122), [Issue #123](https://github.com/DataLab-Platform/DataLab/issues/123))
fr: Correction des problèmes de rafraîchissement du masque ([Issue #122](https://github.com/DataLab-Platform/DataLab/issues/122), [Issue #123](https://github.com/DataLab-Platform/DataLab/issues/123))

source: Fixed ROI editor on multiple signals/images ([Issue #135](https://github.com/DataLab-Platform/DataLab/issues/135))
fr: Correction de l'éditeur de ROI sur plusieurs signaux/images ([Issue #135](https://github.com/DataLab-Platform/DataLab/issues/135))

source: Fixed ROI clearing affecting only first image ([Issue #160](https://github.com/DataLab-Platform/DataLab/issues/160))
fr: Correction de l'effacement des ROI n'affectant que la première image ([Issue #160](https://github.com/DataLab-Platform/DataLab/issues/160))

source: Fixed ROI editor showing first instead of last image ([Issue #158](https://github.com/DataLab-Platform/DataLab/issues/158))
fr: Correction de l'éditeur de ROI affichant la première au lieu de la dernière image ([Issue #158](https://github.com/DataLab-Platform/DataLab/issues/158))

source: **Text Import Wizard:**
fr: **Assistant d'importation de texte :**

source: Fixed preservation of user-defined titles and units ([Issue #239](https://github.com/DataLab-Platform/DataLab/issues/239))
fr: Correction de la préservation des titres et unités définis par l'utilisateur ([Issue #239](https://github.com/DataLab-Platform/DataLab/issues/239))

source: Fixed preservation of data types ([Issue #240](https://github.com/DataLab-Platform/DataLab/issues/240))
fr: Correction de la préservation des types de données ([Issue #240](https://github.com/DataLab-Platform/DataLab/issues/240))

source: Fixed comma decimal separator support ([Issue #186](https://github.com/DataLab-Platform/DataLab/issues/186))
fr: Correction de la prise en charge du séparateur décimal virgule ([Issue #186](https://github.com/DataLab-Platform/DataLab/issues/186))

source: Fixed trailing delimiter issue ([Issue #238](https://github.com/DataLab-Platform/DataLab/issues/238))
fr: Correction du problème de délimiteur final ([Issue #238](https://github.com/DataLab-Platform/DataLab/issues/238))

source: **Curve fitting & analysis:**
fr: **Ajustement amélioré pour tous les types de courbes** :

source: Improved initial frequency estimate for sinusoidal fitting
fr: Amélioration de l'estimation initiale de la fréquence pour l'ajustement de courbe sinusoïdale.

source: Fixed parameter display formatting for extreme values
fr: Correction du formatage d'affichage des paramètres pour les valeurs extrêmes

source: Fixed FWHM computation exception handling
fr: Correction de la gestion des exceptions de calcul FWHM

source: Fixed curve marker style changing unexpectedly ([Issue #184](https://github.com/DataLab-Platform/DataLab/issues/184))
fr: Correction du changement inattendu du style de marqueur de courbe ([Issue #184](https://github.com/DataLab-Platform/DataLab/issues/184))

source: Fixed hard crash on zero signal with curve stats tool ([Issue #233](https://github.com/DataLab-Platform/DataLab/issues/233))
fr: Correction du plantage brutal sur un signal nul avec l'outil de statistiques de courbe ([Issue #233](https://github.com/DataLab-Platform/DataLab/issues/233))

source: **Image handling:**
fr: **Gestion des images :**

source: Fixed aspect ratio not updating when switching images
fr: Correction du rapport d'aspect ne se mettant pas à jour lors du changement d'images

source: Fixed shape unpacking issues ([Issue #246](https://github.com/DataLab-Platform/DataLab/issues/246), [Issue #247](https://github.com/DataLab-Platform/DataLab/issues/247))
fr: Correction des problèmes de dépaquetage des formes ([Issue #246](https://github.com/DataLab-Platform/DataLab/issues/246), [Issue #247](https://github.com/DataLab-Platform/DataLab/issues/247))

source: Fixed colormaps not stored in metadata (PlotPy v2.6.3+ issue) ([Issue #138](https://github.com/DataLab-Platform/DataLab/issues/138))
fr: Correction des colormaps non stockées dans les métadonnées (problème PlotPy v2.6.3+) ([Issue #138](https://github.com/DataLab-Platform/DataLab/issues/138))

source: Fixed amplitude calculation for non-integer data types
fr: Correction du calcul de l'amplitude pour les types de données non entiers

source: Fixed ifft1d x-axis computation when shift=False ([Issue #241](https://github.com/DataLab-Platform/DataLab/issues/241))
fr: Correction du calcul de l'axe x pour ifft1d lorsque shift=False ([Issue #241](https://github.com/DataLab-Platform/DataLab/issues/241))

source: Fixed moving median crash on Linux with mirror mode ([Issue #117](https://github.com/DataLab-Platform/DataLab/issues/117)) - SciPy bug
fr: Correction du plantage du médian mobile sur Linux avec le mode miroir ([Issue #117](https://github.com/DataLab-Platform/DataLab/issues/117)) - bug SciPy

source: Fixed magnitude spectrum with logarithmic scale ([Issue #169](https://github.com/DataLab-Platform/DataLab/issues/169))
fr: Correction du spectre de magnitude avec échelle logarithmique ([Issue #169](https://github.com/DataLab-Platform/DataLab/issues/169))

source: Fixed pairwise operation mode for asymmetric functions ([Issue #157](https://github.com/DataLab-Platform/DataLab/issues/157))
fr: Correction du mode d'opération par paires pour les fonctions asymétriques ([Issue #157](https://github.com/DataLab-Platform/DataLab/issues/157))

source: **Analysis & results:**
fr: **Analyse et résultats :**

source: Fixed NaN value handling in statistics and normalization ([Issue #141](https://github.com/DataLab-Platform/DataLab/issues/141), [Issue #152](https://github.com/DataLab-Platform/DataLab/issues/152), [Issue #153](https://github.com/DataLab-Platform/DataLab/issues/153))
fr: Correction de la gestion des valeurs NaN dans les statistiques et la normalisation ([Issue #141](https://github.com/DataLab-Platform/DataLab/issues/141), [Issue #152](https://github.com/DataLab-Platform/DataLab/issues/152), [Issue #153](https://github.com/DataLab-Platform/DataLab/issues/153))

source: Fixed analysis results kept from original after processing ([Issue #136](https://github.com/DataLab-Platform/DataLab/issues/136))
fr: Correction des résultats d'analyse conservés de l'original après le traitement ([Issue #136](https://github.com/DataLab-Platform/DataLab/issues/136))

source: Fixed duplicate results with no ROI defined
fr: Correction des résultats en double lorsqu'aucune ROI n'est définie

source: Fixed "One curve per result title" mode ignoring ROIs ([Issue #132](https://github.com/DataLab-Platform/DataLab/issues/132))
fr: Correction du mode "Une courbe par titre de résultat" ignorant les ROI ([Issue #132](https://github.com/DataLab-Platform/DataLab/issues/132))

source: Added result validation for array-like results
fr: Ajout de la validation des résultats pour les résultats de type tableau

source: **Plot & visualization:**
fr: **Graphique et visualisation :**

source: Fixed profile plots not refreshing when moving/resizing ([Issue #172](https://github.com/DataLab-Platform/DataLab/issues/172)) - PlotPy fix
fr: Correction des tracés de profils ne se rafraîchissant pas lors du déplacement/redimensionnement ([Issue #172](https://github.com/DataLab-Platform/DataLab/issues/172)) - correction PlotPy

source: Fixed empty average profile display outside image area ([Issue #168](https://github.com/DataLab-Platform/DataLab/issues/168)) - PlotPy fix
fr: Correction de l'affichage du profil moyen vide en dehors de la zone de l'image ([Issue #168](https://github.com/DataLab-Platform/DataLab/issues/168)) - correction PlotPy

source: Fixed average profile extraction ValueError with oversized rectangle ([Issue #144](https://github.com/DataLab-Platform/DataLab/issues/144))
fr: Correction de la ValueError d'extraction de profil moyen avec un rectangle surdimensionné ([Issue #144](https://github.com/DataLab-Platform/DataLab/issues/144))

source: Disabled generic "Axes" tab in parameter dialogs
fr: Désactivation de l'onglet générique "Axes" dans les boîtes de dialogue des paramètres

source: **Other fixes:**
fr: **Autres corrections :**

source: Fixed proxy `add_object` method not supporting metadata ([Issue #111](https://github.com/DataLab-Platform/DataLab/issues/111))
fr: Correction de la méthode proxy `add_object` ne prenant pas en charge les métadonnées ([Issue #111](https://github.com/DataLab-Platform/DataLab/issues/111))

source: Fixed RemoteClient method calls without optional arguments ([Issue #113](https://github.com/DataLab-Platform/DataLab/issues/113))
fr: Correction des appels de méthode RemoteClient sans arguments optionnels ([Issue #113](https://github.com/DataLab-Platform/DataLab/issues/113))

source: Fixed KeyError when removing group after opening HDF5 ([Issue #116](https://github.com/DataLab-Platform/DataLab/issues/116))
fr: Correction du KeyError lors de la suppression d'un groupe après l'ouverture d'un HDF5 ([Issue #116](https://github.com/DataLab-Platform/DataLab/issues/116))

source: Fixed KeyError in "View in new window" with multiple images after HDF5 open ([Issue #159](https://github.com/DataLab-Platform/DataLab/issues/159))
fr: Correction du KeyError dans "Afficher dans une nouvelle fenêtre" avec plusieurs images après l'ouverture d'un HDF5 ([Issue #159](https://github.com/DataLab-Platform/DataLab/issues/159))

source: Fixed long object titles display ([Issue #128](https://github.com/DataLab-Platform/DataLab/issues/128))
fr: Correction de l'affichage des titres d'objets longs ([Issue #128](https://github.com/DataLab-Platform/DataLab/issues/128))

source: Fixed file name titles showing relative paths ([Issue #165](https://github.com/DataLab-Platform/DataLab/issues/165))
fr: Correction des titres de noms de fichiers affichant des chemins relatifs ([Issue #165](https://github.com/DataLab-Platform/DataLab/issues/165))

source: Fixed unexpected group names in "Open from directory" ([Issue #177](https://github.com/DataLab-Platform/DataLab/issues/177))
fr: Correction des noms de groupe inattendus dans "Ouvrir depuis un répertoire" ([Issue #177](https://github.com/DataLab-Platform/DataLab/issues/177))

source: Fixed one group per folder expectation ([Issue #163](https://github.com/DataLab-Platform/DataLab/issues/163))
fr: Correction de l'attente d'un groupe par dossier ([Issue #163](https://github.com/DataLab-Platform/DataLab/issues/163))

source: Fixed unsupported files in recursive loading ([Issue #164](https://github.com/DataLab-Platform/DataLab/issues/164))
fr: Correction des fichiers non pris en charge dans le chargement récursif ([Issue #164](https://github.com/DataLab-Platform/DataLab/issues/164))

source: **Removed features:**
fr: **Fonctionnalités supprimées :**

source: Removed "Use reference image LUT range" setting (confusing behavior)
fr: Suppression de l'option "Utiliser la plage de LUT de l'image de référence" :

source: **Migration**: Use multi-selection property editing instead
fr: **Stratégie de migration** : Utilisez plutôt le nouvel éditeur de propriétés de sélection multiple :

source: 🔒 Security Fixes
fr: 🔒 Corrections de sécurité :

source: **CVE-2023-4863**: Fixed vulnerability in opencv-python-headless
fr: **Correction de vulnérabilité de dépendance** : Correction de la vulnérabilité CVE-2023-4863 dans opencv-python-headless

source: Updated minimum requirement from 4.5.4.60 to 4.8.1.78
fr: Mise à jour de l'exigence minimale de 4.5.4.60 à 4.8.1.78

source: See [DataLab security advisory](https://github.com/DataLab-Platform/DataLab/security/dependabot/1)
fr: Voir l'[avis de sécurité DataLab](https://github.com/DataLab-Platform/DataLab/security/dependabot/1) pour plus de détails.

source: ℹ️ Other Changes
fr: ℹ️ Autres changements :

source: Bumped minimum `plotpy` requirement to V2.8
fr: Dépendance `plotpy` mise à jour vers V2.8.0

source: Bumped minimum `guidata` requirement to V3.13
fr: Dépendance `guidata` mise à jour vers V3.13.0

source: Using new `guidata` translation utility based on `babel`
fr: Utilisation du nouvel utilitaire de traduction `guidata` basé sur `babel`

source: Python 3.13 now supported (via scikit-image V0.25)
fr: Python 3.13 désormais pris en charge (via scikit-image V0.25)
