Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: Also removed the filled area that was obscuring the underlying signal data - markers now show only the boundary lines indicating the measured region
fr: Suppression également de la zone remplie qui obscurcissait les données de signal sous-jacentes - les marqueurs affichent désormais uniquement les lignes de délimitation indiquant la région mesurée

source: DataLab Version 1.0.2 (2025-12-03)
fr: DataLab Version 1.0.2 (03/12/2025)

source: 🛠️ Bug Fixes since version 1.0.1
fr: 🛠️ Correctifs depuis la version 1.0.1

source: **Signal axis calibration - Replace X by other signal's Y:**
fr: **Calibration de l'axe des signaux - Remplacer X par le Y d'un autre signal :**

source: Added new "Replace X by other signal's Y" operation in Processing > Axis transformation menu for signal calibration workflows
fr: Ajout de la nouvelle opération "Remplacer X par le Y d'un autre signal" dans le menu Traitement > Transformation d'axe pour les flux de travail de calibration des signaux

source: Addresses critical missing functionality reported by users who needed to apply wavelength calibration or similar transformations to spectroscopy data
fr: Répond à une fonctionnalité critique manquante signalée par les utilisateurs qui avaient besoin d'appliquer une calibration en longueur d'onde ou des transformations similaires aux données de spectroscopie

source: The operation combines two signals: uses Y values from one signal as the new X coordinates for another signal's Y values
fr: L'opération combine deux signaux : elle utilise les valeurs Y d'un signal comme nouvelles coordonnées X pour les valeurs Y d'un autre signal

source: Unlike X-Y mode (which resamples and interpolates), this operation directly uses Y arrays without interpolation, preserving exact calibration values
fr: Contrairement au mode X-Y (qui rééchantillonne et interpole), cette opération utilise directement les tableaux Y sans interpolation, préservant ainsi les valeurs de calibration exactes

source: Requires both signals to have the same number of points - raises clear error message if sizes don't match
fr: Nécessite que les deux signaux aient le même nombre de points - affiche un message d'erreur clair si les tailles ne correspondent pas

source: Automatically transfers metadata: X axis label/unit taken from calibration signal's Y label/unit
fr: Transfert automatique des métadonnées : l'étiquette/unité de l'axe X est prise à partir de l'étiquette/unité Y du signal de calibration

source: Menu location: Processing > Axis transformation > "Replace X by other signal's Y"
fr: Emplacement dans le menu : Traitement > Transformation d'axe > "Remplacer X par le Y d'un autre signal"

source: This closes [Issue #273](https://github.com/datalab-platform/datalab/issues/273) - Missing signal axis calibration: no way to replace X with Y from another signal
fr: Ceci clôture [Issue #273](https://github.com/datalab-platform/datalab/issues/273) - Calibration de l'axe des signaux manquante : aucun moyen de remplacer X par Y d'un autre signal

source: **X-Y mode:**
fr: **Mode X-Y :**

source: The X-Y mode processing operation for signals has been moved to Processing > Axis transformation > "X-Y mode" for better discoverability
fr: Le traitement Mode X-Y pour les signaux a été déplacé vers Traitement > Transformation des axes > "Mode X-Y" pour une meilleure découvrabilité

source: The nuance between X-Y mode (which resamples/interpolates) and the new "Replace X by other signal's Y" operation has been clarified in documentation
fr: La nuance entre le mode X-Y (qui rééchantillonne/interpole) et la nouvelle opération "Remplacer X par le Y d'un autre signal" a été clarifiée dans la documentation

source: **Lock LUT setting persistence:**
fr: **Persistance du paramètre de verrouillage de la LUT :**

source: Fixed "Lock LUT range when updating data" setting not persisting in Settings > Visualization > Images > Default Image visualization settings
fr: Correction du paramètre "Verrouiller la LUT lors de la mise à jour des données" ne persistant pas dans Paramètres > Visualisation > Images > Paramètres de visualisation d'image par défaut

source: The `keep_lut_range` parameter was not being saved to configuration, causing the checkbox to systematically uncheck itself after validation (added missing `ima_def_keep_lut_range` option in configuration)
fr: Le paramètre `keep_lut_range` n'était pas enregistré dans la configuration, ce qui faisait que la case à cocher se décochait systématiquement après validation (ajout de l'option manquante `ima_def_keep_lut_range` dans la configuration)

source: This closes [Issue #270](https://github.com/datalab-platform/datalab/issues/270) - Lock LUT setting not persisting in image visualization defaults
fr: Ceci clôture [Issue #270](https://github.com/datalab-platform/datalab/issues/270) - Persistance du paramètre de verrouillage de la LUT dans les paramètres de visualisation d'image par défaut

source: **Custom signal creation:**
fr: **Création de signaux personnalisés :**

source: Fixed `AttributeError: 'NoneType' object has no attribute 'T'` error when creating a custom signal from the menu
fr: Correction de l'erreur `AttributeError: 'NoneType' object has no attribute 'T'` lors de la création d'un signal personnalisé à partir du menu

source: This closes [Issue #269](https://github.com/datalab-platform/datalab/issues/269) - Custom Signal Creation: `AttributeError` when creating signal from menu
fr: Ceci clôture [Issue #269](https://github.com/datalab-platform/datalab/issues/269) - Création de signaux personnalisés : `AttributeError` lors de la création d'un signal à partir du menu

source: Fixed `UnicodeEncodeError` when executing macros that print Unicode characters (e.g., arrows `→`) on Windows systems with certain locales, e.g. cp1252 (closes [Issue #263](https://github.com/datalab-platform/datalab/issues/263))
fr: Correction de l'erreur `UnicodeEncodeError` lors de l'exécution de macros qui impriment des caractères Unicode (par exemple, des flèches `→`) sur les systèmes Windows avec certaines locales, par exemple cp1252 (ceci clôture [Issue #263](https://github.com/datalab-platform/datalab/issues/263))

source: The macro subprocess now automatically uses UTF-8 encoding for stdout and stderr, eliminating the need to manually add `sys.stdout.reconfigure(encoding='utf-8')` at the beginning of each macro.
fr: Le sous-processus de la macro utilise désormais automatiquement l'encodage UTF-8 pour stdout et stderr, éliminant ainsi la nécessité d'ajouter manuellement `sys.stdout.reconfigure(encoding='utf-8')` au début de chaque macro.

source: **ROI coordinate precision:**
fr: **Prise en charge des coordonnées non uniformes :**

source: ROI coordinates are now automatically rounded to appropriate precision when defining ROIs interactively from geometrical shapes, avoiding excessive decimal places while maintaining reasonable precision relative to data sampling (1/10th of sampling period for signals, 1/10th of pixel spacing for images)
fr: Les coordonnées des ROI sont désormais automatiquement arrondies à une précision appropriée lors de la définition interactive des ROI à partir de formes géométriques, évitant ainsi des décimales excessives tout en maintenant une précision raisonnable par rapport à l'échantillonnage des données (1/10e de la période d'échantillonnage pour les signaux, 1/10e de l'espacement des pixels pour les images)

source: ROI coordinates are also rounded when displaying them in the "Edit numerically" dialog, preventing floating-point arithmetic errors from showing excessive decimal places (e.g., 172.29999999999995 is now displayed as 172.3)
fr: Les coordonnées des ROI sont également arrondies lors de leur affichage dans la boîte de dialogue "Éditer numériquement", empêchant les erreurs d'arithmétique en virgule flottante d'afficher des décimales excessives (par exemple, 172.29999999999995 est désormais affiché sous forme de 172.3)

source: This closes [Issue #266](https://github.com/datalab-platform/datalab/issues/266) - Excessive decimal places in ROI coordinates
fr: Ceci clôture [Issue #266](https://github.com/datalab-platform/datalab/issues/266) - Décimales excessives dans les coordonnées des ROI

source: **Polygonal ROI handling:**
fr: **Gestion des ROI polygonales :**

source: Fixed `ValueError: Buffer has wrong number of dimensions` error when creating masks from polygonal ROIs in the ROI editor
fr: Correction de l'erreur `ValueError: Buffer has wrong number of dimensions` lors de la création de masques à partir de ROI polygonales dans l'éditeur de ROI

source: The PolygonalTool was incorrectly initializing ROI coordinates as a nested list instead of a flat list, causing mask computation to fail
fr: Le PolygonalTool initialisait incorrectement les coordonnées des ROI sous forme de liste imbriquée au lieu d'une liste plate, ce qui provoquait l'échec du calcul du masque

source: **HDF5 file opening dialog:**
fr: **Boîte de dialogue d'ouverture de fichiers HDF5 :**

source: Fixed bug where user's choice in the "clear workspace" confirmation dialog was ignored when opening HDF5 files
fr: Correction du bug où le choix de l'utilisateur dans la boîte de dialogue de confirmation "effacer l'espace de travail" était ignoré lors de l'ouverture de fichiers HDF5

source: When the user clicked "No" in the dialog, the default configuration setting was applied instead of respecting the user's choice
fr: Lorsque l'utilisateur cliquait sur "Non" dans la boîte de dialogue, le paramètre de configuration par défaut était appliqué au lieu de respecter le choix de l'utilisateur

source: This closes [Issue #267](https://github.com/datalab-platform/datalab/issues/267) - HDF5 file opening dialog ignores user's choice
fr: Ceci clôture [Issue #267](https://github.com/datalab-platform/datalab/issues/267) - La boîte de dialogue d'ouverture de fichiers HDF5 ignore le choix de l'utilisateur

source: **Creation tab axis update:**
fr: **Mise à jour de l'axe dans l'onglet Création :**

source: Fixed plot not updating when modifying only xmin/xmax parameters for distribution signals (Zero, Normal, Poisson, Uniform) in the Creation tab
fr: Correction du graphique ne se mettant pas à jour lors de la modification uniquement des paramètres xmin/xmax pour les signaux de distribution (Zéro, Normal, Poisson, Uniforme) dans l'onglet Création

source: The issue occurred because the data hash calculation only considered Y values, so changes to X axis bounds were not detected
fr: Le problème est survenu parce que le calcul du hash des données ne prenait en compte que les valeurs Y, de sorte que les modifications des limites de l'axe X n'étaient pas détectées

source: Plot now properly refreshes when any axis parameter changes, even if Y values remain identical
fr: Le graphique se rafraîchit désormais correctement lorsque n'importe quel paramètre d'axe change, même si les valeurs Y restent identiques

source: This closes [Issue #268](https://github.com/datalab-platform/datalab/issues/268) - Creation tab axis not updating for distribution signals
fr: Ceci clôture [Issue #268](https://github.com/datalab-platform/datalab/issues/268) - L'axe de l'onglet Création ne se met pas à jour pour les signaux de distribution

source: **ROI statistics with out-of-bounds ROI:**
fr: **Statistiques ROI avec ROI hors limites :**

source: Fixed `ValueError: zero-size array to reduction operation minimum which has no identity` error when computing statistics on images with ROI extending beyond canvas boundaries
fr: Correction de l'erreur `ValueError: zero-size array to reduction operation minimum which has no identity` lors du calcul des statistiques sur des images avec ROI s'étendant au-delà des limites de la zone de dessin

source: The issue occurred when a ROI partially or completely extended outside the image bounds, resulting in empty array slices during statistics computation
fr: Le problème est survenu lorsqu'un ROI s'étendait partiellement ou complètement en dehors des limites de l'image, ce qui entraînait des tranches de tableau vides lors du calcul des statistiques

source: ROI bounding boxes are now properly clipped to image boundaries, and fully out-of-bounds ROIs return NaN statistics values
fr: Les boîtes englobantes des ROI sont désormais correctement limitées aux limites de l'image, et les ROI complètement hors limites renvoient des valeurs statistiques NaN

source: This fix is implemented in Sigima library (see [Issue #1](https://github.com/DataLab-Platform/Sigima/issues/1) - `ValueError` when computing statistics on ROI extending beyond image boundaries)
fr: Cette correction est implémentée dans la bibliothèque Sigima (voir [Issue #1](https://github.com/DataLab-Platform/Sigima/issues/1) - `ValueError` lors du calcul des statistiques sur ROI s'étendant au-delà des limites de l'image)

source: **Object property panel tab selection:**
fr: **Sélection des onglets du panneau des propriétés des objets :**

source: Fixed tab selection behavior in object properties panel to be more predictable and user-friendly
fr: Correction du comportement de sélection des onglets dans le panneau des propriétés des objets pour le rendre plus prévisible et convivial

source: Properties tab is now always shown by default when switching between objects, providing consistent navigation
fr: L'onglet Propriétés est désormais toujours affiché par défaut lors du changement d'objet, offrant une navigation cohérente

source: Creation, Processing, and Analysis tabs now appear automatically only once after their respective triggering events (object creation, 1-to-1 processing, or analysis computation), then revert to Properties tab for subsequent selections
fr: Les onglets Création, Traitement et Analyse apparaissent désormais automatiquement une seule fois après leurs événements déclencheurs respectifs (création d'objet, traitement 1-vers-1 ou calcul d'analyse), puis reviennent à l'onglet Propriétés pour les sélections ultérieures

source: This eliminates the confusing behavior where the tab would arbitrarily persist or change based on previous selections
fr: Cela élimine le comportement déroutant où l'onglet persistait ou changeait arbitrairement en fonction des sélections précédentes

source: This closes [Issue #271](https://github.com/datalab-platform/datalab/issues/271) - Improve object property panel tab selection behavior
fr: Ceci clôture [Issue #271](https://github.com/datalab-platform/datalab/issues/271) - Amélioration du comportement de sélection des onglets du panneau des propriétés des objets

source: DataLab Version 1.0.1 (2025-11-18)
fr: DataLab Version 1.0.1 (18/11/2025)

source: This major release represents a significant milestone for DataLab with numerous enhancements across all areas. The changes are organized by category for easier navigation.
fr: Cette version majeure représente une étape importante pour DataLab avec de nombreuses améliorations dans tous les domaines. Les changements sont organisés par catégorie pour une navigation plus facile.

source: **Note**: Version 1.0.1 is a patch release that addresses Windows installer limitations in version 1.0.0 (released 2025-11-16), where it was not possible to install DataLab V1.0 alongside earlier major versions (V0.20 and earlier) despite the intended coexistence support. This release contains no new features or functional changes.
fr: **Note** : La version 1.0.1 est une version corrective qui résout les limitations de l'installateur Windows de la version 1.0.0 (publiée le 16/11/2025), où il n'était pas possible d'installer DataLab V1.0 aux côtés des versions majeures antérieures (V0.20 et antérieures) malgré le support de coexistence prévu. Cette version ne contient aucune nouvelle fonctionnalité ni modification fonctionnelle.

source: 🎨 User Interface & Workflow
fr: 🎨 Interface utilisateur et flux de travail

source: **Menu reorganization:**
fr: **Réorganisation des menus :**

source: **New "Create" menu**: Separated object creation functionality from the "File" menu, placed between "File" and "Edit" menus for clearer organization
fr: **Nouveau menu "Création"** : La fonctionnalité de création d'objets a été séparée du menu "Fichier" et placée entre les menus "Fichier" et "Édition" pour une organisation plus claire

source: All "File > New [...]" actions moved to "Create" menu
fr: Toutes les actions "Fichier > Nouveau [...]" ont été déplacées vers le menu "Création"

source: **Migration note**: Find signal/image creation actions in the new "Create" menu
fr: **Note de migration** : Les actions de création de signaux/images se trouvent désormais dans le nouveau menu "Création"

source: **New "ROI" menu**: Dedicated menu for Region of Interest management, positioned between "Edit" and "Operations" menus
fr: **Nouveau menu "ROI"** : Menu dédié à la gestion des régions d'intérêt, placé entre les menus "Édition" et "Opérations"

source: **New "Annotations" submenu**: Consolidated annotation operations in the "Edit" menu
fr: **Nouveau sous-menu "Annotations"** : Regroupement des opérations d'annotation dans le menu "Édition"

source: **New "Metadata" submenu**: Grouped all metadata operations in the "Edit" menu
fr: **Nouveau sous-menu "Métadonnées"** : Regroupement de toutes les opérations de métadonnées dans le menu "Édition"

source: **Interactive object editing:**
fr: **Édition interactive d'objets :**

source: **Interactive object creation**: Creation parameters can be modified after object creation via new "Creation" tab in properties panel
fr: **Création interactive d'objets** : Les paramètres de création peuvent être modifiés après la création de l'objet via le nouvel onglet "Création" dans le panneau des propriétés

source: Apply changes without creating new objects, preserving subsequent processing
fr: Appliquer les modifications sans créer de nouveaux objets, en préservant le traitement ultérieur

source: Available for parametric generators (Gaussian, sine, etc.)
fr: Disponible pour les générateurs paramétriques (Gaussien, sinusoïdal, etc.)

source: **Interactive 1-to-1 processing**: Processing parameters can be adjusted and reapplied via new "Processing" tab
fr: **Traitement interactif 1-vers-1** : Les paramètres de traitement peuvent être ajustés et réappliqués après le traitement initial

source: Update result objects in-place with modified parameters
fr: Mise à jour sur place des objets résultats avec les paramètres modifiés

source: Only for parametric operations (filters, morphology, etc.)
fr: Uniquement pour les opérations paramétriques (filtres, morphologie, etc.)

source: **Recompute feature**: New "Recompute" action (Ctrl+R) to quickly reprocess objects with stored parameters
fr: **Fonction de recalcul** : Nouvelle action "Recalculer" (Ctrl+R) pour retraiter rapidement les objets avec les paramètres stockés

source: Works with single or multiple objects
fr: Fonctionne avec un ou plusieurs objets

source: Automatically updates results when source data changes
fr: Met à jour automatiquement les résultats lorsque les données sources changent

source: **Automatic ROI analysis update**: Analysis results automatically recalculate when ROI is modified
fr: **Mise à jour automatique de l'analyse ROI** : Les résultats d'analyse sont automatiquement recalculés lorsque le ROI est modifié

source: Works for all analysis operations (statistics, centroid, etc.)
fr: Fonctionne pour toutes les opérations d'analyse (statistiques, centroïde, etc.)

source: Silent background recomputation for immediate feedback
fr: Recalcul silencieux en arrière-plan pour un retour immédiat

source: **Select source objects**: Navigate to source objects used in processing via new "Edit" menu action
fr: **Sélectionner les objets source** : Naviguer vers les objets source utilisés dans le traitement via une nouvelle action du menu "Édition"

source: Handles all processing patterns (1-to-1, 2-to-1, n-to-1)
fr: Gère tous les modèles de traitement (1-vers-1, 2-vers-1, n-vers-1)

source: Shows informative messages if sources no longer exist
fr: Affiche des messages informatifs si les sources n'existent plus

source: **Processing history**: New "History" tab displays object processing lineage as hierarchical tree
fr: **Historique de traitement** : Nouvel onglet "Historique" affichant la lignée de traitement des objets

source: Shows complete processing chain from creation to current state
fr: Affiche la chaîne de traitement complète depuis la création jusqu'à l'état actuel

source: Selectable text for documentation purposes
fr: Texte sélectionnable à des fins de documentation

source: **Multi-object property editing:**
fr: **Édition des propriétés de plusieurs objets :**

source: Apply property changes to multiple selected objects simultaneously
fr: Appliquer les modifications de propriétés à plusieurs objets sélectionnés simultanément

source: Only modified properties are applied, preserving unchanged individual settings
fr: Seules les propriétés modifiées sont appliquées, préservant les paramètres individuels inchangés

source: Typical use case: Adjust LUT boundaries or colormap for multiple images at once
fr: Cas d'utilisation typique : modification des limites de la LUT (bornes de l'échelle Z) ou de la carte des couleurs de plusieurs images à la fois, ou ajustement des propriétés d'affichage d'un groupe de signaux.

source: **Dialog sizing improvements:**
fr: **Améliorations de la taille des boîtes de dialogue :**

source: Processing dialogs now intelligently resize based on main window size
fr: Les boîtes de dialogue de traitement se redimensionnent désormais intelligemment en fonction de la taille de la fenêtre principale

source: Never exceed main window dimensions for better user experience
fr: Ne dépasse jamais les dimensions de la fenêtre principale pour une meilleure expérience utilisateur

source: **Internal console indicator:**
fr: **Indicateur de la console interne :**

source: Status bar indicator shows console status when hidden
fr: L'indicateur de la barre d'état affiche l'état de la console lorsqu'elle est masquée

source: Turns red on errors/warnings to alert users
fr: Devient rouge en cas d'erreurs/avertissements pour alerter les utilisateurs

source: Click to open console
fr: Cliquer pour ouvrir la console

source: 🎬 New Object Creation Features
fr: 🎬 Nouvelles fonctionnalités de création d'objets

source: **Parametric signal generators:**
fr: **Générateurs de signaux paramétriques :**

source: Linear chirp, logistic function, Planck function
fr: Chirp linéaire, fonction logistique, fonction de Planck

source: Generate signals with Poisson noise
fr: Générer des signaux avec bruit de Poisson

source: **Parametric image generators:**
fr: **Générateurs d'images paramétriques :**

source: **Checkerboard**: Calibration pattern with configurable square size and light/dark values
fr: **Damier** : Motif de calibration avec taille de carrés et valeurs claires/sombres configurables

source: **Sinusoidal grating**: Frequency response testing with independent X/Y spatial frequencies
fr: **Réseau sinusoïdal** : Test de réponse en fréquence avec fréquences spatiales X/Y indépendantes

source: **Ring pattern**: Concentric circular rings for radial analysis and PSF testing
fr: **Motif en anneau** : Anneaux circulaires concentriques pour l'analyse radiale et les tests PSF. Période d'anneau, largeur, position centrale et plage d'amplitude réglables.

source: **Siemens star**: Resolution testing with radial spokes and configurable radius
fr: **Étoile de Siemens** : Test de résolution avec rayons radiaux et rayon configurable
