Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/release_notes/release_1.01.po
Languages: fr

source: ✨ New Features
fr: ✨ Nouvelles fonctionnalités

source: **Web API for HTTP/JSON integration:**
fr: **API Web pour l'intégration HTTP/JSON :**

source: DataLab now provides a modern **HTTP/JSON Web API** as an alternative to the existing XML-RPC interface. This is the recommended integration path for new projects, especially for Jupyter notebooks and web-based tools.
fr: DataLab propose désormais une **API Web HTTP/JSON** moderne comme alternative à l'interface XML-RPC existante. C'est la voie d'intégration recommandée pour les nouveaux projets, notamment pour les notebooks Jupyter et les outils web.

source: **Accessible via**: File → Web API → Start Web API Server (or set `DATALAB_WEBAPI_ENABLED=1` environment variable)
fr: **Accessible via** : Fichier → API Web → Démarrer le serveur API Web (ou définir la variable d'environnement `DATALAB_WEBAPI_ENABLED=1`)

source: **Key benefits**:
fr: **Avantages clés** :

source: JSON for metadata and NPZ for binary data (efficient large array transfer)
fr: JSON pour les métadonnées et NPZ pour les données binaires (transfert efficace de grands tableaux)

source: Bearer token authentication for security
fr: Authentification par jeton Bearer pour la sécurité

source: REST conventions with OpenAPI documentation
fr: Conventions REST avec documentation OpenAPI

source: WASM/Pyodide compatibility (works in browser environments)
fr: Compatibilité WASM/Pyodide (fonctionne dans les environnements navigateur)

source: **Endpoints include**:
fr: **Points d'accès inclus** :

source: Object listing, retrieval, creation, and deletion
fr: Listage, récupération, création et suppression d'objets

source: Metadata management and binary data transfer (NPZ format)
fr: Gestion des métadonnées et transfert de données binaires (format NPZ)

source: Computation API for running processing operations remotely
fr: API de calcul pour exécuter des opérations de traitement à distance

source: **Auto-discovery**: DataLab-Kernel automatically finds and connects to a running DataLab instance without manual configuration
fr: **Découverte automatique** : DataLab-Kernel trouve et se connecte automatiquement à une instance DataLab en cours d'exécution sans configuration manuelle

source: **Security**: Localhost binding by default, with optional localhost token bypass for simplified local development
fr: **Sécurité** : Liaison localhost par défaut, avec contournement optionnel du jeton localhost pour simplifier le développement local

source: **PyQt6 compatibility:**
fr: **Compatibilité PyQt6 :**

source: DataLab now fully supports PyQt6 in addition to PyQt5
fr: DataLab prend désormais entièrement en charge PyQt6 en plus de PyQt5

source: Fixed screen geometry retrieval to use `primaryScreen()` for Qt5-Qt6 compatibility
fr: Correction de la récupération de la géométrie de l'écran pour utiliser `primaryScreen()` pour la compatibilité Qt5-Qt6

source: CI pipeline now includes PyQt6 testing to ensure ongoing compatibility
fr: Le pipeline CI inclut désormais les tests PyQt6 pour garantir une compatibilité continue

source: **Remote control API enhancements:**
fr: **Améliorations de l'API de contrôle à distance :**

source: **Note:** These new features also concern the macro commands API, as macros use the same proxy interface as remote control clients.
fr: **Remarque :** Ces nouvelles fonctionnalités concernent également l'API des commandes de macro, car les macros utilisent la même interface proxy que les clients de contrôle à distance.

source: Added `call_method()` method to `RemoteProxy` class for calling any public method on DataLab main window or panels:
fr: Ajout de la méthode `call_method()` à la classe `RemoteProxy` pour appeler n'importe quelle méthode publique sur la fenêtre principale de DataLab ou les panneaux :

source: Enables programmatic access to operations not exposed through dedicated proxy methods (e.g., `remove_object`, `delete_all_objects`, `get_current_panel`)
fr: Permet l'accès programmatique à des opérations non exposées via des méthodes proxy dédiées (par exemple, `remove_object`, `delete_all_objects`, `get_current_panel`)

source: Supports automatic method resolution: checks main window first, then current panel if method not found
fr: Prend en charge la résolution automatique des méthodes : vérifie d'abord la fenêtre principale, puis le panneau actuel si la méthode n'est pas trouvée

source: Optional `panel` parameter allows targeting specific panel ("signal" or "image")
fr: Le paramètre optionnel `panel` permet de cibler un panneau spécifique ("signal" ou "image")

source: Thread-safe execution: GUI operations automatically execute in main thread to prevent freezing
fr: Exécution thread-safe : les opérations GUI s'exécutent automatiquement dans le thread principal pour éviter le gel

source: Proper exception handling: exceptions raised during method execution (e.g., attempting to call private methods) are captured and propagated to the client as `xmlrpc.client.Fault` objects with the original error message
fr: Gestion appropriée des exceptions : les exceptions levées lors de l'exécution de la méthode (par exemple, tenter d'appeler des méthodes privées) sont capturées et propagées au client sous forme d'objets `xmlrpc.client.Fault` avec le message d'erreur original

source: New macro example `test_call_method.py` demonstrates usage: removing objects, getting current panel, and panel-specific operations
fr: Un nouvel exemple de macro `test_call_method.py` démontre l'utilisation : suppression d'objets, obtention du panneau actuel et opérations spécifiques au panneau

source: Expands automation capabilities for advanced macro workflows and external application control
fr: Étend les capacités d'automatisation pour des flux de travail de macro avancés et le contrôle d'applications externes

source: Added `remove_object()` method to proxy interface (local and remote) for selective object deletion
fr: Ajout de la méthode `remove_object()` à l'interface proxy (locale et distante) pour la suppression sélective d'objets

source: Removes currently selected object from active panel
fr: Supprime l'objet actuellement sélectionné du panneau actif

source: Optional `force` parameter to skip confirmation dialog
fr: Paramètre optionnel `force` pour ignorer la boîte de dialogue de confirmation

source: Complements existing `reset_all()` method which clears the entire workspace (including all macros)
fr: Complète la méthode existante `reset_all()` qui efface l'ensemble de l'espace de travail (y compris toutes les macros)

source: **Dependencies:**
fr: **Dépendances :**

source: Updated Sigima dependency to version 1.1.0 which includes new features and bug fixes
fr: Mise à jour de la dépendance Sigima vers la version 1.1.0 qui inclut de nouvelles fonctionnalités et corrections de bugs

source: Added Web API dependencies: FastAPI, Uvicorn, and Pydantic (included in standard installation)
fr: Ajout des dépendances pour l'API Web : FastAPI, Uvicorn et Pydantic (incluses dans l'installation standard)
