Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: 🛠️ Bug Fixes since version 1.0.2
fr: 🛠️ Correctifs depuis la version 1.0.2

source: **Plot refresh - ROIs and annotations persist after "Remove all":**
fr: **Rafraîchissement du graphique - Les ROI et annotations persistent après "Tout supprimer" :**

source: Fixed ROIs and annotations occasionally remaining visible after executing "Remove all" action from the Edit menu
fr: Correction des ROI et annotations restant occasionnellement visibles après l'exécution de l'action "Tout supprimer" depuis le menu Édition

source: The issue occurred because the plot widget wasn't explicitly told to redraw after clearing all plot items and shape items
fr: Le problème est survenu parce que le widget de tracé n'était pas explicitement invité à se redessiner après la suppression de tous les éléments de tracé et des éléments de forme

source: The plot now correctly refreshes its display after clearing all objects, ensuring a clean view without requiring panel switching
fr: Le graphique se rafraîchit désormais correctement après la suppression de tous les objets, garantissant une vue propre sans nécessiter de changement de panneau

source: The bug was intermittent and hard to reproduce systematically, making it appear as if objects were "stuck" on the plot
fr: Le bug était intermittent et difficile à reproduire systématiquement, donnant l'impression que les objets étaient "coincés" sur le graphique

source: **Result labels - False "omitted" message for single-row results:**
fr: **Étiquettes de résultats - Faux message "omis" pour les résultats à une seule ligne :**

source: Fixed result labels (e.g., pulse features) incorrectly showing "X more rows omitted" message when displaying single-row results with no actual truncation
fr: Correction des étiquettes de résultats (par exemple, les caractéristiques des impulsions) affichant incorrectement le message "X lignes supplémentaires omises" lors de l'affichage de résultats à une seule ligne sans troncature réelle

source: The bug occurred because `len(adapter.result)` was used to get the row count, but this actually returns the number of column headers, not data rows
fr: L'anomalie s'est produite parce que `len(adapter.result)` était utilisé pour obtenir le nombre de lignes, mais cela renvoie en fait le nombre d'en-têtes de colonnes, pas les lignes de données

source: For pulse features with 13 columns, this caused the label to think there were 13 rows when only 1 row existed, leading to a false "12 more rows omitted" message
fr: Pour les caractéristiques des impulsions avec 13 colonnes, cela a amené l'étiquette à penser qu'il y avait 13 lignes alors qu'il n'y en avait qu'une seule, ce qui a conduit à un faux message "12 lignes supplémentaires omises"

source: The fix ensures accurate row counting using `len(df)` instead, preventing false truncation notices
fr: Le correctif garantit un comptage précis des lignes en utilisant `len(df)` à la place, évitant ainsi les fausses notifications de troncature

source: This closes [Issue #281](https://github.com/datalab-platform/datalab/issues/281) - Result Labels False "Omitted" Message
fr: Ceci clôture [Issue #281](https://github.com/datalab-platform/datalab/issues/281) - Faux message "omis" des étiquettes de résultats

source: **Signal view - XRangeSelection items persist after removing signals:**
fr: **Vue des signaux - Les éléments XRangeSelection persistent après la suppression des signaux :**

source: Fixed XRangeSelection and DataInfoLabel items (created by PlotPy's curve statistics tools) remaining visible on the plot after removing all signals
fr: Correction des éléments XRangeSelection et DataInfoLabel (créés par les outils de statistiques de courbes de PlotPy) restant visibles sur le graphique après la suppression de tous les signaux

source: When activating the XRangeSelection tool from the PlotPy toolbar and then removing the signal(s), these tool-created graphical objects were not cleaned up
fr: Lors de l'activation de l'outil XRangeSelection depuis la barre d'outils PlotPy, puis de la suppression du ou des signaux, ces objets graphiques créés par l'outil n'étaient pas nettoyés

source: The cleanup logic now correctly triggers when there are zero selected objects (after deleting the last one), not just when exactly one object is selected
fr: La logique de nettoyage se déclenche désormais correctement lorsqu'il n'y a aucun objet sélectionné (après la suppression du dernier), et pas seulement lorsqu'un seul objet est sélectionné

source: This closes [Issue #280](https://github.com/datalab-platform/datalab/issues/280) - XRangeSelection items persist after removing all signals
fr: Ceci clôture [Issue #280](https://github.com/datalab-platform/datalab/issues/280) - Les éléments XRangeSelection persistent après la suppression de tous les signaux

source: **Remote control - Crash when adding object via proxy:**
fr: **Contrôle distant - Plantage lors de l'ajout d'un objet via le proxy :**

source: Fixed `AttributeError: 'NoneType' object has no attribute 'setText'` crash when adding objects via `RemoteProxy.add_object()` in macros
fr: Correction du plantage `AttributeError: 'NoneType' object has no attribute 'setText'` lors de l'ajout d'objets via `RemoteProxy.add_object()` dans les macros

source: The crash occurred in `update_tree()` when the tree view became temporarily out of sync with the object model (e.g., when adding objects with specific metadata configurations or ROIs via remote proxy)
fr: Le plantage se produisait dans `update_tree()` lorsque la vue arborescente se désynchronisait temporairement avec le modèle d'objets (par exemple, lors de l'ajout d'objets avec des configurations de métadonnées spécifiques ou des ROIs via le proxy distant)

source: The tree view now rebuilds automatically if inconsistencies are detected, ensuring robust object addition in all scenarios
fr: La vue arborescente se reconstruit désormais automatiquement si des incohérences sont détectées, assurant un ajout d'objets robuste dans tous les scénarios

source: This closes [Issue #279](https://github.com/datalab-platform/datalab/issues/279) - AttributeError in update_tree() when adding object via RemoteProxy
fr: Ceci clôture [Issue #279](https://github.com/datalab-platform/datalab/issues/279) - AttributeError dans update_tree() lors de l'ajout d'un objet via RemoteProxy

source: **Icons - Qt SVG warnings on Linux:**
fr: **Icônes - Avertissements Qt SVG sous Linux :**

source: Fixed "qt.svg: Invalid path data; path truncated" warnings appearing 4 times at startup on Linux/Ubuntu
fr: Correction des avertissements « qt.svg: Invalid path data; path truncated » apparaissant 4 fois au démarrage sous Linux/Ubuntu

source: Cleaned SVG icon files to remove Inkscape/Sodipodi metadata and fixed path syntax in two icon files that used implicit cubic Bézier command continuation (not supported by Qt's SVG renderer on Linux)
fr: Nettoyage des fichiers d'icônes SVG pour supprimer les métadonnées Inkscape/Sodipodi et correction de la syntaxe des chemins dans deux fichiers d'icônes qui utilisaient une continuation implicite de commande de courbe de Bézier cubique (non prise en charge par le moteur de rendu SVG de Qt sous Linux)

source: This closes [Issue #278](https://github.com/datalab-platform/datalab/issues/278) - Fix "qt.svg: Invalid path data; path truncated" warnings on Linux
fr: Ceci clôture [Issue #278](https://github.com/datalab-platform/datalab/issues/278) - Correction des avertissements « qt.svg: Invalid path data; path truncated » sous Linux

source: **ROI extraction - KeyError when extracting ROIs:**
fr: **Extraction de ROI - KeyError lors de l'extraction des ROI :**

source: Fixed `KeyError` when extracting ROIs from images with ROIs generated by blob detection or other analysis functions
fr: Correction de l'erreur `KeyError` lors de l'extraction des ROI à partir d'images avec des ROI générées par la détection de blobs ou d'autres fonctions d'analyse

source: The issue occurred because the ROI editor was trying to access plot items that hadn't been created yet (e.g., when "auto refresh" was disabled or in certain selection scenarios)
fr: Le problème est survenu parce que l'éditeur de ROI essayait d'accéder à des éléments de tracé qui n'avaient pas encore été créés (par exemple, lorsque le "rafraîchissement automatique" était désactivé ou dans certains scénarios de sélection)

source: The ROI extraction dialog now handles missing plot items gracefully
fr: La boîte de dialogue d'extraction de ROI gère désormais correctement les éléments de tracé manquants

source: This closes [Issue #276](https://github.com/datalab-platform/datalab/issues/276) - KeyError when extracting ROIs from images with blob detection results
fr: Ceci clôture [Issue #276](https://github.com/datalab-platform/datalab/issues/276) - KeyError lors de l'extraction des ROI à partir d'images avec des résultats de détection de blobs

source: **Plugin development - Infinite loop when iterating over group objects:**
fr: **Développement de plugins - Boucle infinie lors de l'itération sur les objets d'un groupe :**

source: Fixed infinite loop occurring in plugins when iterating over object IDs returned by `ObjectGroup.get_object_ids()` while simultaneously adding new objects to the same group
fr: Correction de la boucle infinie se produisant dans les plugins lors de l'itération sur les identifiants d'objets retournés par `ObjectGroup.get_object_ids()` tout en ajoutant simultanément de nouveaux objets au même groupe

source: The method was returning a direct reference to the internal list instead of a copy, causing the iteration to include newly added objects and loop indefinitely
fr: La méthode retournait une référence directe à la liste interne au lieu d'une copie, ce qui faisait que l'itération incluait les objets nouvellement ajoutés et bouclait indéfiniment

source: This particularly affected plugin workflows that loop over signals/images in a group and add results to the same or another group
fr: Cela affectait particulièrement les flux de travail des plugins qui bouclent sur les signaux/images d'un groupe et ajoutent des résultats au même groupe ou à un autre groupe

source: The fix ensures `get_object_ids()` now returns a copy of the list, making iteration safe even when modifying the group
fr: Le correctif garantit que `get_object_ids()` retourne désormais une copie de la liste, rendant l'itération sûre même lors de la modification du groupe

source: This closes [Issue #274](https://github.com/datalab-platform/datalab/issues/274) - Infinite loop when iterating over group objects while adding new objects
fr: Ceci clôture [Issue #274](https://github.com/datalab-platform/datalab/issues/274) - Boucle infinie lors de l'itération sur les objets d'un groupe tout en ajoutant de nouveaux objets

source: **Marker visibility:**
fr: **Visibilité des marqueurs :**

source: Fixed cross marker (shown when pressing Alt key on plot) colors inherited from PlotPy being too pale on white background, and other marker properties explicitly configured for better contrast
fr: Correction des couleurs du marqueur en croix (affiché en appuyant sur la touche Alt sur le graphique) héritées de PlotPy étant trop pâles sur fond blanc, et d'autres propriétés de marqueurs explicitement configurées pour un meilleur contraste

source: Fixed default annotation colors inherited from PlotPy being too pale on white background - segment and drag shape annotations now use brighter green (`#00ff55`) for better visibility
fr: Correction des couleurs d'annotation par défaut héritées de PlotPy étant trop pâles sur fond blanc - les annotations de segments et de formes glissées utilisent désormais un vert plus vif (`#00ff55`) pour une meilleure visibilité

source: **Macro panel layout:**
fr: **Disposition du panneau des macros :**

source: Fixed macro console taking excessive vertical space on first open - the script editor now properly gets 70% of space and console 30% by default, ensuring comfortable editing without manual resizing
fr: Correction du panneau de la console des macros prenant un espace vertical excessif à la première ouverture - l'éditeur de scripts obtient désormais correctement 70 % de l'espace et la console 30 % par défaut, garantissant une édition confortable sans redimensionnement manuel

source: **Macro naming:**
fr: **Nommage des macros :**

source: Fixed automatic macro naming generating duplicate names after reloading workspace from HDF5 files
fr: Correction du nommage automatique des macros générant des noms en double après le rechargement de l'espace de travail à partir de fichiers HDF5

source: When macros were deserialized from saved workspaces or imported from files, the internal counter used for generating default names (e.g., "macro_01", "macro_02") was not updated, causing the next new macro to potentially reuse an existing name
fr: Lorsque les macros étaient désérialisées à partir d'espaces de travail enregistrés ou importées à partir de fichiers, le compteur interne utilisé pour générer des noms par défaut (par exemple, "macro_01", "macro_02") n'était pas mis à jour, ce qui pouvait entraîner la réutilisation d'un nom existant pour la prochaine nouvelle macro

source: The counter now synchronizes with existing macro names after loading, ensuring unique sequential naming
fr: Le compteur se synchronise désormais avec les noms de macros existants après le chargement, garantissant un nommage séquentiel unique

source: Default macro names simplified from translated "Untitled XX" to language-neutral "macro_XX" format for better consistency across locales
fr: Les noms de macros par défaut ont été simplifiés du format traduit "Sans titre XX" au format neutre en termes de langue "macro_XX" pour une meilleure cohérence entre les locales

source: **Macro execution:**
fr: **Exécution des macros :**

source: Fixed syntax errors when using f-strings with nested quotes in macros (e.g., `f'text {func("arg")}'` now works correctly)
fr: Correction des erreurs de syntaxe lors de l'utilisation de f-strings avec des guillemets imbriqués dans les macros (par exemple, `f'text {func("arg")}'` fonctionne désormais correctement)

source: Fixed corrupted Unicode characters in macro console output on Windows - special characters like ✅, 💡, and → now display correctly instead of showing garbled text
fr: Correction des caractères Unicode corrompus dans la sortie de la console des macros sous Windows - les caractères spéciaux comme ✅, 💡 et → s'affichent désormais correctement au lieu d'afficher du texte illisible

source: **Internal console - HDF5 workspace operations:**
fr: **Console interne - Opérations sur l'espace de travail HDF5 :**

source: Fixed application freeze when calling `open_h5_files()` from the internal console - the console runs in a separate thread and creating Qt GUI elements (progress dialogs) from non-main threads causes deadlocks
fr: Correction du blocage de l'application lors de l'appel de `open_h5_files()` depuis la console interne - la console s'exécute dans un thread séparé et la création d'éléments d'interface Qt (boîtes de dialogue de progression) depuis des threads non principaux provoque des blocages

source: Added new headless API methods `load_h5_workspace()` and `save_h5_workspace()` that can be safely called from the internal console or any script context without GUI dependencies
fr: Ajout de nouvelles méthodes d'API sans interface graphique `load_h5_workspace()` et `save_h5_workspace()` qui peuvent être appelées en toute sécurité depuis la console interne ou tout contexte de script sans dépendances à l'interface graphique

source: These methods are also available through the remote control API for consistency
fr: Ces méthodes sont également disponibles via l'API de contrôle distant pour plus de cohérence

source: Note: `load_h5_workspace()` only supports native DataLab HDF5 files; for importing arbitrary HDF5 files, use macros with `RemoteProxy`
fr: Note : `load_h5_workspace()` ne prend en charge que les fichiers HDF5 natifs de DataLab ; pour importer des fichiers HDF5 arbitraires, utilisez des macros avec `RemoteProxy`

source: This closes [Issue #275](https://github.com/datalab-platform/datalab/issues/275) - Console freezes when calling `open_h5_files()` from internal console
fr: Ceci clôture [Issue #275](https://github.com/datalab-platform/datalab/issues/275) - Blocage de la console lors de l'appel de `open_h5_files()` depuis la console interne

source: **Signal cursor dialogs - Decimal input with regional settings:**
fr: **Boîtes de dialogue de curseur de signal - Saisie décimale avec les paramètres régionaux :**

source: Fixed decimal value input failing in signal cursor dialogs when using regional settings with comma as decimal separator (e.g., French, German locales)
fr: Correction de l'échec de la saisie de valeurs décimales dans les boîtes de dialogue de curseur de signal lors de l'utilisation de paramètres régionaux avec la virgule comme séparateur décimal (par exemple, locales française, allemande)

source: The Y input field in "First abscissa at y=...", "Ordinate at x=...", and "Full width at y=..." dialogs now consistently accepts dot as decimal separator regardless of system locale
fr: Le champ de saisie Y dans les boîtes de dialogue "Première abscisse à y=...", "Ordonnée à x=..." et "Largeur totale à y=..." accepte désormais systématiquement le point comme séparateur décimal, quelle que soit la locale du système

source: This closes [Issue #276](https://github.com/datalab-platform/datalab/issues/276) - Decimal input fails with regional settings using comma as decimal separator
fr: Ceci clôture [Issue #276](https://github.com/datalab-platform/datalab/issues/276) - Échec de la saisie décimale avec les paramètres régionaux utilisant la virgule comme séparateur décimal

source: **Radial profile title:**
fr: **Titre du profil radial :**

source: Fixed duplicate suffix in result image title when extracting radial profile from an image (e.g., `radial_profile(i019)|center=(192.500, 192.500)|center=(192.500, 192.500)` instead of `radial_profile(i019)|center=(192.500, 192.500)`)
fr: Correction du suffixe en double dans le titre de l'image résultante lors de l'extraction du profil radial d'une image (par exemple, `radial_profile(i019)|center=(192.500, 192.500)|center=(192.500, 192.500)` au lieu de `radial_profile(i019)|center=(192.500, 192.500)`)

source: This fix is provided by Sigima 1.0.4
fr: Ce correctif est fourni par Sigima 1.0.4

source: **Grid ROI - Missing spacing parameters for non-uniform grids:**
fr: **ROI de grille - Paramètres d'espacement manquants pour les grilles non uniformes :**

source: Fixed grid ROI feature not working correctly for images where subimages don't fill the entire image area (e.g., laser spot arrays with gaps between spots)
fr: Correction de la fonctionnalité ROI de grille ne fonctionnant pas correctement pour les images où les sous-images ne remplissent pas toute la zone de l'image (par exemple, les réseaux de points laser avec des espaces entre les points)

source: Added missing `xstep` and `ystep` parameters to control horizontal and vertical spacing between ROI centers, as a percentage of the automatically computed cell width/height (default 100% = evenly distributed grid)
fr: Ajout des paramètres manquants `xstep` et `ystep` pour contrôler l'espacement horizontal et vertical entre les centres des ROI, en pourcentage de la largeur/hauteur de cellule calculée automatiquement (par défaut 100 % = grille uniformément répartie)

source: Previously, the grid was always assumed to be evenly distributed across the entire image, which failed when there was significant offset or gaps between features
fr: Auparavant, la grille était toujours supposée être uniformément répartie sur toute l'image, ce qui échouait lorsqu'il y avait un décalage ou des espaces importants entre les caractéristiques

source: Users can now adjust ROI spacing independently from ROI size to accurately extract grids from real-world data like laser spot arrays, diffraction patterns, or any regularly spaced features with gaps
fr: Les utilisateurs peuvent désormais ajuster l'espacement des ROI indépendamment de la taille des ROI pour extraire avec précision des grilles à partir de données réelles telles que des réseaux de points laser, des motifs de diffraction ou toute caractéristique régulièrement espacée avec des espaces

source: This closes [Issue #282](https://github.com/datalab-platform/datalab/issues/282) - Grid ROI Missing Spacing Parameters
fr: Ceci clôture [Issue #282](https://github.com/datalab-platform/datalab/issues/282) - Paramètres d'espacement manquants pour la ROI de grille

source: **Analysis auto-recompute - Redundant O(n²) calculations when adding ROI:**
fr: **Recalcul automatique de l'analyse - Calculs redondants O(n²) lors de l'ajout de ROI :**

source: Fixed severe performance issue where adding ROI to N selected images with analysis results (e.g., Statistics, Centroid) triggered N² calculations instead of N
fr: Correction d'un problème de performance sévère où l'ajout d'une ROI à N images sélectionnées avec des résultats d'analyse (p. ex. Statistiques, Centroïde) déclenchait N² calculs au lieu de N

source: When 10 images were selected with pre-computed statistics, adding a ROI would show 10 progress bars of 10 calculations each (100 total) instead of a single progress bar with 10 calculations
fr: Lorsque 10 images étaient sélectionnées avec des statistiques pré-calculées, l'ajout d'une ROI affichait 10 barres de progression de 10 calculs chacune (100 au total) au lieu d'une seule barre de progression avec 10 calculs

source: The issue occurred because `auto_recompute_analysis()` was calling `compute_1_to_0()` which by default processes all selected objects, not just the specific object being recomputed
fr: Le problème se produisait car `auto_recompute_analysis()` appelait `compute_1_to_0()` qui, par défaut, traite tous les objets sélectionnés, pas seulement l'objet spécifique en cours de recalcul

source: Added `target_objs` parameter to `compute_1_to_0()` to allow specifying which objects to process, and updated `auto_recompute_analysis()` to use it
fr: Ajout du paramètre `target_objs` à `compute_1_to_0()` pour permettre de spécifier quels objets traiter, et mise à jour de `auto_recompute_analysis()` pour l'utiliser

source: This closes [Issue #283](https://github.com/datalab-platform/datalab/issues/283) - Redundant O(n²) calculations when adding ROI to multiple images with analysis results
fr: Ceci clôture [Issue #283](https://github.com/datalab-platform/datalab/issues/283) - Calculs redondants O(n²) lors de l'ajout de ROI à plusieurs images avec des résultats d'analyse

source: **Result visualization - Analysis result segments hard to see:**
fr: **Visualisation des résultats - Segments de résultats d'analyse difficiles à voir :**

source: Fixed analysis result markers (FWHM, pulse features, etc.) being difficult or impossible to see on signal plots
fr: Correction des marqueurs de résultats d'analyse (FWHM, caractéristiques des impulsions, etc.) difficiles ou impossibles à voir sur les graphiques de signaux

source: These measurement indicators were appearing black on white backgrounds or white on dark backgrounds, making them blend into the plot
fr: Ces indicateurs de mesure apparaissaient en noir sur des fonds blancs ou en blanc sur des fonds sombres, les faisant se fondre dans le graphique

source: They now display in bright green with thicker lines, making them clearly visible in all color themes
fr: Ils s'affichent désormais en vert vif avec des lignes plus épaisses, les rendant clairement visibles dans tous les thèmes de couleur
