Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: **2D sinc**: Cardinal sine function for PSF modeling and diffraction simulation
fr: **Sinc 2D** : Fonction sinus cardinal pour la modélisation de la PSF et la simulation de motifs de diffraction. Les paramètres incluent l'amplitude, la position centrale, le facteur d'échelle (sigma) et le décalage DC.

source: **2D ramp**: New ramp image generator
fr: **Rampe 2D** : Nouveau générateur d'image de rampe

source: **Poisson noise**: Generate images with Poisson noise distribution
fr: **Bruit de Poisson** : Générer des images avec distribution de bruit de Poisson

source: **Signal/image creation from operations:**
fr: **Création de signaux/images à partir d'opérations :**

source: Create complex-valued signal/image from real and imaginary parts
fr: Créer un signal/image à valeurs complexes à partir des parties réelle et imaginaire

source: Create complex-valued signal/image from magnitude and phase (closes [Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216))
fr: Créer un signal/image à valeurs complexes à partir de la magnitude et de la phase (ceci clôture [Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216))

source: Extract phase (argument) information from complex signals or images
fr: Extraire l'information de phase (argument) des signaux ou images complexes

source: 🔬 Data Processing & Analysis
fr: 🔬 Traitement et analyse de données

source: **Signal processing:**
fr: **Traitement du signal :**

source: **Enhanced curve fitting**: Significantly improved parameter estimation for all curve types (Gaussian, Lorentzian, Voigt, exponential, sinusoidal, Planckian, asymmetric peaks, CDF)
fr: **Ajustement de courbes amélioré** : Estimation des paramètres considérablement améliorée pour tous les types de courbes (Gaussienne, Lorentzienne, Voigt, exponentielle, sinusoïdale, Planckienne, pics asymétriques, CDF)

source: Smarter initial parameter guesses for robust convergence
fr: Estimations initiales des paramètres plus intelligentes pour une convergence robuste

source: **Locked parameter support**: Lock individual parameters during optimization (requires PlotPy v2.8.0)
fr: **Prise en charge des paramètres verrouillés** (nécessite PlotPy v2.8.0) :

source: **X-array compatibility checking**: Comprehensive validation for multi-signal operations with automatic interpolation options
fr: **Vérification de la compatibilité des tableaux X pour les calculs multi-signaux** :

source: New configuration setting: Ask user or interpolate automatically
fr: Nouveau paramètre de configuration : Demander à l'utilisateur ou interpoler automatiquement

source: Prevents unexpected results from incompatible signal arrays
fr: Empêche les résultats inattendus dus à des tableaux de signaux incompatibles

source: **Zero padding enhancements**: Support for prepending and appending zeros, default strategy now "Next power of 2"
fr: **Améliorations du zero padding** : Prise en charge de l'ajout de zéros au début et à la fin, stratégie par défaut désormais "Prochaine puissance de 2"

source: **Ideal frequency domain filter**: "Brick wall filter" for signals (closes [Issue #215](https://github.com/DataLab-Platform/DataLab/issues/215))
fr: **Filtre idéal dans le domaine fréquentiel** : "Filtre en brique" pour les signaux (ceci clôture [Issue #215](https://github.com/DataLab-Platform/DataLab/issues/215))

source: **Bandwidth at -3dB**: Enhanced to support passband bandwidth
fr: **Bande passante à -3dB** : Améliorée pour prendre en charge la bande passante

source: **Pulse features extraction**: Comprehensive pulse analysis for step and square signals
fr: **Extraction des caractéristiques des impulsions** : Nouvelle fonctionnalité complète d'analyse des impulsions pour les signaux en escalier et carrés :

source: Automated shape recognition and polarity detection
fr: Reconnaissance automatique de la forme et détection de la polarité

source: Measures amplitude, rise/fall time, FWHM, timing parameters, baseline ranges
fr: Mesure l'amplitude, le temps de montée/descente, la FWHM, les paramètres temporels, les plages de référence

source: **Frequency domain filters**: Deconvolution and Gaussian filter (closes [Issue #189](https://github.com/DataLab-Platform/DataLab/issues/189), [Issue #205](https://github.com/DataLab-Platform/DataLab/issues/205))
fr: **Filtres dans le domaine fréquentiel** : Déconvolution et filtre Gaussien (ceci clôture [Issue #189](https://github.com/DataLab-Platform/DataLab/issues/189), [Issue #205](https://github.com/DataLab-Platform/DataLab/issues/205))

source: **Coordinate transformations**: Convert to Cartesian/polar coordinates
fr: **Transformations de coordonnées** : Conversion en coordonnées cartésiennes/polaires

source: **X-Y mode**: Simulate oscilloscope X-Y mode (plot one signal vs. another)
fr: **Mode X-Y** : Simule le mode X-Y d'un oscilloscope (trace un signal par rapport à un autre)

source: **Find operations**: First abscissa at y=..., ordinate at x=..., full width at y=...
fr: **Opérations de recherche** : Première abscisse à y=..., ordonnée à x=..., largeur totale à y=...

source: **`1/x` operation**: Reciprocal operation with NaN handling for zero denominators
fr: **Opération `1/x`** : Opération réciproque avec gestion des NaN pour les dénominateurs nuls

source: **Image processing:**
fr: **Traitement d'images :**

source: **2D resampling**: Resample images to new coordinate grids with multiple interpolation methods (closes [Issue #208](https://github.com/DataLab-Platform/DataLab/issues/208))
fr: **Rééchantillonnage 2D** : Rééchantillonner les images vers de nouvelles grilles de coordonnées avec plusieurs méthodes d'interpolation (ceci clôture [Issue #208](https://github.com/DataLab-Platform/DataLab/issues/208))

source: **Convolution**: 2D convolution operation
fr: **Convolution** : Opération de convolution 2D

source: **Erase area**: Erase image areas defined by ROI (closes [Issue #204](https://github.com/DataLab-Platform/DataLab/issues/204))
fr: **Effacer une zone** : Effacer les zones d'image définies par ROI (ceci clôture [Issue #204](https://github.com/DataLab-Platform/DataLab/issues/204))

source: **Horizontal/vertical projections**: Sum of pixels along axes (closes [Issue #209](https://github.com/DataLab-Platform/DataLab/issues/209))
fr: **Projections horizontales/verticales** : Somme des pixels le long des axes (ceci clôture [Issue #209](https://github.com/DataLab-Platform/DataLab/issues/209))

source: **Improved centroid computation**: More accurate in challenging cases (truncated/asymmetric images) (see [Issue #251](https://github.com/DataLab-Platform/DataLab/issues/251))
fr: **Calcul du centroïde amélioré** : Plus précis dans les cas difficiles (images tronquées/asymétriques) (voir [Issue #251](https://github.com/DataLab-Platform/DataLab/issues/251))

source: **Flip diagonally**: New geometric transformation
fr: **Retourner en diagonale** : Nouvelle transformation géométrique

source: **`1/x` operation**: Reciprocal operation for images
fr: **Opération `1/x`** : Opération réciproque pour les images

source: **Cross-panel operations:**
fr: **Opérations inter-panneaux :**

source: **Signals to image conversion**: Combine multiple signals into 2D images
fr: **Conversion signaux vers image** : Combiner plusieurs signaux en images 2D

source: Two orientation modes: as rows (spectrograms) or columns (waterfall displays)
fr: Deux modes d'orientation : en lignes (spectrogrammes) ou en colonnes (affichages en cascade)

source: Optional normalization (Z-score, Min-Max, Maximum)
fr: Normalisation optionnelle (Z-score, Min-Max, Maximum)

source: Typical use cases: heatmaps, spectrograms, multi-channel data visualization
fr: Cas d'utilisation typiques : cartes de chaleur, spectrogrammes, visualisation de données multi-canaux

source: **Common features:**
fr: **Fonctionnalités communes :**

source: **Standard deviation**: Calculate across multiple signals/images (closes [Issue #196](https://github.com/DataLab-Platform/DataLab/issues/196))
fr: **Écart-type** : Calculer sur plusieurs signaux/images (ceci clôture [Issue #196](https://github.com/DataLab-Platform/DataLab/issues/196))

source: **Add noise**: Add Gaussian, Poisson, or uniform noise (closes [Issue #201](https://github.com/DataLab-Platform/DataLab/issues/201))
fr: **Ajouter du bruit** : Ajouter du bruit gaussien, de Poisson ou uniforme (ceci clôture [Issue #201](https://github.com/DataLab-Platform/DataLab/issues/201))

source: **Add metadata**: Add custom metadata with pattern support (`{title}`, `{index}`, etc.) and type conversion
fr: **Ajouter des métadonnées** : Ajouter des métadonnées personnalisées avec prise en charge des motifs (`{title}`, `{index}`, etc.) et conversion de type

source: 📐 ROI & Annotation Management
fr: 📐 Gestion des ROI et annotations

source: **ROI features:**
fr: **Fonctionnalités ROI :**

source: **ROI clipboard operations**: Copy/paste ROIs between objects
fr: **Opérations de presse-papiers ROI** : Copier/coller les ROI entre objets

source: **ROI import/export**: Save/load ROIs as JSON files
fr: **Importer/exporter des ROI** : Enregistrer/charger les ROI au format JSON

source: **Individual ROI removal**: Remove ROIs selectively via "Remove" submenu
fr: **Suppression individuelle de ROI** : Supprimer les ROI sélectivement via le sous-menu "Supprimer"

source: **ROI title editing**: Set titles during interactive creation and in confirmation dialog
fr: **Édition des titres de ROI** : Définir les titres pendant la création interactive et dans la boîte de dialogue de confirmation

source: **Create ROI grid**: Generate grid of ROIs with configurable rows, columns, and spacing
fr: **Créer une grille de ROI** : Générer une grille de ROI avec lignes, colonnes et espacement configurables

source: Import/export grid configurations
fr: Importer/exporter les configurations de grille

source: Preview before creation
fr: Aperçu avant création

source: **Inverse ROI logic**: Select area outside defined shapes (images only)
fr: **Logique ROI inverse** : Sélectionner la zone en dehors des formes définies (images uniquement)

source: **Coordinate-based ROI creation**: Manual input of coordinates for rectangular and circular ROIs
fr: **Création de ROI par coordonnées** : Saisie manuelle des coordonnées pour les ROI rectangulaires et circulaires

source: **Multi-object ROI editing**: Edit ROIs on multiple objects simultaneously
fr: **Édition de ROI multi-objets** : Éditer les ROI sur plusieurs objets simultanément

source: **Annotation features:**
fr: **Fonctionnalités d'annotation :**

source: **Annotation clipboard**: Copy/paste annotations between objects
fr: **Coller les annotations** : Coller les annotations du presse-papiers sur l'objet (ou les objets) sélectionné(s)

source: **Edit annotations**: Interactive editor dialog with PlotPy tools
fr: **Éditer les annotations** : Boîte de dialogue d'éditeur interactif avec outils PlotPy

source: **Import/export annotations**: Save/load as .dlabann JSON files with versioning
fr: **Exporter les annotations** : Enregistrer les annotations dans des fichiers JSON .dlabann

source: **Delete annotations**: Remove from single or multiple objects with confirmation
fr: **Supprimer les annotations** : Supprimer toutes les annotations de l'objet (ou des objets) sélectionné(s)

source: **Annotations independent from ROI**: Can coexist on same object
fr: **Annotations indépendantes des ROI** : Peuvent coexister sur le même objet

source: **Detection with ROI creation:**
fr: **Détection avec création de ROI :**

source: All 7 detection algorithms now support automatic ROI creation:
fr: Les 7 algorithmes de détection prennent désormais en charge la création automatique de ROI :

source: Peak detection, contour shape, blob detection (DOG/DOH/LOG/OpenCV), Hough circle
fr: Détection de pics, forme de contour, détection de blobs (DOG/DOH/LOG/OpenCV), cercle de Hough

source: **ROI geometry choice**: Rectangular or circular ROIs
fr: **Choix de géométrie de ROI** : ROI rectangulaires ou circulaires

source: **2D peak detection**: Option to choose ROI geometry (closes related requirements)
fr: **Détection de pics 2D** : Option pour choisir la géométrie de ROI (ceci clôture les exigences associées)

source: 📊 Visualization & Display
fr: 📊 Visualisation et affichage

source: **Performance & display limits:**
fr: **Performances et limites d'affichage :**

source: **Configurable result display limits**: Prevent UI freezing with large result sets
fr: **Optimisations des performances pour les grands ensembles de résultats** : Ajout de limites d'affichage configurables pour éviter le gel de l'interface utilisateur avec de grands résultats d'analyse

source: `max_shapes_to_draw` (default: 1,000), `max_cells_in_label` (default: 100), `max_cols_in_label` (default: 15)
fr: `max_shapes_to_draw` (par défaut : 1 000), `max_cells_in_label` (par défaut : 100), `max_cols_in_label` (par défaut : 15)

source: Settings documented with performance implications
fr: Paramètres documentés avec implications sur les performances

source: **Faster contour rendering**: Over 5x performance improvement for contour display
fr: **Rendu de contours plus rapide** : Amélioration des performances de plus de 5x pour l'affichage des contours

source: **Signal rendering optimization**: Smart linewidth clamping for large datasets
fr: **Optimisation des performances de rendu des signaux** : Ajout d'un plafonnement intelligent de l'épaisseur de trait pour les grands ensembles de données

source: New setting: "Line width performance threshold" (default: 1,000 points)
fr: Nouveau paramètre : « Seuil de performance de l'épaisseur de trait » (par défaut : 1 000 points) dans les paramètres de visualisation des signaux

source: Prevents 10x slowdown from Qt raster engine limitation
fr: Empêche un ralentissement de 10x dû à la limitation du moteur raster de Qt

source: **Result visualization:**
fr: **Visualisation des résultats :**

source: **Merged result labels**: All analysis results consolidated in single read-only label
fr: **Étiquettes de résultats fusionnées** : Tous les résultats d'analyse pour un signal ou une image sont désormais affichés dans une seule étiquette consolidée en lecture seule

source: Reduces visual clutter, auto-updates, horizontally divided results
fr: Réduit l'encombrement visuel, mises à jour automatiques, résultats divisés horizontalement

source: **Result label visibility control**: Toggle visibility via Properties panel checkbox
fr: **Contrôle de visibilité de l'étiquette de résultats** : Basculer la visibilité via la case à cocher du panneau de propriétés

source: Default visibility configurable in Settings
fr: Visibilité par défaut configurable dans les paramètres

source: **Results group organization**: Plot results automatically organized in dedicated "Results" group
fr: **Création de groupe de résultats** : Toutes les opérations de tracé des résultats organisent désormais automatiquement les résultats dans un groupe "Résultats" dédié

source: **Comprehensive result titles**: Include source object identifiers (e.g., "FWHM (s001, s002, s003)")
fr: **Titres de résultats complets** : Les titres des signaux de résultats incluent désormais les identifiants des objets source

source: **Individual result deletion**: Remove results selectively via Analysis menu
fr: **Suppression individuelle de résultats** : Supprimer les résultats sélectivement via le menu Analyse

source: **Customizable shape/marker styles**: Four new style configuration buttons in Settings
fr: **Styles de formes/marqueurs personnalisables** : Quatre nouveaux boutons de configuration de style dans les paramètres

source: Separate styles for signals and images
fr: Fonctionnalités communes aux signaux et aux images :

source: Interactive editor with comprehensive options
fr: Éditeur interactif avec options complètes

source: Persistent configuration with refresh on change
fr: Configuration persistante avec rafraîchissement au changement

source: **Enhanced profile extraction:**
fr: Fonctionnalité d'extraction de profil d'intensité :

source: Click directly on X/Y profile plots to switch extraction direction
fr: Cliquer directement sur les tracés de profils X/Y pour changer la direction d'extraction

source: No need to open parameters dialog for direction changes
fr: Pas besoin d'ouvrir la boîte de dialogue des paramètres pour les changements de direction

source: Improves workflow efficiency (closes [Issue #156](https://github.com/DataLab-Platform/DataLab/issues/156))
fr: Améliore l'efficacité du flux de travail (ceci clôture [Issue #156](https://github.com/DataLab-Platform/DataLab/issues/156))

source: **DateTime signal support:**
fr: **Prise en charge des signaux DateTime :**

source: Automatic datetime detection in CSV files
fr: Détection automatique des dates dans les fichiers CSV

source: **Datetime axis formatting**: Human-readable timestamps on X-axis
fr: **Formatage de l'axe datetime** : Horodatages lisibles sur l'axe X

source: **Configurable formats**: Separate formats for standard and sub-second units
fr: **Formats configurables** : Formats séparés pour les unités standard et sub-secondes

source: Supports various time units (seconds, milliseconds, microseconds, minutes, hours)
fr: Prend en charge diverses unités de temps (secondes, millisecondes, microsecondes, minutes, heures)

source: Closes [Issue #258](https://github.com/DataLab-Platform/DataLab/issues/258)
fr: Ceci clôture [Issue #258](https://github.com/DataLab-Platform/DataLab/issues/258)

source: **Settings:**
fr: **Paramètres :**

source: **Autoscale margins**: Configurable margins (0-50%) for signal/image plots
fr: **Marges d'auto-échelle** : Marges configurables (0-50%) pour les tracés de signaux/images

source: **Lock image aspect ratio**: Option for 1:1 aspect ratio (default: use physical pixel size) (closes [Issue #244](https://github.com/DataLab-Platform/DataLab/issues/244))
fr: **Verrouiller le rapport d'aspect de l'image** : Option pour un rapport d'aspect 1:1 (par défaut : utiliser la taille de pixel physique) (ceci clôture [Issue #244](https://github.com/DataLab-Platform/DataLab/issues/244))

source: **Show console on error**: Configurable behavior (default: off)
fr: **Afficher la console en cas d'erreur** : Comportement configurable (par défaut : désactivé)

source: **Image extent parameters:**
fr: **Paramètres d'étendue de l'image :**

source: New "Extent" group box showing computed Xmin, Xmax, Ymin, Ymax
fr: Nouvelle boîte de groupe « Étendue » affichant les Xmin, Xmax, Ymin, Ymax calculés

source: Automatically calculated from origin, pixel spacing, and dimensions
fr: Calculé automatiquement à partir de l'origine, de l'espacement des pixels et des dimensions

source: 📁 Import/Export & File Handling
fr: 📁 Import/Export et gestion des fichiers

source: **New file format support:**
fr: **Prise en charge de nouveaux formats de fichiers :**

source: **FT-Lab signals and images**: CEA binary formats (.sig, .ima) (closes [Issue #211](https://github.com/DataLab-Platform/DataLab/issues/211))
fr: **Signaux et images FT-Lab** : Formats binaires CEA (.sig, .ima) (ceci clôture [Issue #211](https://github.com/DataLab-Platform/DataLab/issues/211))

source: **Coordinated text files**: Real and complex-valued images with error images (similar to Matris format)
fr: **Fichiers texte coordonnés** : Images à valeurs réelles et complexes avec images d'erreur (similaire au format Matris)

source: Automatic NaN handling, metadata with units and labels
fr: Gestion automatique des NaN, métadonnées avec unités et étiquettes

source: **Enhanced HDF5 support:**
fr: **Prise en charge HDF5 améliorée :**

source: **Custom file extensions**: Intelligent HDF5 detection by content (not just extension)
fr: **Extensions de fichiers personnalisées** : Détection intelligente HDF5 par contenu (pas seulement l'extension)

source: Extension-based detection for dialogs, content-based for drag-and-drop
fr: Détection basée sur l'extension pour les boîtes de dialogue, basée sur le contenu pour le glisser-déposer

source: "All files (*)" option in file dialogs
fr: Option "Tous les fichiers (*)" dans les boîtes de dialogue de fichiers

source: **HDF5 Browser improvements**: Default collapsed tree view for better navigation
fr: **Améliorations du navigateur HDF5** : Vue arboresc ente réduite par défaut pour une meilleure navigation

source: **Workspace clearing options**: Configurable behavior with "Ignore" option (closes [Issue #146](https://github.com/DataLab-Platform/DataLab/issues/146))
fr: **Options de nettoyage de l'espace de travail** : Comportement configurable avec option "Ignorer" (ceci clôture [Issue #146](https://github.com/DataLab-Platform/DataLab/issues/146)).

source: **Text file improvements:**
fr: **Améliorations des fichiers texte :**

source: **CSV delimiter handling**: Better support for various whitespace separators
fr: Amélioration de la gestion des délimiteurs dans la lecture CSV (signaux) pour mieux prendre en charge les fichiers avec divers séparateurs d'espaces.

source: **Locale decimal separator**: Support for comma as decimal separator (closes [Issue #124](https://github.com/DataLab-Platform/DataLab/issues/124))
fr: **Séparateur décimal local** : Prise en charge de la virgule comme séparateur décimal (ceci clôture [Issue #124](https://github.com/DataLab-Platform/DataLab/issues/124))

source: **Encoding error tolerance**: Ignore errors for files with special characters
fr: **Tolérance aux erreurs d'encodage** : Ignorer les erreurs pour les fichiers avec des caractères spéciaux

source: **Header detection**: Automatic detection and skipping of data headers
fr: **Détection d'en-tête** : Détection et saut automatiques des en-têtes de données

source: **Other I/O features:**
fr: **Autres fonctionnalités d'E/S :**

source: **Save to directory**: New feature (closes [Issue #227](https://github.com/DataLab-Platform/DataLab/issues/227))
fr: **Enregistrer dans un répertoire** : Nouvelle fonctionnalité (ceci clôture [Issue #227](https://github.com/DataLab-Platform/DataLab/issues/227))

source: **Open from directory**: Recursively open multiple files with folder drag-and-drop support
fr: **Ouvrir depuis un répertoire** : Ouvrir récursivement plusieurs fichiers avec prise en charge du glisser-déposer de dossiers

source: **File ordering**: Consistent alphabetical sorting across platforms
fr: **Ordre d'importation des fichiers** : Correction de l'ordre incohérent des fichiers entre les plateformes lors de l'importation d'images/signaux

source: 🔧 Advanced Features
fr: 🔧 Fonctionnalités avancées

source: **Non-uniform coordinate support:**
fr: **Prise en charge des coordonnées non uniformes :**

source: Images now support non-uniform pixel spacing
fr: Les images prennent désormais en charge l'espacement de pixels non uniforme

source: "Set uniform coordinates" feature for conversion
fr: Nouvelle fonctionnalité "Définir les coordonnées uniformes" dans le menu Traitement > Transformation des axes :

source: **Polynomial calibration**: Up to cubic order for X, Y, Z axes
fr: Prend désormais en charge l'étalonnage polynomial jusqu'à l'ordre cubique pour tous les axes (X, Y, Z)

source: Creates non-uniform coordinates for X/Y, transforms values for Z
fr: Pour les axes X et Y : Crée des coordonnées non uniformes pour représenter les transformations polynomiales

source: HDF5 and text file formats preserve non-uniform information
fr: Le format HDF5 préserve les informations de coordonnées non uniformes

source: **Group management:**
fr: **Gestion des groupes :**

source: **Panel-specific short IDs**: `gs` prefix for signals, `gi` prefix for images
fr: **ID courts spécifiques au panneau** : Préfixe `gs` pour les signaux, préfixe `gi` pour les images
