Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/validation/functional.po
Languages: fr

source: Validation in DataLab, the open-source scientific data analysis and visualization platform
fr: Validation dans DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques

source: DataLab, scientific, data, analysis
fr: DataLab, scientifique, données, analyse

source: Functional validation
fr: Validation fonctionnelle

source: Strategy
fr: Stratégie

source: DataLab functional validation is based a classic test strategy, with a strong emphasis on automated testing. Apart from one or two manual tests (e.g. load test), all tests are automated (more than 99% of the tests are automated).
fr: La validation fonctionnelle de DataLab est basée sur une stratégie de test classique, avec un fort accent sur les tests automatisés. À l'exception d'un ou deux tests manuels (par exemple, un test de charge), tous les tests sont automatisés (plus de 99% des tests sont automatisés).

source: Writing tests follows the TDD (Test-Driven Development) principle:
fr: L'écriture des tests suit le principe TDD (Test-Driven Development) :

source: When *a new feature is developed*, the developer writes the tests first. The tests are then executed to ensure that they fail. The developer then implements the feature, and the tests are executed again to ensure that they pass.
fr: Losqu'une *nouvelle fonctionnalité* est développée, le développeur écrit d'abord les tests. Les tests sont ensuite exécutés pour s'assurer qu'ils échouent. Le développeur implémente ensuite la fonctionnalité, et les tests sont exécutés à nouveau pour s'assurer qu'ils réussissent.

source: When *a bug is reported*, the developer writes a test that reproduces the bug. The test is executed to ensure that it fails. The developer then fixes the bug, and the test is executed again to ensure that it passes.
fr: Lorsqu'un *bug est signalé*, le développeur écrit un test qui reproduit le bug. Le test est exécuté pour s'assurer qu'il échoue. Le développeur corrige ensuite le bug, et le test est exécuté à nouveau pour s'assurer qu'il réussit.

source: Depending on the abstraction level, unit tests and/or application tests are written. When writing both types of tests, the developer starts with the unit tests and then writes the application tests.
fr: Selon le niveau d'abstraction, des tests unitaires et/ou des tests d'application sont écrits. Lors de l'écriture des deux types de tests, le développeur commence par les tests unitaires puis écrit les tests d'application.

source: Types of tests
fr: Types de tests

source: The functional validation of DataLab is based on two main types of tests:
fr: La validation fonctionnelle de DataLab repose sur deux types principaux de tests :

source: **Unit tests** (test scripts named ``*_unit_test.py``): Test individual functions or methods. All unit tests are automated.
fr: Les **tests unitaires** (scripts de test nommés ``*_unit_test.py``) : testent les fonctions ou méthodes individuelles. Tous les tests unitaires sont automatisés.

source: **Application tests** (test scripts named ``*_app_test.py``): Test the interaction between components (integration tests), or the application as a whole. All application tests are automated.
fr: Les **tests applicatifs** (scripts de test nommés ``*_app_test.py``) : testent l'interaction entre les composants (tests d'intégration), ou l'application dans son ensemble. Tous les tests applicatifs sont automatisés.

source: Implementation
fr: Implémentation

source: The tests are implemented using the `pytest <https://docs.pytest.org/en/latest/>`_ framework. Many existing tests may be derived from to create new tests.
fr: Les tests sont implémentés en utilisant le framework `pytest <https://docs.pytest.org/en/latest/>`_. De nombreux tests existants peuvent être dérivés pour créer de nouveaux tests.

source: Executing tests
fr: Exécution des tests

source: To execute the tests, the developer uses the command line interface. See section :ref:`run_functional_validation_tests` for more information on how to run functional validation tests.
fr: Pour exécuter les tests, le développeur utilise l'interface en ligne de commande. Voir la section :ref:`run_functional_validation_tests` pour plus d'informations sur la façon d'exécuter les tests de validation fonctionnelle.
