Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/validation/technical.po
Languages: fr

source: Validation in DataLab, the open-source scientific data analysis and visualization platform
fr: Validation dans DataLab, la plateforme open-source d'analyse et de visualisation de données scientifiques

source: DataLab, scientific, data, analysis, validation, ground-truth, analytical
fr: DataLab, scientifique, données, analyse, validation, analytique

source: Technical Validation
fr: Validation technique

source: DataLab technical validation is based on two key concepts: **ground-truth data** and **analytical validation**.
fr: La validation technique de DataLab est basée sur deux concepts clés : les **données de référence** et la **validation analytique**.

source: Ground-truth data
fr: Données de référence

source: Ground-truth data is data that is known to be correct. It is used to validate the results of computational analysis.
fr: Les données de référence sont des données connues pour être correctes. Elles sont utilisées pour valider les résultats de l'analyse informatique.

source: In DataLab, ground-truth data may be obtained from a variety of sources, including:
fr: Dans DataLab, les données de référence peuvent être obtenues à partir de diverses sources, y compris :

source: Experimental data
fr: Données expérimentales

source: Simulated data
fr: Données simulées

source: Synthetic data
fr: Données synthétiques

source: Data from a trusted source
fr: Données provenant d'une source de confiance

source: Analytical validation
fr: Validation analytique

source: Analytical validation is the process of comparing the results of computational analysis to ground-truth data. This is done to ensure that the results are accurate and reliable.
fr: La validation analytique est le processus de comparaison des résultats de l'analyse informatique avec les données de référence. Cela est fait pour s'assurer que les résultats sont précis et fiables.

source: In DataLab, analytical validation is implemented using a variety of techniques, including:
fr: Dans DataLab, la validation analytique est mise en œuvre à l'aide de diverses techniques, y compris :

source: Cross-validation with an analytical model (from a trusted source, e.g. `SciPy <https://www.scipy.org/>`_ or `NumPy <https://numpy.org/>`_)
fr: Validation croisée avec un modèle analytique (provenant d'une source de confiance, par exemple `SciPy <https://www.scipy.org/>`_ ou `NumPy <https://numpy.org/>`_)

source: Statistical analysis
fr: Analyse statistique

source: Visual inspection
fr: Inspection visuelle

source: Expert review
fr: Examen par un expert

source: Scope
fr: Périmètre

source: The scope of technical validation in DataLab includes all compute functions that operate on DataLab's signal and image objects (i.e. :class:`sigima.objects.SignalObj` and :class:`sigima.objects.ImageObj`).
fr: Le périmètre de la validation technique dans DataLab inclut toutes les fonctions de calcul qui opèrent sur les objets de signal et d'image de DataLab (c'est-à-dire :class:`sigima.objects.SignalObj` et :class:`sigima.objects.ImageObj`).

source: This includes functions for (all functions are named ``compute_<function_name>``):
fr: Cela inclut des fonctions pour (toutes les fonctions sont nommées ``compute_<function_name>``) :

source: Signal processing (:mod:`sigima.computation.signal`)
fr: Le traitement du signal (:mod:`sigima.computation.signal`)

source: Image processing (:mod:`sigima.computation.image`)
fr: Le traitement d'image (:mod:`sigima.computation.image`)

source: Implementation
fr: Implémentation

source: The tests are implemented using the `pytest <https://docs.pytest.org/en/latest/>`_ framework.
fr: Les tests sont implémentés en utilisant le cadre `pytest <https://docs.pytest.org/en/latest/>`_.

source: When writing a new technical validation test, the following rules should be followed regarding the test function:
fr: Lors de l'écriture d'un nouveau test de validation technique, les règles suivantes doivent être suivies concernant la fonction de test :

source: The test function should be named:
fr: La fonction de test doit être nommée :

source: ``test_signal_<function_name>`` for signal compute functions
fr: ``test_signal_<function_name>`` pour les fonctions de calcul de signal

source: ``test_image_<function_name>`` for image compute functions
fr: ``test_image_<function_name>`` pour les fonctions de calcul d'image

source: The ``signal`` or ``image`` prefix is used to indicate the type of object that the function operates on. It may be omitted if the function operates exclusively on one type of object (e.g. ``test_adjust_gamma`` is the test function for the ``compute_adjust_gamma`` function, which operates on images).
fr: Le préfixe ``signal`` ou ``image`` est utilisé pour indiquer le type d'objet sur lequel la fonction opère. Il peut être omis si la fonction opère exclusivement sur un type d'objet (par exemple, ``test_adjust_gamma`` est la fonction de test pour la fonction ``compute_adjust_gamma``, qui opère sur des images).

source: The test function should be marked with the ``@pytest.mark.validation`` decorator.
fr: La fonction de test doit être marquée avec le décorateur ``@pytest.mark.validation``.

source: Following those rules ensures that:
fr: En suivant ces règles, on s'assure que :

source: The tests are easily identified as technical validation tests.
fr: Les tests sont facilement identifiés comme des tests de validation technique.

source: The tests can be executed separately using the command line interface (see :ref:`run_scientific_validation_tests`).
fr: Les tests peuvent être exécutés séparément à l'aide de l'interface en ligne de commande (voir :ref:`run_scientific_validation_tests`).

source: The tests are automatically discovered for synthetizing the validation status of the compute functions (see :ref:`validation_status`).
fr: Les tests sont automatiquement découverts pour synthétiser l'état de validation des fonctions de calcul (voir :ref:`validation_status`).

source: Executing tests
fr: Exécution des tests

source: In DataLab, technical validation tests are disseminated in the test suite of the project, but they can also be executed separately using the command line interface.
fr: Dans DataLab, les tests de validation technique sont disséminés dans la suite de tests du projet, mais ils peuvent également être exécutés séparément à l'aide de l'interface en ligne de commande.

source: See paragraph :ref:`run_scientific_validation_tests` for more information on how to run technical validation tests.
fr: Voir le paragraphe :ref:`run_scientific_validation_tests` pour plus d'informations sur la façon d'exécuter les tests de validation technique.
