Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/image/menu_analysis.po
Languages: fr

source: Analysis features on Images
fr: Analyse sur les images

source: This section describes the image analysis features available in DataLab.
fr: Cette section décrit les fonctionnalités d'analyse d'images disponibles dans DataLab.

source: :ref:`ima-menu-operations` for more information on operations that can be performed on images, or :ref:`ima-menu-processing` for information on processing features on images.
fr: :ref:`ima-menu-operations` pour plus d'informations sur les opérations pouvant être effectuées sur les images, ou :ref:`ima-menu-processing` pour des informations sur les fonctionnalités de traitement des images.

source: Screenshot of the "Analysis" menu.
fr: Capture d'écran du menu Analyse".

source: When the "Image Panel" is selected, the menus and toolbars are updated to provide image-related actions.
fr: Lorsque le "Panneau Image" est sélectionné, les menus et barres d'outils sont mis à jour pour fournir les actions liées aux images.

source: The "Analysis" menu allows you to perform various computations on the current image or group of images. It also allows you to compute statistics, to compute the centroid, to detect peaks, to detect contours, and so on.
fr: Le menu Analyse" permet d'effectuer divers calculs sur l'image courante ou sur un groupe d'images. Il permet également de calculer des statistiques, le barycentre, de détecter des pics, des contours, etc.

source: In DataLab vocabulary, an "analysis" is a feature that computes a scalar result from an image. This result is stored as metadata, and thus attached to image. This is different from a "processing" which creates a new image from an existing one.
fr: Dans le vocabulaire de DataLab, une "analyse" est une fonctionnalité de calcul d'un résultat scalaire à partir d'une image. Ce résultat est stocké sous la forme de métadonnées, et donc attaché à l'image. C'est différent d'un "traitement" qui crée une nouvelle image à partir d'une image existante.

source: Statistics
fr: Statistiques

source: Compute statistics on selected image and show a summary table.
fr: Calcule des statistiques sur les images sélectionnées et affiche un tableau récapitulatif.

source: Example of statistical summary table: each row is associated to an ROI (the first row gives the statistics for the whole data).
fr: Exemple de tableau récapitulatif de statistiques : chaque ligne est associée à une ROI (à l'exception de la première qui correspond aux statistiques calculées sur la totalité des données).

source: Histogram
fr: Histogramme

source: Compute histogram of selected image and show it in the Signal Panel.
fr: Calcule l'histogramme de l'image sélectionnée et l'affiche dans le panneau Signal.

source: Parameters are:
fr: Paramètres :

source: Parameter
fr: Paramètre

source: Bins
fr: Classes

source: Number of bins
fr: Nombre de classes

source: Lower limit
fr: Limite inférieure

source: Lower limit of the histogram
fr: Limite inférieure de l'histogramme

source: Upper limit
fr: Limite supérieure

source: Upper limit of the histogram
fr: Limite supérieure de l'histogramme

source: Example of histogram.
fr: Exemple d'histogramme.

source: Intensity profiles
fr: Profils d'intensité

source: Line profile
fr: Profil rectiligne

source: Extract an horizontal or vertical profile from each selected image, and create new signals from these profiles.
fr: Extraire un profil horizontal ou vertical de chaque image sélectionnée et créer un nouveau signal à partir de chacun de ces profils.

source: Line profile dialog. Parameters may also be set manually ("Edit profile parameters" button).
fr: Boîte de dialogue d'extraction de profil. Les paramètres peuvent être également définis manuellement (bouton "Editer les paramètres du profil").

source: Segment profile
fr: Profil le long d'un segment

source: Extract a segment profile from each selected image, and create new signals from these profiles.
fr: Extraire un profil le long d'un segment de chaque image sélectionnée et créer un nouveau signal à partir de chacun de ces profils.

source: Average profile
fr: Profil moyen

source: Extract an horizontal or vertical profile averaged over a rectangular area, from each selected image, and create new signals from these profiles.
fr: Extraire un profil horizontal ou vertical moyenné sur une zone rectangulaire de chaque image sélectionnée et créer un nouveau signal à partir de chacun de ces profils.

source: Average profile dialog: the area is defined by a rectangle shape. Parameters may also be set manually ("Edit profile parameters" button).
fr: Boîte de dialogue d'extraction de profil moyen : la zone est définie par un rectangle. Les paramètres peuvent être également définis manuellement (bouton "Editer les paramètres du profil").

source: Radial profile extraction
fr: Extraire un profil radial

source: Extract a radial profile from each selected image, and create new signals from these profiles.
fr: Extraire un profil radial de chaque image sélectionnée et créer un nouveau signal à partir de ces profils.

source: The following parameters are available:
fr: Les paramètres suivants sont disponibles :

source: Center
fr: Centre

source: Center around which the radial profile is computed: centroid, image center, or user-defined
fr: Centre autour duquel le profil radial est calculé : centre de masse, centre de l'image, ou défini par l'utilisateur

source: X coordinate of the center (if user-defined), in pixels
fr: Coordonnée X du centre (si défini par l'utilisateur), en pixels

source: Y coordinate of the center (if user-defined), in pixels
fr: Coordonnée Y du centre (si défini par l'utilisateur), en pixels

source: Horizontal and vertical projections
fr: Projections horizontale et verticale

source: Compute horizontal and vertical projection profiles:
fr: Calcule les profils de projection horizontale et verticale :

source: Horizontal projection: Sum the pixel values along each row (projection on the x-axis).
fr: Projection horizontale : somme des valeurs des pixels le long de chaque ligne (projection sur l'axe des x).

source: Vertical projection: Sum the pixel values along each column (projection on the y-axis).
fr: Projection verticale : somme des valeurs des pixels le long de chaque colonne (projection sur l'axe des y).

source: Centroid
fr: Barycentre

source: Compute the centroid of the image using a robust adaptive algorithm.
fr: Calcule le barycentre de l'image en utilisant un algorithme adaptatif robuste.

source: DataLab uses the :py:func:`sigima.tools.image.get_centroid_auto` function to estimate the image centroid.
fr: DataLab utilise la fonction :py:func:`sigima.tools.image.get_centroid_auto` pour estimer le barycentre de l'image.

source: This function combines the robustness of a Fourier-based approach (as discussed by `Weisshaar et al. <http://www.mnd-umwelttechnik.fh-wiesbaden.de/pig/weisshaar_u5.pdf>`_) with fallback mechanisms designed to handle pathological cases, such as:
fr: Cette fonction combine la robustesse d'une approche basée sur la transformée de Fourier (comme discuté par `Weisshaar et al. <http://www.mnd-umwelttechnik.fh-wiesbaden.de/pig/weisshaar_u5.pdf>`_) avec des mécanismes de secours conçus pour gérer les cas pathologiques, tels que :

source: truncated or asymmetric shapes,
fr: formes tronquées ou asymétriques,

source: off-center objects,
fr: objets décentrés,

source: strong background noise.
fr: bruit de fond important.

source: Internally, :py:func:`sigima.tools.image.get_centroid_auto` compares the Fourier result with two alternative estimators (a projected profile-based method :py:func:`sigima.tools.image.get_projected_profile_centroid` and a standard centroid from `scikit-image`), and selects the most consistent one.
fr: En interne, :py:func:`sigima.tools.image.get_centroid_auto` compare le résultat de Fourier avec deux estimateurs alternatifs (une méthode basée sur le profil projeté :py:func:`sigima.tools.image.get_projected_profile_centroid` et un barycentre standard de `scikit-image`), et sélectionne le plus cohérent.

source: This strategy ensures accurate and stable results across a wide range of image types — from clean laboratory data to noisy or partial acquisitions.
fr: Cette stratégie garantit des résultats précis et stables sur une large gamme de types d'images, allant des données de laboratoire propres aux acquisitions bruyantes ou partielles.

source: Minimum enclosing circle center
fr: Centre du cercle minimum

source: Compute the circle contour enclosing image values above a threshold level defined as the half-maximum value.
fr: Calcule le contour circulaire entourant les valeurs de l'image au-delà d'un seuil (moitié du maximum de l'image).

source: 2D peak detection
fr: Détection de pics 2D

source: Automatically find peaks on image using a minimum-maximum filter algorithm.
fr: Détecte automatiquement des pics sur une image en utilisant un algorithme basé sur des filtres minimum-maximum.

source: Example of 2D peak detection.
fr: Exemple de détection de pics 2D.

source: See :ref:`ref-to-2d-peak-detection` for more details on algorithm and associated parameters.
fr: Voir :ref:`ref-to-2d-peak-detection` pour plus de détails sur l'algorithme et les paramètres associés.

source: Contour detection
fr: Détection de contours

source: Automatically extract contours and fit them using a circle or an ellipse, or directly represent them as a polygon.
fr: Détecte automatiquement les contours et ajuste ces derniers par des cercles ou des ellipses, ou les représente directement par des polygones.

source: Example of contour detection.
fr: Exemple de détection de contours.

source: See :ref:`ref-to-contour-detection` for more details on algorithm and associated parameters.
fr: Voir :ref:`ref-to-contour-detection` pour plus de détails sur l'algorithme et les paramètres associés.

source: Computed scalar results are systematically stored as metadata. Metadata is attached to image and serialized with it when exporting current session in a HDF5 file.
fr: Les résultats de calcul scalaires sont systématiquement stockés dans les métadonnées. Les métadonnées sont attachées à l'image et sérialisées avec cette dernière par exemple lors de l'export d'une session de DataLab vers un fichier HDF5.

source: Circle Hough transform
fr: Transformée de Hough circulaire

source: Detect circular shapes using circle Hough transform (implementation based on `skimage.transform.hough_circle_peaks <https://scikit-image.org/docs/stable/api/skimage.transform.html?highlight=hough#skimage.transform.hough_circle_peaks>`_).
fr: Détection de formes circulaires à partir d'une tranformée de Hough (implémentation basée sur `skimage.transform.hough_circle_peaks <https://scikit-image.org/docs/stable/api/skimage.transform.html?highlight=hough#skimage.transform.hough_circle_peaks>`_)

source: Blob detection
fr: Détection de taches

source: Blob detection (DOG)
fr: Détection de taches (DOG)

source: Detect blobs using Difference of Gaussian (DOG) method (implementation based on `skimage.feature.blob_dog <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-dog>`_).
fr: Détection de taches basée sur la méthode de différence de gaussienne (DOG) (implementation basée sur `skimage.feature.blob_dog <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-dog>`_).

source: Blob detection (DOH)
fr: Détection de taches (hessien)

source: Detect blobs using Determinant of Hessian (DOH) method (implementation based on `skimage.feature.blob_doh <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-doh>`_).
fr: Détection de taches basée sur la méthode du discriminant hessien (implementation basée sur `skimage.feature.blob_doh <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-doh>`_).

source: Blob detection (LOG)
fr: Détection de taches (LOG)

source: Detect blobs using Laplacian of Gaussian (LOG) method (implementation based on `skimage.feature.blob_log <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-log>`_).
fr: Détection de taches basée sur la méthode du laplacien de gaussienne (LOG) (implementation basée sur `skimage.feature.blob_log <https://scikit-image.org/docs/stable/api/skimage.feature.html#blob-log>`_).

source: Blob detection (OpenCV)
fr: Détection de taches (OpenCV)

source: Detect blobs using OpenCV implementation of `SimpleBlobDetector <https://docs.opencv.org/3.4/d0/d7a/classcv_1_1SimpleBlobDetector.html>`_.
fr: Détection de taches basée sur l'implémentation OpenCV de `SimpleBlobDetector <https://docs.opencv.org/3.4/d0/d7a/classcv_1_1SimpleBlobDetector.html>`_.

source: **Automatic ROI creation for detection features**
fr: **Création automatique de ROIs pour les fonctionnalités de détection**

source: All detection features (2D peak detection, contour detection, circle Hough transform, and blob detection) support automatic ROI creation around detected objects. This feature:
fr: Toutes les fonctionnalités de détection (détection de pics 2D, détection de contours, transformée de Hough circulaire et détection de taches) prennent en charge la création automatique de ROIs autour des objets détectés. Cette fonctionnalité :

source: Creates rectangular or circular ROIs around each detected feature
fr: Crée des ROIs rectangulaires ou circulaires autour de chaque objet détecté

source: Automatically sizes ROIs based on minimum distance between detections
fr: Dimensionne automatiquement les ROIs en fonction de la distance minimale entre les détections

source: Requires at least 2 detected objects to determine appropriate ROI size
fr: Nécessite au moins 2 objets détectés pour déterminer la taille appropriée de la ROI

source: Enables subsequent processing on individual detected regions
fr: Permet le traitement ultérieur des régions détectées individuellement

source: To use this feature, enable "Create regions of interest" in the detection parameters dialog and choose the desired ROI geometry.
fr: Pour utiliser cette fonctionnalité, activez "Créer des régions d'intérêt" dans la boîte de dialogue des paramètres de détection et choisissez la géométrie de ROI souhaitée.

source: Show results
fr: Afficher les résultats

source: Show the results of all analyses performed on the selected images. This shows the same table as the one shown after having performed a computation.
fr: Affiche les résultats de toutes les analyses effectuées sur les images sélectionnées. Cela affiche le même tableau que celui affiché après avoir effectué un calcul.

source: Results label
fr: Étiquette des résultats

source: Toggle the visibility of result labels on the plot. When enabled, this checkable menu item displays result annotations (such as centroid markers, detected contours, blob circles, or other analysis shapes) directly on the image plot.
fr: Active ou désactive la visibilité des étiquettes de résultats sur le graphique. Lorsqu'il est activé, cet élément de menu cochable affiche les annotations des résultats (telles que les marqueurs de centroïde, les contours détectés, les cercles de taches ou d'autres formes d'analyse) directement sur le graphique de l'image.

source: This option is synchronized between Signal and Image panels and persists across sessions. It is only enabled when results are available for the selected image.
fr: Cette option est synchronisée entre les panneaux Signal et Image et persiste entre les sessions. Elle n'est activée que lorsque des résultats sont disponibles pour l'image sélectionnée.

source: Plot results
fr: Tracer les résultats

source: Plot the results of analyses performed on the selected images, with user-defined X and Y axes (e.g. plot the contour circle radius as a function of the image number).
fr: Trace les résultats des analyses effectuées sur les images sélectionnées, avec des axes X et Y définis par l'utilisateur (p.ex. trace le rayon du cercle de contour en fonction du numéro de l'image).
