Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/image/menu_view.po
Languages: fr

source: View options for Images
fr: Options d'affichage pour les images

source: Screenshot of the "View" menu.
fr: Capture d'écran du menu "Affichage".

source: When the "Image Panel" is selected, the menus and toolbars are updated to provide image-related actions.
fr: Lorsque le "Panneau Image" est sélectionné, les menus et barres d'outils sont mis à jour pour fournir les actions liées aux images.

source: The "View" menu allows you to visualize the current image or group of images. It also allows you to show/hide titles, to show/hide the contrast panel, to refresh the visualization, and so on.
fr: Le menu "Affichage" permet de visualiser l'image courante ou un groupe d'images. Il permet également d'afficher/cacher les titres, d'afficher/cacher le panneau de contraste, de rafraîchir la visualisation, etc.

source: View in a new window
fr: Voir dans une nouvelle fenêtre

source: Open a new window to visualize the selected images.
fr: Ouvre une nouvelle fenêtre pour visualiser les images sélectionnées.

source: This option allows you to show the selected images in a separate window, in which you can visualize the data more comfortably (e.g., by maximizing the window) as well as to add or edit annotations.
fr: Cette option permet d'afficher les images sélectionnées dans une nouvelle fenêtre, dans laquelle vous pouvez visualiser les données plus confortablement (par exemple, en maximisant la fenêtre) et ajouter ou modifier des annotations.

source: When you click on the button "Annotations" in the toolbar of the new window, the annotation editing mode is activated (see the section "Edit annotations" below).
fr: Lorsque vous cliquez sur le bouton "Annotations" dans la barre d'outils de la nouvelle fenêtre, le mode d'édition des annotations est activé (voir la section "Modifier les annotations" ci-dessous).

source: Edit annotations
fr: Modifier les annotations

source: Open a new window to edit annotations.
fr: Ouvre une nouvelle fenêtre pour modifier les annotations.

source: This option allows you to edit the annotations of the selected images in a separate window. This is equivalent to select the "View in a new window" option and then click on the "Annotations" button in the toolbar of the new window.
fr: Cette option vous permet de modifier les annotations des images sélectionnées dans une fenêtre séparée. Cela équivaut à sélectionner l'option "Voir dans une nouvelle fenêtre" puis à cliquer sur le bouton "Annotations" dans la barre d'outils de la nouvelle fenêtre.

source: Annotations are used to add text, lines, rectangles, ellipses, and other geometrical shapes to the images. They are useful to highlight regions of interest, to add comments, to mark points, and so on.
fr: Les annotations sont utilisées pour ajouter du texte, des lignes, des rectangles, des ellipses et d'autres formes géométriques aux images. Elles sont utiles pour mettre en évidence des régions d'intérêt, ajouter des commentaires, marquer des points, etc.

source: The annotations are saved in the metadata of the image, so they are persistent and will be displayed every time you visualize the image.
fr: Les annotations sont enregistrées dans les métadonnées de l'image, elles sont donc persistantes et seront affichées chaque fois que vous visualiserez l'image.

source: Annotations may be added in the separate view.
fr: Les annotations peuvent être ajoutées dans la vue séparée.

source: The typical workflow to edit annotations is as follows:
fr: Le mode opératoire typique pour modifier les annotations est le suivant :

source: Select the "Edit annotations" option.
fr: Sélectionnez l'option "Modifier les annotations".

source: In the new window, add annotations by clicking on the corresponding buttons at the bottom of the window.
fr: Dans la nouvelle fenêtre, ajoutez des annotations en cliquant sur les boutons correspondants en bas de la fenêtre.

source: Eventually, customize the annotations by changing their properties (e.g., the text, the color, the position, etc.) using the "Parameters" option in the context menu of the annotations.
fr: Personnalisez les annotations en modifiant leurs propriétés (par exemple, le texte, la couleur, la position, etc.) en utilisant l'option "Paramètres" dans le menu contextuel des annotations.

source: When you are done, click on the "OK" button to save the annotations. This will close the window and the annotations will be saved in the metadata of the image and will be displayed in the main window.
fr: Quand vous avez terminé, cliquez sur le bouton "OK" pour enregistrer les annotations. Cela fermera la fenêtre et les annotations seront enregistrées dans les métadonnées de l'image et seront affichées dans la fenêtre principale.

source: Annotations are now part of the image metadata.
fr: Les annotations font désormais partie des métadonnées de l'image.

source: Annotations may be copied from an image to another by using the "copy/paste metadata" features.
fr: Les annotations peuvent être copiées d'une image à une autre en utilisant les fonctionnalités "copier/coller les métadonnées".

source: Auto-refresh
fr: Rafraîchissement automatique

source: Automatically refresh the visualization when the data changes:
fr: Rafraîchit automatiquement la visualisation quand les données changent :

source: When enabled (default), the plot view is automatically refreshed when the data changes.
fr: Si activé (par défaut), la visualisation est automatiquement rafraîchie quand les données changent.

source: When disabled, the plot view is not refreshed until you manually refresh it by using the "Refresh manually" menu entry.
fr: Si désactivé, la visualisation n'est pas rafraîchie tant que vous ne l'avez pas rafraîchie manuellement en utilisant l'entrée de menu "Rafraîchir manuellement".

source: Even though the refresh algorithm is optimized, it may still take some time to refresh the plot view when the data changes, especially when the data set is large. Therefore, you may want to disable the auto-refresh feature when you are working with large data sets, and enable it again when you are done. This will avoid unnecessary refreshes.
fr: Même si l'algorithme de rafraîchissement est optimisé, il peut prendre du temps pour rafraîchir la visualisation quand les données changent, surtout quand le jeu de données est grand. Par conséquent, vous pouvez désactiver le rafraîchissement automatique quand vous travaillez avec des données volumineuses, et l'activer à nouveau quand vous avez terminé. Cela évitera des rafraîchissements inutiles.

source: Refresh manually
fr: Rafraîchir manuellement

source: Refresh the visualization manually.
fr: Rafraîchir la visualisation manuellement.

source: This triggers a refresh of the plot view. It is useful when the auto-refresh feature is disabled, or when you want to force a refresh of the plot view.
fr: Cela déclenche un rafraîchissement de la visualisation. C'est utile quand le rafraîchissement automatique est désactivé, ou quand vous voulez forcer un rafraîchissement de la visualisation.

source: Show contrast panel
fr: Afficher le panneau de contraste

source: Show/hide contrast adjustment panel.
fr: Affiche/cache le panneau de réglage du contraste.

source: Show graphical object titles
fr: Afficher les titres des objets graphiques

source: Show/hide titles of analysis results or annotations.
fr: Affiche/cache les titres des objets graphiques liés aux résultats d'analyse et aux annotations.

source: This option allows you to show or hide the titles of the graphical objects (e.g., the titles of the analysis results or annotations). Hiding the titles can be useful when you want to visualize the data without any distractions, or if there are too many titles and they are overlapping.
fr: Cette option vous permet d'afficher ou de masquer les titres des objets graphiques (par exemple, les titres des résultats d'analyse ou des annotations). Masquer les titres peut être utile lorsque vous voulez visualiser les données sans être perturbé, ou s'il y a trop de titres et qu'ils se chevauchent.
