Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/image/menu_roi.po
Languages: fr

source: Regions Of Interest (ROI)
fr: Régions d'intérêt (ROI)

source: This section describes how to manipulate Regions Of Interest (ROIs) for images in DataLab.
fr: Cette section décrit comment manipuler les régions d'intérêt (ROIs) pour les images dans DataLab.

source: Screenshot of the "ROI" menu.
fr: Capture d'écran du menu "ROI".

source: The "ROI" menu allows you to manage Regions Of Interest (ROIs) associated with the current image.
fr: Le menu "ROI" vous permet de gérer les régions d'intérêt (ROIs) associées à l'image actuelle.

source: For more information about image metadata, see the :ref:`ima-menu-edit` section.
fr: Pour plus d'informations sur les métadonnées d'image, voir la section :ref:`ima-menu-edit`.

source: The Regions Of Interest (ROI) are image areas that are defined by the user to perform specific operations, processing, or analysis on them.
fr: Les régions d'intérêt (ROI) sont des zones d'image définies par l'utilisateur pour effectuer des opérations spécifiques, des traitements ou des analyses sur elles.

source: ROI are taken into account almost in all computing features in DataLab:
fr: Les ROI sont prises en compte dans presque toutes les fonctionnalités de calcul de DataLab :

source: The "Operations" menu features are done only on the ROI if one is defined (except if the operation changes the data shape - like the resize operation - or the pixel size - like the binning operation).
fr: Les fonctionnalités du menu "Opérations" sont appliquées uniquement sur la ROI si elle est définie (sauf si l'opération modifie la forme des données - comme l'opération de redimensionnement - ou la taille des pixels - comme l'opération de binning).

source: The "Processing" menu actions are performed only on the ROI if one is defined (except if the destination signal data type is different from the source's, like in the Fourier analysis features or like the thresholding operations).
fr: Les actions du menu "Traitement" sont effectuées uniquement sur la ROI si elle est définie (sauf si le type de données du signal de destination est différent de celui de la source, comme dans les fonctionnalités d'analyse de Fourier ou comme dans les opérations de seuillage).

source: The "Analysis" menu actions are done only on the ROI if one is defined.
fr: Les actions du menu "Analyse" sont effectuées uniquement sur la ROI si elle est définie.

source: ROI are stored as metadata, and thus attached to image.
fr: Les ROI sont stockées en tant que métadonnées et sont donc attachées à l'image.

source: The "ROI" menu allows you to:
fr: Le menu "ROI" vous permet de :

source: "Edit" |roi|: open a dialog box to manage ROI associated with the selected image (add, remove, move, resize, etc.). The ROI definition dialog is exactly the same as ROI extraction (see below).
fr: "Modifier" |roi| : ouvrir une boîte de dialogue pour gérer les ROI associées à l'image sélectionnée (ajouter, supprimer, déplacer, redimensionner, etc.). La boîte de dialogue de définition des ROI est exactement la même que celle de l'extraction des ROI (voir ci-dessous).

source: An image with an ROI.
fr: Une image avec une ROI.

source: "Extract" |image_roi|: extract the defined ROI from the selected images. This will create a new image for each ROI (or a single image, if the "Extract all ROIs into a single image" option is selected in the dialog), with the same metadata as the original image, but with the data corresponding to the ROI only. The new images will be added to the current workspace.
fr: "Extraire" |image_roi| : extraire la ROI définie des images sélectionnées. Cela créera une nouvelle image pour chaque ROI (ou une seule image, si l'option "Extraire toutes les ROIs dans une seule image" est sélectionnée dans la boîte de dialogue), avec les mêmes métadonnées que l'image d'origine, mais avec les données correspondant uniquement à la ROI. Les nouvelles images seront ajoutées à l'espace de travail actuel.

source: "Copy" |roi_copy|: copy the defined ROI from the selected images to the clipboard. This allows you to paste the ROI into another image or use it in other operations.
fr: "Copier" |roi_copy| : copier la ROI définie des images sélectionnées dans le presse-papiers. Cela vous permet de coller la ROI dans une autre image ou de l'utiliser dans d'autres opérations.

source: "Paste" |roi_paste|: paste the copied ROI from the clipboard to the selected images. This will add the ROI to the images, allowing you to define or modify ROIs based on previously copied ones.
fr: "Coller" |roi_paste| : coller la ROI copiée du presse-papiers dans les images sélectionnées. Cela ajoutera la ROI aux images, vous permettant de définir ou de modifier des ROI en fonction de celles précédemment copiées.

source: "Import" |roi_import|: import ROIs from a file. This allows you to load previously saved ROIs into the current image.
fr: "Importer" |roi_import| : importer des ROI à partir d'un fichier. Cela vous permet de charger des ROI précédemment enregistrées dans l'image actuelle.

source: "Export" |roi_export|: export the defined ROIs to a file. This allows you to save the ROIs for later use or to share them with others.
fr: "Exporter" |roi_export| : exporter les ROI définies vers un fichier. Cela vous permet de sauvegarder les ROI pour une utilisation ultérieure ou de les partager avec d'autres.

source: "Remove all" |roi_delete|: remove all defined ROI for the selected images.
fr: "Supprimer tout" |roi_delete| : supprimer toutes les ROI définies pour les images sélectionnées.

source: ROI extraction dialog: the ROI is defined by moving the position and adjusting the size of a rectangle shape.
fr: Boîte de dialogue d'extraction des ROI : la ROI est définie en déplaçant la position et en ajustant la taille d'une forme rectangulaire.
