Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/features/image/menu_edit.po
Languages: fr

source: Manipulate metadata and annotations
fr: Manipuler les métadonnées et les annotations

source: This section describes how to manipulate metadata and annotations in DataLab.
fr: Cette section décrit comment manipuler les métadonnées et les annotations dans DataLab.

source: Image metadata contains various information about the image or its representation, such as view settings, Regions Of Interest (ROIs), processing chain history, analysis results, and any other information that you may have added to the metadata of an image (or that comes from the image file itself).
fr: Les métadonnées d'une image contiennent diverses informations sur l'image ou sa représentation, telles que les paramètres d'affichage, les régions d'intérêt (ROIs), l'historique de la chaîne de traitement, les résultats d'analyse et toute autre information que vous avez pu ajouter aux métadonnées d'une image (ou qui provient du fichier image lui-même).

source: For more information about Regions Of Interest (ROIs), see the :ref:`ima-menu-roi` section.
fr: Pour plus d'informations sur les régions d'intérêt (ROIs), voir la section :ref:`ima-menu-roi`.

source: Screenshot of the "Edit" menu.
fr: Capture d'écran du menu "Édition".

source: The "Edit" menu allows you to perform classic editing operations on the current image or group of images (create/rename group, move up/down, delete image/group of images, etc.).
fr: Le menu "Édition" vous permet d'effectuer des opérations d'édition classiques sur l'image ou le groupe d'images actuel (créer/renommer un groupe, déplacer vers le haut/vers le bas, supprimer l'image/le groupe d'images, etc.).

source: As detailed below, it also allows you to:
fr: Comme détaillé ci-dessous, il vous permet également de :

source: Navigate and utilize the processing chain history through actions like "Recompute" and "Select source objects".
fr: Naviguer et utiliser l'historique de la chaîne de traitement grâce à des actions telles que "Recalculer" et "Sélectionner les objets sources".

source: Manipulate metadata and annotations associated with the current image, thanks to the "Metadata" and "Annotations" submenus which provide the following features.
fr: Manipuler les métadonnées et les annotations associées à l'image actuelle, grâce aux sous-menus "Métadonnées" et "Annotations" qui offrent les fonctionnalités suivantes.

source: Recompute
fr: Recalculer

source: The "Recompute" |recompute| action allows you to recompute the selected image(s) using their original processing parameters. This is useful when you want to re-execute the processing chain that was used to create an image, for example after modifying global settings or dependencies.
fr: L'action "Recalculer" |recompute| vous permet de recalculer l'image (ou les images) sélectionnée(s) en utilisant leurs paramètres de traitement d'origine. Cela est utile lorsque vous souhaitez réexécuter la chaîne de traitement qui a été utilisée pour créer une image, par exemple après avoir modifié les paramètres globaux ou les dépendances.

source: This action is only available for images that were created through processing operations and have stored processing parameters.
fr: Cette action n'est disponible que pour les images qui ont été créées par des opérations de traitement et qui ont des paramètres de traitement stockés.

source: Select source objects
fr: Sélectionner les objets sources

source: The "Select source objects" |goto_source| action allows you to select the source object(s) that were used to create the currently selected image. This helps trace back the processing history and understand which original images were used as input for the current result.
fr: L'action "Sélectionner les objets sources" |goto_source| vous permet de sélectionner l'objet (ou les objets) sources qui ont été utilisés pour créer l'image actuellement sélectionnée. Cela aide à retracer l'historique de traitement et à comprendre quelles images d'origine ont été utilisées comme entrée pour le résultat actuel.

source: This action is only available when exactly one image is selected and that image has source object references.
fr: Cette action n'est disponible que lorsqu'une seule image est sélectionnée et que cette image possède des références d'objets sources.

source: Metadata
fr: Métadonnées

source: Screenshot of the "Metadata" submenu.
fr: Capture d'écran du sous-menu "Métadonnées".

source: Copy/paste metadata
fr: Copier/coller les métadonnées

source: As metadata contains useful information about the image, it can be copied and pasted from one image to another by selecting the "Copy metadata" |metadata_copy| and "Paste metadata" |metadata_paste| actions in the "Edit" menu.
fr: Compte tenu du fait que les métadonnées contiennent des informations utiles sur l'image, elles peuvent être copiées et collées d'une image à une autre en sélectionnant les actions "Copier les métadonnées" |metadata_copy| et "Coller les métadonnées" |metadata_paste| dans le menu "Édition".

source: This feature allows you to tranfer those information from one image to another:
fr: Cette fonctionnalité vous permet de transférer ces informations d'une image à une autre :

source: :ref:`Regions Of Interest (ROIs) <ima-menu-roi>`: that is a very efficient way to reuse the same ROI on different images and easily compare the results of the analysis on those images
fr: :ref:`Régions d'intérêt (ROIs) <ima-menu-roi>` : c'est un moyen très efficace de réutiliser la même ROI sur différentes images et de comparer facilement les résultats de l'analyse sur ces images

source: Analyze results, such as a centroid position or a contour detection (the relevance of transferring such information depends on the context and is up to the user to decide)
fr: Résultats de calcul, tels qu'une position de barycentre ou une détection de contour (la pertinence du transfert de ces informations dépend du contexte et il appartient à l'utilisateur d'en décider)

source: Any other information that you may have added to the metadata of an image
fr: Toute autre information que vous avez pu ajouter aux métadonnées d'une image

source: Copying metadata from an image to another will overwrite the metadata of the destination image (for the metadata keys that are common to both images) or simply add the metadata keys that are not present in the destination image.
fr: Copier les métadonnées d'une image à une autre écrasera les métadonnées de l'image de destination (pour les clés de métadonnées communes aux deux images) ou ajoutera simplement les clés de métadonnées qui ne sont pas présentes dans l'image de destination.

source: Import/export metadata
fr: Importer/exporter les métadonnées

source: Metadata can also be imported and exported from/to a JSON file using the "Import metadata" |metadata_import| and "Export metadata" |metadata_export| actions in the "Edit" menu. This is exactly the same as the copy/paste metadata feature (see above for more details on the use cases of this feature), but it allows you to save the metadata to a file and then import it back later.
fr: Les métadonnées peuvent également être importées et exportées depuis/vers un fichier JSON en utilisant les actions "Importer les métadonnées" |metadata_import| et "Exporter les métadonnées" |metadata_export| dans le menu "Édition". C'est exactement la même chose que la fonctionnalité de copier/coller des métadonnées (voir ci-dessus pour plus de détails sur les cas d'utilisation de cette fonctionnalité), mais cela vous permet de sauvegarder les métadonnées dans un fichier et de les importer ultérieurement.

source: Delete metadata
fr: Supprimer les métadonnées

source: When deleting metadata using the "Delete metadata" |metadata_delete| action in the "Edit" menu, you will be prompted to confirm the deletion of Region of Interests (ROIs) if they are present in the metadata. After this eventual confirmation, the metadata will be deleted, meaning that analysis results, ROIs, and any other information associated with the image will be lost.
fr: Lors de la suppression des métadonnées en utilisant l'action "Supprimer les métadonnées" |metadata_delete| dans le menu "Édition", vous serez invité à confirmer la suppression des régions d'intérêt (ROIs) si elles sont présentes dans les métadonnées. Après cette confirmation éventuelle, les métadonnées seront supprimées, ce qui signifie que les résultats d'analyse, les ROIs et toute autre information associée à l'image seront perdus.

source: Add metadata
fr: Ajouter des métadonnées

source: The "Add metadata" |metadata_add| action allows you to add custom metadata items to one or more selected images. This is useful for tagging images with experiment IDs, sample names, processing steps, or any other custom information.
fr: L'action "Ajouter des métadonnées" |metadata_add| vous permet d'ajouter des éléments de métadonnées personnalisés à une ou plusieurs images sélectionnées. Cela est utile pour étiqueter les images avec des identifiants d'expérience, des noms d'échantillons, des étapes de traitement ou toute autre information personnalisée.

source: Add metadata dialog.
fr: Boîte de dialogue Ajouter des métadonnées.

source: When you select "Add metadata..." from the Edit menu, a dialog appears where you can:
fr: Lorsque vous sélectionnez "Ajouter des métadonnées..." dans le menu Édition, une boîte de dialogue apparaît où vous pouvez :

source: **Metadata key**: Enter the name of the metadata field to add
fr: **Clé de métadonnées** : Entrez le nom du champ de métadonnées à ajouter

source: **Value pattern**: Define a pattern for the metadata value using Python format strings
fr: **Modèle de valeur** : Définir un modèle pour la valeur des métadonnées en utilisant des chaînes de format Python

source: **Conversion**: Choose how to store the value (string, float, integer, or boolean)
fr: **Conversion** : Choisissez comment stocker la valeur (chaîne, flottant, entier ou booléen)

source: **Preview**: See how the metadata will be added to each selected image
fr: **Aperçu** : Voir comment les métadonnées seront ajoutées à chaque image sélectionnée

source: The value pattern supports the following placeholders:
fr: Le modèle de valeur prend en charge les espaces réservés suivants :

source: ``{title}``: Image title
fr: ``{title}`` : Titre de l'image

source: ``{index}``: 1-based index of the image in the selection
fr: ``{index}`` : Index basé sur 1 de l'image dans la sélection

source: ``{count}``: Total number of selected images
fr: ``{count}`` : Nombre total d'images sélectionnées

source: ``{xlabel}``, ``{xunit}``, ``{ylabel}``, ``{yunit}``: Axis labels and units
fr: ``{xlabel}``, ``{xunit}``, ``{ylabel}``, ``{yunit}`` : Étiquettes et unités des axes

source: ``{metadata[key]}``: Access existing metadata values
fr: ``{metadata[key]}`` : Accéder aux valeurs de métadonnées existantes

source: You can also use format modifiers:
fr: Vous pouvez également utiliser des modificateurs de format :

source: ``{title:upper}``: Convert to uppercase
fr: ``{title:upper}`` : Convertir en majuscules

source: ``{title:lower}``: Convert to lowercase
fr: ``{title:lower}`` : Convertir en minuscules

source: ``{index:03d}``: Format as 3-digit number with leading zeros
fr: ``{index:03d}`` : Formater en nombre à 3 chiffres avec des zéros devant

source: **Examples:**
fr: **Exemples :**

source: Add acquisition number: key=``acquisition``, pattern=``ACQ_{index:04d}``, conversion=string → Creates metadata like ``acquisition="ACQ_0001"``
fr: Ajouter le numéro d'acquisition : clé=``acquisition``, modèle=``ACQ_{index:04d}``, conversion=chaîne → Crée des métadonnées comme ``acquisition="ACQ_0001"``

source: Add exposure time: key=``exposure_ms``, pattern=``{metadata[exposure]}``, conversion=float → Copies exposure from existing metadata and converts to float
fr: Ajouter le temps d'exposition : clé=``exposure_ms``, modèle=``{metadata[exposure]}``, conversion=float → Copie l'exposition des métadonnées existantes et la convertit en float

source: Flag calibrated images: key=``is_calibrated``, pattern=``true``, conversion=bool → Sets ``is_calibrated=True`` for all selected images
fr: Identifier les images étalonnées : clé=``is_calibrated``, modèle=``true``, conversion=bool → Définit ``is_calibrated=True`` pour toutes les images sélectionnées.

source: Annotations are visual elements that can be added to images to highlight specific features, mark regions of interest, or add explanatory notes. DataLab provides a dedicated submenu in the "Edit" menu for managing annotations.
fr: Les annotations sont des éléments visuels qui peuvent être ajoutés aux images pour mettre en évidence des caractéristiques spécifiques, marquer des régions d'intérêt ou ajouter des notes explicatives. DataLab propose un sous-menu dédié dans le menu "Édition" pour gérer les annotations.

source: Screenshot of the "Annotations" submenu.
fr: Capture d'écran du sous-menu "Annotations".

source: Copy/paste annotations
fr: Copier/coller les annotations

source: Annotations can be copied from one image and pasted to one or more other images using the "Copy annotations" |annotations_copy| and "Paste annotations" |annotations_paste| actions. This is useful when you want to apply the same visual markers across multiple images.
fr: Les annotations peuvent être copiées d'une image et collées sur une ou plusieurs autres images en utilisant les actions "Copier les annotations" |annotations_copy| et "Coller les annotations" |annotations_paste|. Cela est utile lorsque vous souhaitez appliquer les mêmes marqueurs visuels à plusieurs images.

source: The "Paste annotations" action is only enabled when there are annotations in the clipboard (i.e., after using "Copy annotations").
fr: L'action "Coller les annotations" n'est activée que lorsqu'il y a des annotations dans le presse-papiers (c'est-à-dire après avoir utilisé "Copier les annotations").

source: The "Edit annotations" |annotations_edit| action opens a dialog where you can view, add, modify, or remove annotations from the current image. This provides a visual way to manage all annotations on an image.
fr: L'action "Éditer les annotations" |annotations_edit| ouvre une boîte de dialogue où vous pouvez visualiser, ajouter, modifier ou supprimer des annotations de l'image actuelle. Cela offre un moyen visuel de gérer toutes les annotations sur une image.

source: Import/export annotations
fr: Importer/exporter les annotations

source: Annotations can be saved to and loaded from JSON files (.dlabann extension) using the "Import annotations" |annotations_import| and "Export annotations" |annotations_export| actions. This allows you to:
fr: Les annotations peuvent être enregistrées et chargées à partir de fichiers JSON (extension .dlabann) en utilisant les actions "Importer les annotations" |annotations_import| et "Exporter les annotations" |annotations_export|. Cela vous permet de :

source: Save annotation sets for later reuse
fr: Enregistrer des ensembles d'annotations pour une réutilisation ultérieure

source: Share annotations with colleagues
fr: Partager des annotations avec des collègues

source: Archive annotations separately from image data
fr: Archiver les annotations séparément des données d'image

source: Apply the same annotations to different images across sessions
fr: Appliquer les mêmes annotations à différentes images au cours des sessions

source: The "Export annotations" action is only available when the selected image has annotations.
fr: L'action "Exporter les annotations" n'est disponible que lorsque l'image sélectionnée a des annotations.

source: Delete annotations
fr: Supprimer les annotations

source: The "Delete annotations" |annotations_delete| action removes all annotations from the selected image(s). This action is only enabled when the selected image(s) have annotations.
fr: L'action "Supprimer les annotations" |annotations_delete| supprime toutes les annotations des images sélectionnées. Cette action n'est activée que lorsque les images sélectionnées ont des annotations.

source: Annotations are stored separately from metadata and analysis results. Deleting annotations does not affect ROIs or other metadata items.
fr: Les annotations sont stockées séparément des métadonnées et des résultats d'analyse. La suppression des annotations n'affecte pas les ROIs ou d'autres éléments de métadonnées.

source: Image titles
fr: Titres des images

source: Image titles may be considered as metadata from a user point of view, even if they are not stored in the metadata of the image (but in an attribute of the image object).
fr: Les titres des images peuvent être considérés comme des métadonnées du point de vue de l'utilisateur, même s'ils ne sont pas stockés dans les métadonnées de l'image (mais dans un attribut de l'objet image).

source: The "Edit" menu allows you to:
fr: Le menu "Édition" vous permet de :

source: "Add object title to plot": this action will add a label on top of the image with its title, which might be useful in combination with the "Distribute on a grid" operation (see :ref:`ima-menu-operations`) to easily identify the images.
fr: "Ajouter le titre de l'objet au graphique" : cette action ajoutera une étiquette en haut de l'image avec son titre, ce qui peut être utile en combinaison avec l'opération "Distribuer sur une grille" (voir :ref:`ima-menu-operations`) pour identifier facilement les images.

source: "Copy titles to clipboard" |copy_titles|: this action will copy the titles of the selected images to the clipboard, which might be useful to paste them in a text editor or in a spreadsheet.
fr: "Copier les titres dans le presse-papiers" |copy_titles| : cette action copiera les titres des images sélectionnées dans le presse-papiers, ce qui peut être utile pour les coller dans un éditeur de texte ou dans un tableur.

source: Example of the content of the clipboard:
fr: Exemple du contenu du presse-papiers :
