Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/outreach/index.po
Languages: fr

source: DataLab conference presentations and event participation
fr: Présentations de DataLab en conférence et participation à des événements

source: DataLab, conferences, presentations, talks, events, SciPy, PyData, Open Source Experience
fr: DataLab, conférences, présentations, talks, événements, SciPy, PyData, Open Source Experience

source: Talks & Events
fr: Conférences & Événements

source: DataLab has been presented at various conferences and events to share its capabilities with the scientific and open-source communities. This section showcases our presence at major conferences.
fr: DataLab a été présenté lors de diverses conférences et événements pour partager ses capacités avec les communautés scientifique et open-source. Cette section met en avant notre présence lors de grandes conférences.

source: Conference Presentations
fr: Présentations en conférence

source: Since its public release, DataLab has been introduced at several prestigious conferences in the scientific Python and open-source ecosystems:
fr: Depuis sa sortie publique, DataLab a été présenté lors de plusieurs conférences prestigieuses dans les écosystèmes Python scientifique et open-source :

source: **Tacoma, Washington, USA - July 2024**
fr: **Tacoma, Washington, États-Unis - Juillet 2024**

source: DataLab's international debut at the largest scientific Python conference
fr: Début international de DataLab à la plus grande conférence Python scientifique

source: **Paris, France - September 2024**
fr: **Paris, France - Septembre 2024**

source: In-depth presentation of DataLab's capabilities and use cases
fr: Présentation approfondie des capacités et des cas d'utilisation de DataLab

source: **Paris, France - December 2024**
fr: **Paris, France - Décembre 2024**

source: Showcasing DataLab in the broader open-source ecosystem
fr: Mise en avant de DataLab dans l'écosystème open-source plus large

source: **Paris, France - December 2025**
fr: **Paris, France - Décembre 2025**

source: Advanced use case: Automatic X-ray scene reconstruction with DataLab
fr: Cas d'utilisation avancé : Reconstruction automatique de scènes X-ray avec DataLab

source: Why Present DataLab?
fr: Pourquoi présenter DataLab ?

source: Our conference presentations serve multiple purposes:
fr: Nos présentations en conférence servent plusieurs objectifs :

source: **Community Engagement**
fr: **Engagement communautaire**

source: Meeting users, gathering feedback, and understanding the needs of the scientific Python community.
fr: Rencontrer les utilisateurs, recueillir des retours et comprendre les besoins de la communauté scientifique Python.

source: **Knowledge Sharing**
fr: **Partage des connaissances**

source: Demonstrating how DataLab can help researchers, engineers, and data scientists in their daily work.
fr: Démontrer comment DataLab peut aider les chercheurs, les ingénieurs et les data scientists dans leur travail quotidien.

source: Building connections with other projects in the scientific Python ecosystem and exploring integration opportunities.
fr: Établir des connexions avec d'autres projets de l'écosystème Python scientifique et explorer les opportunités d'intégration.

source: **Feedback Loop**
fr: **Retours d'expérience**

source: Learning from the community's questions and suggestions to improve DataLab's features and documentation.
fr: Apprendre des questions et des suggestions de la communauté pour améliorer les fonctionnalités et la documentation de DataLab.
