Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/outreach/osxp2025.po
Languages: fr

source: DataLab advanced use case at Open Source Experience 2025 in Paris
fr: Application avancée de DataLab à Open Source Experience 2025 à Paris

source: DataLab, Open Source Experience, OSXP, radiography, image reconstruction, AI, scientific computing, conference, Paris, CEA, Codra
fr: DataLab, Open Source Experience, OSXP, radiographie, reconstruction d'images, IA, calcul scientifique, conférence, Paris, CEA, Codra

source: Conference Overview
fr: Aperçu de la conférence

source: In December 2025, an advanced use case of DataLab will be presented at `Open Source Experience 2025 <https://www.opensource-experience.com/>`_ in Paris, one of Europe's largest events dedicated to open-source software and communities.
fr: En décembre 2025, un cas d'utilisation avancé de DataLab sera présenté lors de l'`Open Source Experience 2025 <https://www.opensource-experience.com/>`_ à Paris, l'un des plus grands événements d'Europe dédié aux logiciels et aux communautés open-source.

source: **Event Details:**
fr: **Détails de l'événement :**

source: December 11, 2025
fr: 11 décembre 2025

source: Time
fr: Heure

source: Location
fr: Lieu

source: Room
fr: Salle

source: Track
fr: Thématique

source: Artificial Intelligence and Scientific Computing
fr: Intelligence Artificielle et Calcul Scientifique

source: Talk (20 minutes)
fr: Présentation (20 minutes)

source: Presentation
fr: Présentation

source: **Title (French):** *Reconstruction automatique de scènes radiographiées avec Python et DataLab*
fr: **Titre (français) :** *Reconstruction automatique de scènes radiographiées avec Python et DataLab*

source: **Title (English):** *Automatic Reconstruction of X-ray Scenes with Python and DataLab*
fr: **Titre (anglais) :** *Automatic Reconstruction of X-ray Scenes with Python and DataLab*

source: **Speakers:**
fr: **Intervenants :**

source: **Pierre Raybaut** - Executive VP, Engineering, CODRA
fr: **Pierre Raybaut** - Directeur Général Ingénierie, CODRA

source: **Marc Rabec Le Gloahec** - Research Engineer, CEA (French Alternative Energies and Atomic Energy Commission)
fr: **Marc Rabec Le Gloahec** - Chercheur-ingénieur, CEA (Commissariat à l'Énergie Atomique et aux Énergies Alternatives)

source: Abstract
fr: Résumé

source: In the field of non-destructive testing, the CEA entrusted CODRA with the specification, design, and development of software for the automatic reconstruction of radiographic images, entirely based on open-source components and contributing to the scientific Python ecosystem.
fr: Dans le domaine du contrôle non destructif, le CEA a confié à CODRA la spécification, la conception et la réalisation d’un logiciel de reconstruction automatique d’images radiographiées, entièrement basé sur des briques open source et contribuant à l’écosystème Python scientifique.

source: **Key Technical Aspects:**
fr: **Aspects Techniques Clés :**

source: **Geometric Pattern-Based Reconstruction**
fr: **Reconstruction Basée sur des Motifs Géométriques :**

source: Using a grid of geometric markers placed within the radiographed field, the algorithm automatically assembles a complete scene from partial images, without any prior external information (position, orientation, magnification).
fr: Grâce à une grille de repères géométriques placée dans le champ radiographié, l’algorithme assemble automatiquement une scène complète à partir de clichés partiels, sans aucune information externe préalable (position, orientation, grandissement).

source: **Complex Parametrizable Processing**
fr: **Traitement Complexe Paramétrable :**

source: The complex and configurable processing workflow was developed and refined using the open-source DataLab platform, remotely controlled to dynamically visualize each step of the pipeline.
fr: Le traitement, complexe et paramétrable, a été développé et affiné avec la plateforme open source DataLab, pilotée à distance pour visualiser dynamiquement chaque étape du pipeline.

source: **Real-World Application**
fr: **Application dans le Monde Réel :**

source: The creation of this software paves the way for new applications in the fields of industrial imaging and security.
fr: La réalisation de ce logiciel ouvre la voie à de nouvelles applications dans le domaine de l’imagerie industrielle et de la sécurité.

source: DataLab's Role in the Project
fr: Rôle de DataLab dans le Projet

source: This presentation showcases DataLab in a real-world industrial application, demonstrating several key capabilities:
fr: Cette présentation met en avant DataLab dans une application industrielle concrète, démontrant plusieurs capacités clés :

source: **Remote Control for Development**
fr: **Contrôle à Distance pour le Développement :**

source: DataLab was used as a remote-controlled visualization and processing platform during algorithm development, allowing developers to:
fr: DataLab a été utilisé comme plateforme de visualisation et de traitement contrôlée à distance lors du développement de l'algorithme, permettant aux développeurs de :

source: Visualize intermediate results at each pipeline step
fr: Visualiser les résultats intermédiaires à chaque étape du pipeline

source: Fine-tune parameters interactively
fr: Ajuster les paramètres de manière interactive

source: Debug complex image processing algorithms
fr: Déboguer des algorithmes de traitement d'image complexes

source: Validate processing results in real-time
fr: Valider les résultats du traitement en temps réel

source: **Visual Debugging**
fr: **Débogage Visuel :**

source: The ability to send data from the main application to DataLab for visualization proved invaluable for:
fr: La possibilité d'envoyer des données de l'application principale vers DataLab pour visualisation s'est révélée inestimable pour :

source: Understanding algorithm behavior
fr: Comprendre le comportement de l'algorithme

source: Identifying edge cases and failure modes
fr: Identifier les cas limites et les modes de défaillance

source: Optimizing processing parameters
fr: Optimiser les paramètres de traitement

source: Validating geometric transformations
fr: Valider les transformations géométriques

source: **Rapid Prototyping**
fr: **Prototypage Rapide :**

source: DataLab's ready-to-use image processing features enabled rapid prototyping of the reconstruction pipeline.
fr: Les fonctionnalités de traitement d'image prêtes à l'emploi de DataLab ont permis un prototypage rapide du pipeline de reconstruction.

source: **Production Integration**
fr: **Intégration en Production :**

source: The software demonstrates how DataLab can be integrated into production-grade industrial applications.
fr: Le logiciel démontre comment DataLab peut être intégré dans des applications industrielles de niveau production.

source: Technical Challenges Addressed
fr: Défis Techniques Relevés

source: The automatic X-ray scene reconstruction project involved several complex challenges:
fr: Le projet de reconstruction automatique de scènes par rayons X a impliqué plusieurs défis complexes :

source: **Geometric Calibration**
fr: **Calibration Géométrique :**

source: Automatic detection and analysis of geometric reference patterns in X-ray images.
fr: Détection et analyse automatiques de motifs de référence géométriques dans les images par rayons X.

source: **Image Registration**
fr: **Enregistrement d'Image :**

source: Aligning and stitching partial images without prior knowledge of their spatial relationship.
fr: Aligner et assembler des images partielles sans connaissance préalable de leur relation spatiale.

source: **Scale and Orientation Estimation**
fr: **Estimation de l'Échelle et de l'Orientation :**

source: Determining magnification factors and angular orientation from the geometric grid alone.
fr: Déterminer les facteurs de grossissement et l'orientation angulaire à partir de la grille géométrique seule.

source: **Robust Processing**
fr: **Traitement Robuste :**

source: Handling variations in image quality, exposure, and geometric distortions.
fr: Gestion des variations de qualité d'image, d'exposition et de distorsions géométriques.

source: **Performance Optimization**
fr: **Optimisation des Performances :**

source: Ensuring the reconstruction process runs efficiently for practical use.
fr: Assurer que le processus de reconstruction fonctionne efficacement pour une utilisation pratique.

source: Open Source Ecosystem Contribution
fr: Contribution à l'Écosystème Open Source

source: This project exemplifies how industrial applications can both benefit from and contribute to the open-source scientific Python ecosystem:
fr: Ce projet illustre comment les applications industrielles peuvent à la fois bénéficier de l'écosystème scientifique Python open-source et y contribuer :

source: **Leveraging Open Source**
fr: **Exploitation de l'Open Source :**

source: The software is built entirely on open-source components:
fr: Le logiciel est entièrement construit sur des composants open-source :

source: **Python** as the development platform
fr: **Python** comme plateforme de développement

source: **NumPy** and **SciPy** for numerical computing
fr: **NumPy** et **SciPy** pour le calcul numérique

source: **scikit-image** and **OpenCV** for image processing
fr: **scikit-image** et **OpenCV** pour le traitement d'image

source: **DataLab** for visualization and algorithm development
fr: **DataLab** pour la visualisation et le développement d'algorithmes

source: **Contributing Back**
fr: **Contribution au Projet :**

source: The project contributes to the ecosystem by:
fr: Le projet contribue à l'écosystème en :

source: Validating DataLab's capabilities in demanding industrial applications
fr: Validant les capacités de DataLab dans des applications industrielles exigeantes.

source: Providing feedback for DataLab's development
fr: Fournissant des retours pour le développement de DataLab.

source: Demonstrating real-world use cases for the community
fr: Démontrant des cas d'utilisation concrets pour la communauté.

source: Potentially contributing algorithms or improvements back to open-source libraries
fr: Contribuant potentiellement des algorithmes ou des améliorations aux bibliothèques open-source.

source: Industrial and Research Collaboration
fr: Collaboration entre l'Industrie et la Recherche

source: This presentation highlights successful collaboration between public research and private industry:
fr: Cette présentation met en lumière la collaboration réussie entre la recherche publique et l'industrie privée :

source: **CEA (Public Research)**
fr: **CEA (Recherche Publique)**

source: Defined the scientific and technical requirements
fr: Défini les exigences scientifiques et techniques.

source: Provided domain expertise in non-destructive testing
fr: Fournissant une expertise dans le domaine des essais non destructifs.

source: **CODRA (Technical and Scientific Software Development Company)**
fr: **CODRA (Entreprise de Développement de Logiciels Techniques et Scientifiques)**

source: Translated functional specifications into algorithms through mathematical modeling (e.g. homographic transformations, coordinate system conversions)
fr: Traduit les spécifications fonctionnelles en algorithmes par le biais de la modélisation mathématique (par exemple, transformations homographiques, conversions de systèmes de coordonnées)

source: Validated the reconstruction algorithms
fr: Validé les algorithmes de reconstruction.

source: Designed and developed the software solution
fr: Conçu et développé la solution logicielle.

source: Integrated open-source components
fr: Intégré des composants open-source.

source: Ensured industrial-grade quality and robustness
fr: Assuré une qualité et une robustesse de niveau industriel.

source: Leveraged DataLab for development
fr: Exploité DataLab pour le développement.

source: **Benefits of Collaboration**
fr: **Avantages de la Collaboration :**

source: Combines research excellence with industrial rigor
fr: Combine l'excellence de la recherche avec l'ingénierie industrielle.

source: Accelerates technology transfer from research to application
fr: Accélère le transfert de technologie de la recherche vers l'application.

source: Ensures solutions meet both scientific and practical requirements
fr: Assure que les solutions répondent à la fois aux exigences scientifiques et pratiques.

source: Promotes open-source adoption in industrial contexts
fr: Favorise l'adoption de l'open-source dans les contextes industriels.

source: Applications and Impact
fr: Applications et Impact

source: The automatic X-ray scene reconstruction software opens new possibilities:
fr: Le logiciel de reconstruction de scènes X-ray automatique ouvre de nouvelles possibilités :

source: **Non-Destructive Testing**
fr: **Tests Non Destructifs :**

source: Improved efficiency in industrial quality control and inspection.
fr: Amélioration de l'efficacité dans le contrôle qualité et l'inspection industriels.

source: **Industrial Imaging**
fr: **Imagerie Industrielle :**

source: Advanced capabilities for manufacturing and production monitoring.
fr: Capacités avancées pour la fabrication et le suivi de la production.

source: **Security Applications**
fr: **Applications de Sécurité :**

source: Enhanced screening and inspection capabilities.
fr: Amélioration des capacités de dépistage et d'inspection.

source: **Research and Development**
fr: **Recherche et Développement :**

source: New tools for researchers working with X-ray imaging.
fr: Nouveaux outils pour les chercheurs travaillant avec l'imagerie X.

source: Why This Matters for DataLab
fr: Pourquoi c'est Important pour DataLab

source: This presentation is significant for several reasons:
fr: Cette présentation est significative pour plusieurs raisons :

source: **Real-World Validation**
fr: **Validation dans le Monde Réel :**

source: Demonstrates DataLab's capability to handle complex, production-grade applications in demanding industrial environments.
fr: Démontre la capacité de DataLab à gérer des applications complexes de niveau production dans des environnements industriels exigeants.

source: **Advanced Use Case**
fr: **Cas d'Utilisation Avancé :**

source: Shows DataLab beyond simple data analysis - as an integral part of sophisticated algorithm development workflows.
fr: Montre DataLab au-delà de l'analyse de données simple - en tant que partie intégrante de flux de travail de développement d'algorithmes sophistiqués.

source: **Industrial Adoption**
fr: **Adoption Industrielle :**

source: Validates DataLab's value proposition for industrial users, not just academic or research applications.
fr: Valide la proposition de valeur de DataLab pour les utilisateurs industriels, pas seulement pour les applications académiques ou de recherche.

source: **Remote Control Excellence**
fr: **Excellence du Contrôle à Distance :**

source: Highlights one of DataLab's key differentiators - the ability to be remotely controlled for dynamic visualization and debugging.
fr: Met en avant l'un des principaux facteurs de différenciation de DataLab - la capacité d'être contrôlé à distance pour une visualisation et un débogage dynamiques.

source: **CEA Partnership**
fr: **Partenariat CEA :**

source: Reinforces the strong relationship between DataLab and CEA, one of its major supporters.
fr: Renforce la relation étroite entre DataLab et le CEA, l'un de ses principaux soutiens.

source: Looking Forward
fr: Perspectives

source: This presentation at OSXP 2025 will:
fr: Cette présentation à OSXP 2025 mettra en avant :

source: Showcase a concrete example of open-source software solving real industrial challenges
fr: Présenter un exemple concret de logiciel open-source résolvant de réels défis industriels.

source: Demonstrate the maturity and capabilities of the scientific Python ecosystem
fr: Démontrer la maturité et les capacités de l'écosystème Python scientifique.

source: Illustrate how DataLab bridges the gap between research and industrial applications
fr: Illustrer comment DataLab comble le fossé entre la recherche et les applications industrielles.

source: Inspire other organizations to adopt open-source solutions for their technical challenges
fr: Inspirer d'autres organisations à adopter des solutions open-source pour leurs défis techniques.

source: The automatic X-ray scene reconstruction project represents exactly the kind of advanced, real-world application that DataLab was designed to support - combining scientific rigor, industrial robustness, and open-source collaboration.
fr: Le projet de reconstruction de scène X-ray automatique représente exactement le type d'application avancée et concrète que DataLab a été conçu pour soutenir - alliant rigueur scientifique, robustesse industrielle et collaboration open-source.

source: **Upcoming Event**: This presentation will take place on **December 11, 2025**. Check back after the event for presentation materials, feedback, and potentially a video recording.
fr: **Événement à Venir** : Cette présentation aura lieu le **11 décembre 2025**. Revenez après l'événement pour les documents de présentation, les retours d'expérience et potentiellement un enregistrement vidéo.

source: Conference Track
fr: Thématique de la Conférence

source: The presentation is part of the **Artificial Intelligence and Scientific Computing** track, reflecting the intersection of:
fr: La présentation fait partie de la thématique **Intelligence Artificielle et Calcul Scientifique**, reflétant l'intersection de :

source: Traditional scientific computing (image processing, geometric transformations)
fr: Calcul scientifique traditionnel (traitement d'images, transformations géométriques)

source: Modern AI/ML techniques (pattern recognition, potentially optimization)
fr: Techniques modernes d'IA/ML (reconnaissance de formes, optimisation potentielle)

source: Industrial applications of scientific software
fr: Applications industrielles de logiciels scientifiques

source: Open-source development methodologies
fr: Méthodologies de développement open-source

source: This positioning highlights DataLab's relevance in the evolving landscape where scientific computing increasingly incorporates AI/ML techniques while maintaining its foundation in classical numerical methods.
fr: Ce positionnement met en évidence la pertinence de DataLab dans un paysage en évolution où le calcul scientifique intègre de plus en plus des techniques d'IA/ML tout en maintenant sa base dans des méthodes numériques classiques.

source: Resources
fr: Ressources

source: `Open Source Experience 2025 website <https://www.opensource-experience.com/>`_
fr: Site Web de l'Open Source Experience 2025 <https://www.opensource-experience.com/>

source: Talk details and schedule to be published closer to the event
fr: Les détails de la présentation et le calendrier seront publiés à l'approche de l'événement.

source: For more information about DataLab's use in CEA projects, see:
fr: Pour plus d'informations sur l'utilisation de DataLab dans les projets CEA, voir :

source: :doc:`../features/index` - DataLab's validation approach
fr: :doc:`../features/index` - Approche de validation de DataLab

source: :doc:`../intro/introduction` - DataLab's operating modes, including remote control
fr: :doc:`../intro/introduction` - Modes de fonctionnement de DataLab, y compris le contrôle à distance

source: :doc:`osxp2024` - Previous DataLab presentation at OSXP 2024
fr: :doc:`osxp2024` - Présentation précédente de DataLab à OSXP 2024
