Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/outreach/osxp2024.po
Languages: fr

source: DataLab presentation at Open Source Experience 2024 in Paris
fr: Présentation de DataLab à l'Open Source Experience 2024 à Paris

source: DataLab, Open Source Experience, OSXP, open source, conference, Paris
fr: DataLab, Open Source Experience, OSXP, open source, conférence, Paris

source: Conference Overview
fr: Aperçu de la conférence

source: In December 2024, DataLab was showcased at `Open Source Experience 2024 <https://www.opensource-experience.com/>`_ in Paris, one of Europe's largest events dedicated to open-source software and communities. This conference provided an opportunity to present DataLab to a broader audience beyond the scientific Python ecosystem.
fr: En décembre 2024, DataLab a été présenté lors de l'`Open Source Experience 2024 <https://www.opensource-experience.com/>`_ à Paris, l'un des plus grands événements européens dédiés aux logiciels et aux communautés open-source. Cette conférence a permis de présenter DataLab à un public plus large au-delà de l'écosystème Python scientifique.

source: Open Source Experience brings together developers, decision-makers, and open-source enthusiasts from various domains, creating a unique opportunity to demonstrate how scientific open-source software can bridge research and industry.
fr: Open Source Experience réunit des développeurs, des décideurs et des passionnés d'open source de divers domaines, créant une opportunité unique de démontrer comment les logiciels scientifiques open source peuvent faire le lien entre la recherche et l'industrie.

source: DataLab at OSXP 2024
fr: DataLab à OSXP 2024

source: **Presentation Context**
fr: **Contexte de la présentation**

source: Open Source Experience 2024 featured DataLab as an example of:
fr: Open Source Experience 2024 a introduit DataLab comme un exemple de :

source: **Open-source scientific software** that meets industrial requirements
fr: **Logiciel scientifique open-source** répondant aux exigences industrielles

source: **Community-driven development** backed by institutional and commercial support
fr: **Développement piloté par la communauté** soutenu par des institutions et des entreprises

source: **Cross-domain applicability** from research laboratories to production environments
fr: **Applicabilité interdomaines** des laboratoires de recherche aux environnements de production

source: **Key Messages**
fr: **Messages clés**

source: The presentation at OSXP 2024 emphasized:
fr: La présentation à OSXP 2024 a souligné :

source: **Open Source as a Bridge**
fr: **Open Source comme un pont**

source: How DataLab connects academic research (CEA) with industrial software development (CODRA) through open-source collaboration.
fr: Comment DataLab relie la recherche académique (CEA) au développement de logiciels industriels (CODRA) grâce à la collaboration open-source.

source: **Industrial-Grade Open Source**
fr: **Open Source de niveau industriel**

source: Demonstrating that open-source scientific software can achieve the reliability and robustness required for production use:
fr: Démontrer que les logiciels scientifiques open-source peuvent atteindre la fiabilité et la robustesse requises pour une utilisation en production :

source: Systematic testing and validation
fr: Tests et validations systématiques

source: Professional documentation
fr: Documentation professionnelle

source: Multi-platform support
fr: Support multi-plateforme

source: Long-term maintenance commitment
fr: Engagement de maintenance à long terme

source: **Ecosystem Integration**
fr: **Intégration dans l'écosystème**

source: DataLab's role within the broader scientific Python ecosystem, leveraging NumPy, SciPy, scikit-image, and OpenCV.
fr: Le rôle de DataLab au sein du vaste écosystème Python scientifique, tirant parti de NumPy, SciPy, scikit-image et OpenCV.

source: **Funding Diversity**
fr: **Diversité du financement**

source: Showcasing multiple funding sources (CEA, CODRA, NLnet/European Commission) as a model for sustainable open-source development.
fr: Mise en avant de plusieurs sources de financement (CEA, CODRA, NLnet/Commission européenne) comme modèle de développement open-source durable.

source: Resources
fr: Ressources

source: `Conference talk page <https://pretalx.com/pydata-paris-2024/talk/WTDVCC/>`_
fr: `Page de la conférence <https://pretalx.com/pydata-paris-2024/talk/WTDVCC/>`_

source: `Open Source Experience website <https://www.opensource-experience.com/>`_
fr: `Site Web de l'Open Source Experience <https://www.opensource-experience.com/>`_

source: Audience and Engagement
fr: Public et engagement

source: The OSXP audience brought a different perspective compared to scientific Python conferences:
fr: Le public d'OSXP a apporté une perspective différente par rapport aux conférences scientifiques Python :

source: **Diverse Background**
fr: **Contexte diversifié**

source: Attendees included:
fr: Les participants comprenaient :

source: Corporate decision-makers evaluating open-source solutions
fr: Des décideurs d'entreprise évaluant des solutions open-source

source: Public sector representatives interested in scientific tools
fr: Des représentants du secteur public intéressés par des outils scientifiques

source: Open-source advocates from various technical domains
fr: Des défenseurs de l'open-source provenant de divers domaines techniques

source: Students discovering scientific computing possibilities
fr: Des étudiants découvrant les possibilités de l'informatique scientifique

source: **Key Questions**
fr: **Questions clés**

source: The audience was particularly interested in:
fr: Le public était particulièrement intéressé par :

source: **Licensing**: BSD 3-Clause license and its implications for commercial use
fr: **Licence** : licence BSD 3-Clause et ses implications pour une utilisation commerciale

source: **Governance**: The DataLab Platform organization and decision-making process
fr: **Gouvernance** : L'organisation de la plateforme DataLab et le processus de prise de décision

source: **Sustainability**: Long-term maintenance and development plans
fr: **Durabilité** : Plans de maintenance et de développement à long terme

source: Broader Impact
fr: Impact plus large

source: Presenting at Open Source Experience helped DataLab reach new audiences:
fr: La présentation à l'Open Source Experience a aidé DataLab à atteindre de nouveaux publics :

source: **Enterprise Awareness**
fr: **Sensibilisation des entreprises**

source: Companies outside the scientific computing domain discovered DataLab as a potential solution for their data processing needs.
fr: Des entreprises en dehors du domaine de l'informatique scientifique ont découvert DataLab comme une solution potentielle pour leurs besoins en traitement de données.

source: **Public Sector Interest**
fr: **Intérêt du secteur public**

source: Government agencies and research institutions learned about DataLab as a validated open-source alternative to proprietary solutions.
fr: Les agences gouvernementales et les institutions de recherche ont découvert DataLab comme une alternative open-source validée aux solutions propriétaires.

source: **Education Sector**
fr: **Secteur de l'éducation**

source: Universities and technical schools identified DataLab as a teaching tool for signal and image processing.
fr: Des universités et des écoles techniques ont identifié DataLab comme un outil d'enseignement pour le traitement des signaux et des images.

source: **Cross-Pollination**
fr: **Pollinisation croisée**

source: Connections with other open-source projects opened possibilities for integration and collaboration.
fr: Les connexions avec d'autres projets open-source ont ouvert des possibilités d'intégration et de collaboration.

source: DataLab's Open Source Model
fr: Le modèle open-source de DataLab

source: The OSXP presentation highlighted DataLab's unique open-source model:
fr: La présentation à OSXP a mis en avant le modèle open-source unique de DataLab :

source: **Development**
fr: **Développement**

source: Open development on GitHub with public roadmap and issue tracking
fr: Développement ouvert sur GitHub avec feuille de route publique et suivi des problèmes

source: **Funding**
fr: **Financement**

source: Mixed funding from public research (CEA), commercial (CODRA), and grants (NLnet)
fr: Financement mixte provenant de la recherche publique (CEA), du secteur commercial (CODRA) et de subventions (NLnet)

source: **License**
fr: **Licence**

source: BSD 3-Clause for maximum freedom and adoption
fr: BSD 3-Clause pour une liberté et une adoption maximales

source: **Governance**
fr: **Gouvernance**

source: DataLab Platform organization with contributors from multiple institutions
fr: Organisation de la plateforme DataLab avec des contributeurs de plusieurs institutions

source: **Support**
fr: **Soutien**

source: Community support via GitHub + professional support via CODRA
fr: Soutien communautaire via GitHub + soutien professionnel via CODRA

source: Multiple channels: PyPI, conda-forge, Debian, Windows installers
fr: Canaux multiples : PyPI, conda-forge, Debian, installateurs Windows

source: This model demonstrates how scientific open-source projects can achieve sustainability while maintaining their open nature.
fr: Ce modèle démontre comment les projets open-source scientifiques peuvent atteindre la durabilité tout en maintenant leur nature ouverte.

source: Significance for DataLab
fr: Importance pour DataLab

source: The presence at Open Source Experience 2024 marked an important milestone:
fr: La présence à Open Source Experience 2024 a marqué une étape importante :

source: **Maturity Recognition**
fr: **Reconnaissance de la maturité**

source: Being selected for presentation at a major open-source conference validated DataLab's maturity and relevance.
fr: Le fait d'être sélectionné pour une présentation lors d'une grande conférence open-source a validé la maturité et la pertinence de DataLab.

source: **Broader Mission**
fr: **Mission plus large**

source: Confirmed DataLab's mission extends beyond scientific research to serve the wider open-source and industrial communities.
fr: La mission de DataLab s'étend au-delà de la recherche scientifique pour servir les communautés open-source et industrielles plus larges.

source: **European Dimension**
fr: **Dimension européenne**

source: Emphasized DataLab's European roots and alignment with European open-source values and funding (NLnet/EC).
fr: Mise en avant des racines européennes de DataLab et de son alignement avec les valeurs et le financement open-source européens (NLnet/EC).

source: **Sustainable Model**
fr: **Modèle durable**

source: Demonstrated a viable model for developing scientific open-source software with mixed public/private funding.
fr: Démonstration d'un modèle viable pour le développement de logiciels open-source scientifiques avec un financement mixte public/privé.
