Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/outreach/scipy2024.po
Languages: fr

source: DataLab presentation at SciPy 2024 conference in Tacoma, Washington
fr: Présentation de DataLab à la conférence SciPy 2024 à Tacoma, Washington

source: DataLab, SciPy, SciPy 2024, scientific Python, conference, Tacoma
fr: DataLab, SciPy, SciPy 2024, Python scientifique, conférence, Tacoma

source: Greater Tacoma Convention Center
fr: Centre de congrès de Greater Tacoma

source: Greater Tacoma Convention Center, where SciPy 2024 was held
fr: Centre de congrès de Greater Tacoma, où s'est tenue la conférence SciPy 2024

source: Conference Overview
fr: Aperçu de la conférence

source: In July 2024, DataLab made its international debut at `SciPy 2024 <https://www.scipy2024.scipy.org/>`_, the largest conference in the world dedicated to the scientific Python ecosystem. Held in Tacoma, Washington (near Seattle), the conference gathered about 800 participants from industry, academia, and government.
fr: En juillet 2024, DataLab a fait ses débuts internationaux à `SciPy 2024 <https://www.scipy2024.scipy.org/>`_, la plus grande conférence au monde dédiée à l'écosystème Python scientifique. Organisée à Tacoma, Washington (près de Seattle), la conférence a rassemblé environ 800 participants issus de l'industrie, du milieu universitaire et du gouvernement.

source: SciPy is organized by the `NumFOCUS <https://numfocus.org/>`_ foundation and has been held annually for more than 20 years, bringing together people from diverse fields who share a common interest in Python and scientific computing.
fr: SciPy est organisé par la fondation `NumFOCUS <https://numfocus.org/>`_ et se tient chaque année depuis plus de 20 ans, réunissant des personnes de divers domaines partageant un intérêt commun pour Python et le calcul scientifique.

source: DataLab Presentation
fr: Présentation de DataLab

source: Introducing DataLab at SciPy 2024
fr: Présentation de DataLab à SciPy 2024

source: **Talk Title:** *From Spyder to DataLab: 15 years of scientific software crafting in Python*
fr: **Titre de la présentation :** *De Spyder à DataLab : 15 ans de création de logiciels scientifiques en Python*

source: **Presenter:** Pierre Raybaut (Executive VP, Engineering, CODRA)
fr: **Intervenant :** Pierre Raybaut (Directeur Général Ingénierie, CODRA)

source: The presentation introduced DataLab as part of a broader narrative about 15 years of scientific Python software development, including the creation of Spyder (the Scientific Python IDE) and other projects like Python(x,y) and WinPython.
fr: La présentation a introduit DataLab dans le cadre d'un récit plus large sur 15 ans de développement de logiciels scientifiques en Python, incluant la création de Spyder (l'IDE Python scientifique) et d'autres projets comme Python(x,y) et WinPython.

source: Key Points Presented
fr: Points Clés Présentés

source: **DataLab's Unique Position**
fr: **Position Unique de DataLab :**

source: A platform that bridges the gap between customizable scientific processing software and industrial-grade applications.
fr: Une plateforme qui comble le fossé entre les logiciels de traitement scientifique personnalisables et les applications de niveau industriel.

source: **Three Operating Modes**
fr: **Trois Modes de Fonctionnement :**

source: Standalone application for data analysis
fr: Application autonome pour l'analyse de données

source: Python library for integration into scripts and notebooks
fr: Bibliothèque Python pour l'intégration dans des scripts et des notebooks

source: Remote-controlled platform for automation
fr: Plateforme contrôlée à distance pour l'automatisation

source: **Integration with Scientific Ecosystem**
fr: **Intégration avec l'Écosystème Scientifique :**

source: DataLab works seamlessly with IDEs (particularly Spyder) and Jupyter notebooks, requiring only two lines of code to connect.
fr: DataLab s'intègre parfaitement avec les IDE (en particulier Spyder) et les notebooks Jupyter, nécessitant seulement deux lignes de code pour se connecter.

source: **Validation Approach**
fr: **Approche de Validation :**

source: Functional validation: 200+ automated tests
fr: Validation fonctionnelle : plus de 200 tests automatisés

source: Scientific validation: ensuring users can trust the results
fr: Validation scientifique : garantir que les utilisateurs peuvent faire confiance aux résultats

source: Multi-platform testing: Windows, Linux, and macOS
fr: Tests multi-plateformes : Windows, Linux et macOS

source: **Industrial Adoption**
fr: **Adoption Industrielle :**

source: DataLab is used in production environments and has a `Debian package <https://tracker.debian.org/pkg/datalab>`_.
fr: DataLab est utilisé dans des environnements de production et dispose d'un `package Debian <https://tracker.debian.org/pkg/datalab>`_.

source: Watch the Full Presentation
fr: Regarder la Présentation Complète

source: Resources
fr: Ressources

source: `Talk page on SciPy website <https://cfp.scipy.org/2024/talk/G3MC9L/>`_
fr: `Page de la présentation sur le site de SciPy <https://cfp.scipy.org/2024/talk/G3MC9L/>`_

source: `DataLab Poster (PDF) <https://github.com/user-attachments/files/16123893/DataLab-Poster_SciPy2024-V6.pdf>`_
fr: `Affiche DataLab (PDF) <https://github.com/user-attachments/files/16123893/DataLab-Poster_SciPy2024-V6.pdf>`_

source: `Video recording on YouTube <https://www.youtube.com/watch?v=MKPUuV1LEqk>`_
fr: `Enregistrement vidéo sur YouTube <https://www.youtube.com/watch?v=MKPUuV1LEqk>`_

source: DataLab Poster
fr: Poster DataLab

source: DataLab poster presented at SciPy 2024
fr: Poster DataLab présenté à SciPy 2024

source: Impact on DataLab Development
fr: Impact sur le Développement de DataLab

source: The feedback and discussions at SciPy 2024 influenced several aspects of DataLab's development:
fr: Les retours et discussions lors de SciPy 2024 ont influencé plusieurs aspects du développement de DataLab :

source: Enhanced focus on documentation and tutorials for new users
fr: Accent accru sur la documentation et les tutoriels pour les nouveaux utilisateurs

source: Increased priority on API stability for library usage
fr: Priorité accrue à la stabilité de l'API pour l'utilisation de la bibliothèque

source: Validation that the three-mode approach (standalone/library/remote) resonates with users
fr: Validation que l'approche en trois modes (autonome/bibliothèque/à distance) résonne avec les utilisateurs

source: Confirmation of the importance of maintaining both scientific flexibility and industrial robustness
fr: Confirmation de l'importance de maintenir à la fois la flexibilité scientifique et la robustesse industrielle

source: Perspectives on potential collaborations with the Spyder IDE team for deeper integration
fr: Perspectives sur d'éventuelles collaborations avec l'équipe de l'IDE Spyder pour une intégration plus approfondie

source: The conference confirmed that DataLab fills a real need in the scientific Python ecosystem as a bridge between rapid prototyping and production-ready data processing, even if it concerns a niche audience.
fr: La conférence a confirmé que DataLab répond à un besoin réel dans l'écosystème Python scientifique en tant que pont entre le prototypage rapide et le traitement des données prêt pour la production, même s'il s'agit d'un public de niche.
