Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/tutorials/blobs.po
Languages: fr

source: :octicon:`book;1em;sd-text-info` Detecting blobs on an image
fr: :octicon:`book;1em;sd-text-info` Détection de taches sur une image

source: This example shows how to detect blobs on an image with DataLab, and also covers other features such as the plugin system:
fr: Cet exemple montre comment détecter des taches sur une image avec DataLab, et couvre également d'autres fonctionnalités telles que le système de plugins :

source: Add a new plugin to DataLab
fr: Ajouter un nouveau plugin à DataLab

source: Denoise an image
fr: Débruitage d'une image

source: Detect blobs on an image
fr: Détecter des taches sur une image

source: Save the workspace to a file
fr: Enregistrer l'espace de travail dans un fichier

source: First, we open DataLab, and open the settings dialog (using "File > Settings...", or the |libre-gui-settings| icon in the toolbar).
fr: Tout d'abord, nous ouvrons DataLab, et ouvrons la boîte de dialogue des paramètres (en utilisant "Fichier > Paramètres...", ou l'icône |libre-gui-settings| dans la barre d'outils).

source: In the "General" tab, we can see the "Plugins path" field. This is the path where DataLab will look for plugins. We can add a new plugin by copying/pasting the plugin file in this directory.
fr: Dans l'onglet "Général", nous pouvons voir le champ "Chemin des plugins". C'est le chemin où DataLab recherchera les plugins. Nous pouvons ajouter un nouveau plugin en copiant/collant le fichier du plugin dans ce répertoire.

source: The plugin system is described in the :ref:`about_plugins` section.
fr: Le système de plugins est décrit dans la section :ref:`about_plugins`.

source: Let's add the `datalab_example_imageproc.py` plugin to DataLab (this is an example plugin that is shipped with DataLab source package, or may be downloaded from `here <https://github.com/DataLab-Platform/DataLab/tree/main/plugins/examples>`_).
fr: Ajoutons le plugin `datalab_example_imageproc.py` à DataLab (c'est un plugin d'exemple qui est fourni avec le package source de DataLab, ou peut être téléchargé `ici <https://github.com/DataLab-Platform/DataLab/tree/main/plugins/examples>`_).

source: If we close and reopen DataLab, we can see that the plugin is now available in the "Plugins" menu: there is a new "Extract blobs (example)" entry.
fr: Si nous fermons et rouvrons DataLab, nous pouvons voir que le plugin est maintenant disponible dans le menu "Plugins" : il y a une nouvelle entrée "Extract blobs (example)".

source: The "About DataLab" dialog shows the list of available plugins.
fr: La boîte de dialogue "À propos de DataLab" affiche la liste des plugins disponibles.

source: Let's click on "Extract blobs (example) > Generate test image"
fr: Cliquons sur "Extract blobs (example) > Generate test image"

source: DataLab menus change between images and signals. To be able to see the "Extract blobs (example)" menu, make sure that the "Images" panel is selected (click on the "Images" tab on the left).
fr: Les menus de DataLab changent entre les images et les signaux. Pour pouvoir voir le menu "Extract blobs (example)", assurez-vous que le panneau "Images" est sélectionné (cliquez sur l'onglet "Images" à gauche).

source: A pop-up dialog appears, asking for the parameters of the test image to generate (the size of the image and its title). We can just keep the default parameters and click on "OK".
fr: Une boîte de dialogue contextuelle apparaît, demandant les paramètres de l'image de test à générer (la taille de l'image et son titre). Nous pouvons simplement conserver les paramètres par défaut et cliquer sur "OK".

source: For information, the image is generated by the plugin using the following code::
fr: Pour information, l'image est générée par le plugin en utilisant le code suivant::

source: The plugin has generated a test image, and added it to the "Images" panel. The image shows a few blobs, with a central bigger disk, and a noisy background.
fr: Le plugin a généré une image de test, et l'a ajoutée au panneau "Images". L'image montre quelques taches, avec un disque central plus grand, et un fond bruité.

source: The plugin has other features, such as denoising the image, and detecting blobs on the image, but we won't cover them here: we will instead use the DataLab native features to achieve, manually, the same operations as the plugin.
fr: Le plugin a d'autres fonctionnalités, telles que le débruitage de l'image, et la détection de taches sur l'image, mais nous ne les aborderons pas ici : nous utiliserons plutôt les fonctionnalités natives de DataLab pour réaliser, manuellement, les mêmes opérations que le plugin.

source: The image is a bit noisy, and also quite large. In addition, the blobs are large with respect to the pixel size.
fr: L'image est un peu bruitée, et aussi assez grande. De plus, les taches sont grandes par rapport à la taille des pixels.

source: To reduce the noise there are several functions available in DataLab. Due to the considerations we just made, we can consider that a binning would reduce the noise without losing the information we look for. Let's apply a binning to the image by a factor of 2 on both axes. This will reduce the image size by a factor of 4, and the noise standard deviation by a factor of 2. Choosing to change the pixel size accordingly will keep the blob size constant in the previous unit (in this case, pixels, but in a real application we can calibrate them to respect a real physical size).
fr: Pour réduire le bruit, il existe plusieurs fonctions disponibles dans DataLab. En raison des considérations que nous venons de faire, nous pouvons considérer qu'un binning réduirait le bruit sans perdre l'information que nous recherchons. Appliquons un binning à l'image par un facteur de 2 sur les deux axes. Cela réduira la taille de l'image d'un facteur de 4, et l'écart type du bruit d'un facteur de 2. Choisir de modifier la taille des pixels en conséquence maintiendra la taille des taches constante dans l'unité précédente (dans ce cas, les pixels, mais dans une application réelle, nous pouvons les calibrer pour respecter une taille physique réelle).

source: Click on "Operations > Pixel binning".
fr: Cliquons sur "Opérations > Pixel binning".

source: The "Binning" dialog opens, with several options. Set the binning factor to 2 for both axes, select the "change pixel size" case and click on "OK".
fr: La boîte de dialogue "Binning" s'ouvre, avec plusieurs options. Réglez le facteur de binning à 2 pour les deux axes, sélectionnez la case "changer la taille des pixels" et cliquez sur "OK".

source: The binned image is added to the "Images" panel. It is now easier to see the blobs (even if they were already quite visible on the original image: this is just an example), and the image will be faster to process.
fr: L'image binnée est ajoutée au panneau "Images". Il est maintenant plus facile de voir les taches (même si elles étaient déjà assez visibles sur l'image d'origine : c'est juste un exemple), et l'image sera plus rapide à traiter.

source: A different approach we can take is to apply a moving median filter, to reduce the importance of the spikes. We do it with a window of 5; of course in practice different window sizes can be tested to find a good compromise between noise reduction and resolution. Let's see how to do that.
fr: Une autre approche que nous pouvons adopter est d'appliquer un filtre médian mobile, pour réduire l'importance des pics. Nous le faisons avec une fenêtre de 5 ; bien sûr, en pratique, différentes tailles de fenêtre peuvent être testées pour trouver un bon compromis entre la réduction du bruit et la résolution. Voyons comment faire cela.

source: Click on "Processing > Noise reduction > Moving median" entry, and set the window size to ``5``.
fr: Cliquez sur l'entrée "Traitement > Réduction du bruit > Médiane mobile", et réglez la taille de la fenêtre sur ``5``.

source: The filtered image is added to the "Images" panel. Denoising is quite efficient.
fr: L'image filtrée est ajoutée au panneau "Images". Le débruitage est assez efficace.

source: Now, we can be satisfied with our denoising: it is visible that the noise is smaller. We can thus move to the following step: detect the blobs on the image. To do that, we can use the "Blob detection" function available in the "Analysis" menu. Different :ref:`algorithms <ima-blob-detection>` are available, here we will use the OpenCV one.
fr: A présent, le débruitage paraît satisfaisant : le niveau de bruit est sensiblement réduit. Nous pouvons donc passer à l'étape suivante : détecter les taches sur l'image. Pour ce faire, nous pouvons utiliser la fonction "Détection de taches" disponible dans le menu "Analyse". Différents :ref:`algorithmes <ima-blob-detection>` sont disponibles, ici nous utiliserons celui d'OpenCV.

source: Click on "Analysis > Blob detection > Blob detection (OpenCV)".
fr: Cliquons sur "Analysis > Blob detection > Blob detection (OpenCV)".

source: The "Blob detection (OpenCV)" dialog opens. Set the parameters as shown on the screenshot, and click on "OK".
fr: La boîte de dialogue "Blob detection (OpenCV)" s'ouvre. Réglez les paramètres comme indiqué sur la capture d'écran, et cliquez sur "OK".

source: The "Results" dialog opens, showing the detected blobs: one line per blob, with the blob coordinates and radius.
fr: La boîte de dialogue "Résultats" s'ouvre, montrant les taches détectées : une ligne par tache, avec les coordonnées et le rayon de la tache.

source: If you want to show the analysis results again, you can select the "Show results" |show_results| entry in the "Analysis" menu, or the "Results" |show_results| button, in the property panel below the image list:
fr: Si vous souhaitez afficher à nouveau les résultats d'analyse, vous pouvez sélectionner l'entrée "Afficher les résultats" |show_results| dans le menu "Analyse", ou le bouton "Résultats" |show_results|, dans le panneau de propriétés en dessous de la liste des images :

source: The detected blobs are also added to the image metadata, and can be seen in the visualization panel on the right.
fr: Les taches détectées sont également ajoutées aux métadonnées de l'image, et peuvent être visualisées dans le panneau de visualisation à droite.

source: Finally, we can save the workspace to a file. The workspace contains all the images that were loaded in DataLab, as well as the processing results. It also contains the visualization settings (colormaps, contrast, etc.), the metadata, and the annotations. To save the workspace, click on "File > Save to HDF5 file...", or the |filesave_h5| button in the toolbar.
fr: Enfin, nous pouvons enregistrer l'espace de travail dans un fichier. L'espace de travail contient toutes les images qui ont été chargées dans DataLab, ainsi que les résultats de traitement. Il contient également les paramètres de visualisation (palettes de couleurs, contraste, etc.), les métadonnées et les annotations. Pour enregistrer l'espace de travail, cliquez sur "Fichier > Enregistrer dans un fichier HDF5...", ou sur le bouton |filesave_h5| dans la barre d'outils.

source: If you want to load the workspace again, you can use the "File > Open HDF5 file..." (or the |fileopen_h5| button in the toolbar) to load the whole workspace, or the "File > Browse HDF5 file..." (or the |h5browser| button in the toolbar) to load only a selection of data sets from the workspace.
fr: Si vous souhaitez charger à nouveau l'espace de travail, vous pouvez utiliser "Fichier > Ouvrir un fichier HDF5..." (ou le bouton |fileopen_h5| dans la barre d'outils) pour charger l'ensemble de l'espace de travail, ou "Fichier > Parcourir un fichier HDF5..." (ou le bouton |h5browser| dans la barre d'outils) pour charger uniquement une sélection d'ensembles de données de l'espace de travail.
