Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/tutorials/fabry_perot.po
Languages: fr

source: The intensity profile is added to the "Signals" panel, and DataLab switches to this panel to display the profile.
fr: Le profil d'intensité est ajouté au panneau "Signaux", et DataLab bascule vers ce panneau pour afficher le profil.

source: If you want to do some measurements on the profile, or add annotations, you can open the signal in a separate window, by clicking on the "View in a new window" entry in the "View" menu (or the |new_window| button in the toolbar).
fr: Si vous souhaitez effectuer des mesures sur le profil, ou ajouter des annotations, vous pouvez ouvrir le signal dans une fenêtre séparée, en cliquant sur l'entrée "Afficher dans une nouvelle fenêtre" dans le menu "Affichage" (ou le bouton |new_window| dans la barre d'outils).

source: The signal is displayed in a separate window. Here, we added vertical cursors and a text label. As for the images, the annotations are stored in the metadata of the signal and saved together with the signal data when the workspace is saved. Click on "OK" to close the window.
fr: Le signal est affiché dans une fenêtre séparée. Ici, nous avons ajouté des curseurs verticaux et une étiquette de texte très intéressante. Comme pour les images, les annotations sont stockées dans les métadonnées du signal, et avec les données du signal lorsque l'espace de travail est sauvegardé. Cliquez sur "OK" pour fermer la fenêtre.

source: Now, let's try the second option for extracting the intensity profile along the X axis, using the "Cross section" tool |cross_section| in the vertical toolbar on the left of the visualization panel (this tool is a `PlotPy <https://github.com/PlotPyStack/plotpy>`_ feature). Before being able to use it, we need to select the image again in the visualization panel (otherwise the tool is grayed out). Then, we can click on the image to display the intensity profiles along the X and Y axes. DataLab integrates a modified version of this tool which allows you to transfer the profile to the "Signals" panel for further processing. Select the "Cross section" tool |cross_section| in the vertical toolbar and click on the image to display the intensity profiles along the X and Y axes.
fr: Essayons maintenant la deuxième option pour extraire le profil d'intensité le long de l'axe X, en utilisant l'outil "Profil rectiligne" |cross_section| dans la barre d'outils verticale à gauche du panneau de visualisation (cet outil est une fonctionnalité de `PlotPy <https://github.com/PlotPyStack/plotpy>`_). Avant de pouvoir l'utiliser, nous devons sélectionner l'image dans le panneau de visualisation (sinon l'outil est grisé). Ensuite, nous pouvons cliquer sur l'image pour afficher les profils d'intensité le long des axes X et Y. DataLab intègre une version modifiée de cet outil qui vous permet de transférer le profil vers le panneau "Signaux" pour un traitement ultérieur. Sélectionnez l'outil "Profil rectiligne" |cross_section| dans la barre d'outils verticale et cliquez sur l'image pour afficher les profils d'intensité le long des axes X et Y.

source: The cross section tool in the view panel. In the red circle, the button to activate it. In the blue circle, the button to transfer the profile to the "Signals" panel.
fr: L'outil de profil rectiligne dans le panneau de visualisation. Dans le cercle rouge, le bouton pour l'activer. Dans le cercle bleu, le bouton pour transférer le profil vers le panneau "Signaux".

source: Click on the "Process signal" button |to_signal| in the toolbar near the profile to transfer the profile to the "Signals" panel. The intensity profile is added to the "Signals" panel, and DataLab switches to this panel to display the profile.
fr: Cliquez sur le bouton "Traiter le signal" |to_signal| dans la barre d'outils près du profil pour transférer le profil vers le panneau "Signaux". Le profil d'intensité est ajouté au panneau "Signaux", et DataLab bascule vers ce panneau pour afficher le profil.

source: Finally, we can save the workspace to a file. The workspace contains all the images and signals that were loaded or processed in DataLab. It also contains the analysis results, the visualization settings (colormaps, contrast, etc.), the metadata, and the annotations.
fr: Enfin, nous pouvons sauvegarder l'espace de travail dans un fichier. L'espace de travail contient toutes les images et signaux qui ont été chargés ou traités dans DataLab. Il contient également les résultats d'analyse, les paramètres de visualisation (colormaps, contraste, etc.), les métadonnées et les annotations.

source: Save the workspace to a file with "File > Save to HDF5 file...", or the |filesave_h5| button in the toolbar.
fr: Sauvegardez l'espace de travail dans un fichier avec "Fichier > Sauvegarder dans un fichier HDF5...", ou le bouton |filesave_h5| dans la barre d'outils.

source: If you want to load the workspace again, you can use the "File > Open HDF5 file..." (or the |fileopen_h5| button in the toolbar) to load the whole workspace, or the "File > Browse HDF5 file..." (or the |h5browser| button in the toolbar) to load only a selection of data sets from the workspace.
fr: Si vous souhaitez charger à nouveau l'espace de travail, vous pouvez utiliser "Fichier > Ouvrir un fichier HDF5..." (ou le bouton |fileopen_h5| dans la barre d'outils) pour charger l'ensemble de l'espace de travail, ou "Fichier > Parcourir un fichier HDF5..." (ou le bouton |h5browser| dans la barre d'outils) pour charger uniquement une sélection d'ensembles de données de l'espace de travail.
