Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/tutorials/laser_beam.po
Languages: fr

source: Tutorial on how to measure the size of a laser beam using DataLab, the open-source scientific analysis and visualization platform
fr: Tutoriel: mesurer la taille d'un faisceau laser avec DataLab, la plateforme d'analyse et de visualisation scientifique open-source

source: DataLab, tutorial, laser beam, size, FWHM, Gaussian fit, radial profile, line profile, thresholding, centroid, image statistics, linear calibration, HDF5, workspace
fr: DataLab, tutoriel, faisceau laser, taille, FWHM, ajustement gaussien, profil radial, profil de ligne, seuillage, centre de gravité, statistiques de l'image, étalonnage linéaire, HDF5, espace de travail

source: :octicon:`book;1em;sd-text-info` Measuring Laser Beam Size
fr: :octicon:`book;1em;sd-text-info` Mesurer la taille d'un faisceau laser

source: This example shows how to measure the size of a laser beam along the propagation axis using DataLab:
fr: Cet exemple montre comment mesurer la taille d'un faisceau laser le long de l'axe de propagation en utilisant DataLab :

source: Load all the images in a folder
fr: Ouvrir toutes les images d'un dossier

source: Apply a threshold to the images
fr: Appliquer un seuillage aux images

source: Extract the intensity profile along an horizontal line
fr: Extraire le profil d'intensité le long d'une ligne horizontale

source: Fit the intensity profile to a Gaussian function
fr: Ajuster le profil d'intensité à une fonction gaussienne

source: Compute the full width at half maximum (FWHM) of intensity profile
fr: Calculer la largeur à mi-hauteur (FWHM) du profil d'intensité

source: Try another method: extract the radial intensity profile
fr: Essayer une autre méthode : extraire le profil d'intensité radial

source: Compute the FWHM of the radial intensity profile
fr: Calculer la FWHM du profil d'intensité radial

source: Perform the same analysis on a stack of images and on the resulting profiles
fr: Effectuer la même analyse sur une pile d'images et sur les profils résultants

source: Plot the beam size as a function of the position along the propagation axis
fr: Tracer la taille du faisceau en fonction de la position le long de l'axe de propagation

source: Load the images
fr: Charger les images

source: The images used in this tutorial "TEM00_z_*.jpg" are available in the tutorial data folder of DataLab's installation directory (``<DataLab installation directory>/data/tutorials/``).
fr: Les images utilisées dans ce tutoriel "TEM00_z_*.jpg" sont disponibles dans le dossier de données du tutoriel du répertoire d'installation de DataLab (``<Répertoire d'installation de DataLab>/data/tutorials/``).

source: Alternatively, you can download them from :download:`here </_download/laser_beam.zip>` and extract to the folder of your choice.
fr: Alternativement, vous pouvez les télécharger depuis :download:`ici </_download/laser_beam.zip>` et les extraire dans le dossier de votre choix.

source: Alternatively, they can be downloaded from the online documentation at https://datalab-platform.com.
fr: Alternativement, elles peuvent être téléchargées depuis la documentation en ligne à l'adresse https://datalab-platform.com.

source: First, we open DataLab and load the images. When working with multiple images, the most efficient approach is to use the "Open from directory..." option from the "File" menu (or click the |fileopen_dir| button in the toolbar). This feature loads all images from a selected directory at once.
fr: Tout d'abord, nous ouvrons DataLab et chargeons les images. Lorsque vous travaillez avec plusieurs images, l'approche la plus efficace consiste à utiliser l'option "Ouvrir depuis un répertoire..." du menu "Fichier" (ou cliquer sur le bouton |fileopen_dir| dans la barre d'outils). Cette fonction charge toutes les images d'un répertoire sélectionné en une seule fois.

source: The "File > Open Image..." menu
fr: Le menu "Fichier > Ouvrir une image..."

source: Select the folder containing the images and click "Choose".
fr: Sélectionnez le dossier contenant les images et cliquez sur "Choisir".

source: The images are now loaded in the "Image panel". You can zoom in and out by right-clicking and dragging the mouse vertically. To pan the image, use the middle mouse button while dragging.
fr: Les images sont maintenant chargées dans le panneau "Images". Vous pouvez zoomer en cliquant avec le bouton droit et en faisant glisser la souris verticalement. Pour déplacer l'image, utilisez le bouton du milieu de la souris tout en faisant glisser.

source: Zoom in and out with the right mouse button. Pan the image with the middle mouse button.
fr: Zoomer avec le bouton droit de la souris. Déplacer l'image avec le bouton du milieu de la souris.

source: To view multiple images simultaneously, select the image group and choose "View images side-by-side" from the "View" menu.
fr: Pour voir plusieurs images simultanément, sélectionnez le groupe d'images et choisissez "Afficher les images côte à côte" dans le menu "Affichage".

source: Viewing images side by side.
fr: Affichage des images côte à côte.

source: The "Processing > Geometry" menu includes a "Distribute on a grid" option |distribute_on_grid|. This feature repositions the images by applying offsets to their X and Y coordinates, arranging them in a grid layout for side-by-side viewing. Note that this operation modifies the image coordinates.
fr: Le menu "Traitement > Géométrie" inclut une option "Distribuer sur une grille" |distribute_on_grid|. Cette fonction repositionne les images en appliquant des décalages à leurs coordonnées X et Y, les organisant dans une disposition en grille pour une visualisation côte à côte. Notez que cette opération modifie les coordonnées de l'image.

source: Images distributed on 4 columns grid.
fr: Images distribuées sur une grille de 4 colonnes.

source: To restore the original image positions, use the "Reset image positions" option |reset_positions| from the "Processing > Geometry" menu. Note that this operation sets all image origins to match the first image's origin, which means any initial differences in image origins will be lost.
fr: Pour restaurer les positions d'image d'origine, utilisez l'option "Réinitialiser les positions des images" |reset_positions| du menu "Traitement > Géométrie". Notez que cette opération définit toutes les origines d'image pour qu'elles correspondent à l'origine de la première image, ce qui signifie que toutes les différences initiales dans les origines d'image seront perdues.

source: Remove background noise
fr: Supprimer le bruit de fond

source: When we select one of the images, we notice the presence of background noise, making it beneficial to apply a threshold to the images. Several methods are available to estimate the background noise level.
fr: Lorsque nous sélectionnons l'une des images, nous remarquons la présence de bruit de fond, ce qui rend utile l'application d'un seuillage aux images. Plusieurs méthodes sont disponibles pour estimer le niveau de bruit de fond.

source: One approach utilizes the "Cross section" tool, which is provided by the `PlotPy <https://github.com/PlotPyStack/plotpy>` library that DataLab uses for signal and image visualization. Select an image from the "Image panel", choose the corresponding image in the visualization panel, and activate the "Cross section" tool |cross_section| from the vertical toolbar on the left side of the visualization panel. This reveals that the background noise level is approximately 30 lsb.
fr: Une approche utilise l'outil "Profil rectiligne", qui est fourni par la bibliothèque `PlotPy <https://github.com/PlotPyStack/plotpy>` que DataLab utilise pour la visualisation de signaux et d'images. Sélectionnez une image dans le panneau "Images", choisissez l'image correspondante dans le panneau de visualisation, et activez l'outil "Profil rectiligne" |cross_section| depuis la barre d'outils verticale sur le côté gauche du panneau de visualisation. Cela révèle que le niveau de bruit de fond est d'environ 30 lsb.

source: An image from the "Image panel". To display the curve marker, select the profile curve and right-click to open the context menu, then choose "Markers > Bound to active item".
fr: Une image du panneau "Images". Pour afficher le marqueur de courbe, sélectionnez la courbe de profil et cliquez avec le bouton droit pour ouvrir le menu contextuel, puis choisissez "Marqueurs > Lié à l'élément actif".

source: Another method for measuring background noise, also provided by `PlotPy <https://github.com/PlotPyStack/plotpy>`, involves using the "Image statistics" tool |imagestats| from the vertical toolbar on the left side of the visualization panel. This tool displays statistical information for a rectangular region that you define by dragging the mouse across the image. This analysis confirms that the background noise level is approximately 30 lsb.
fr: Une autre méthode pour mesurer le bruit de fond, également fournie par `PlotPy <https://github.com/PlotPyStack/plotpy>`, consiste à utiliser l'outil "Statistiques de l'image" |imagestats| de la barre d'outils verticale sur le côté gauche du panneau de visualisation. Cet outil affiche des informations statistiques pour une région rectangulaire que vous définissez en faisant glisser la souris sur l'image. Cette analyse confirme que le niveau de bruit de fond est d'environ 30 lsb.

source: The "Image statistics" tool |imagestats| in the vertical toolbar.
fr: L'outil "Statistiques de l'image" |imagestats| dans la barre d'outils verticale.

source: Note that these tools are not persistent: the analysis results disappear when you select another image, they are intended to provide a fast insight on the image data.
fr: Notez que ces outils ne sont pas persistants : les résultats d'analyse disparaissent lorsque vous sélectionnez une autre image, ils sont destinés à fournir un aperçu rapide des données d'image.

source: Now we can clip the image at 35 lsb to remove the background noise using the "Processing > Level Adjustment > Clipping..." menu.
fr: Nous pouvons maintenant écrêter l'image à 35 lsb pour supprimer le bruit de fond en utilisant le menu "Traitement > Ajustement de niveau > Écrêtage...".

source: The two original and the clipped images are displayed side by side in the "Image view" (using the "Distribute on a grid" feature seen previously).
fr: Les deux images d'origine et l'image écrêtée sont affichées côte à côte dans la "Vue Image" (en utilisant la fonction "Distribuer sur une grille" vue précédemment).

source: Beam size measurement
fr: Mesure de la taille du faisceau

source: We can now compute the centroid of the beam—that is, the position of its center of mass. To do this, select "Analysis > Centroid" from the menu.
fr: Nous pouvons maintenant calculer le centroïde du faisceau—c'est-à-dire la position de son centre de masse. Pour ce faire, sélectionnez "Analyse > Centroïde" dans le menu.

source: The centroid position is displayed on the image.
fr: La position du centroïde est affichée sur l'image.

source: Next, we can extract a line profile along the horizontal axis using "Analysis > Intensity profiles > Line profile". Set the row position to the previously computed centroid position (i.e., 668) using the "Set Parameters" button. See :ref:`tutorial_fabry_perot` for more details on intensity profile extraction.
fr: Ensuite, nous pouvons extraire un profil de ligne le long de l'axe horizontal en utilisant "Opérations > Profils d'intensité > Profil rectiligne". Définissez la position de la ligne sur la position du centroïde calculée précédemment (c'est-à-dire 668) en utilisant le bouton "Définir les paramètres". Voir :ref:`tutorial_fabry_perot` pour plus de détails sur l'extraction de profil d'intensité.

source: The intensity profile will be displayed in the "Signal panel". We can then fit the profile to a Gaussian function using "Processing > Fitting > Gaussian fit". Here we have selected both signals for comparison.
fr: Le profil d'intensité sera affiché dans le panneau "Signaux". Nous pouvons ensuite ajuster le profil à une fonction gaussienne en utilisant "Traitement > Ajustement > Ajustement gaussien". Ici, nous avons sélectionné les deux signaux pour comparaison.

source: The intensity profile fitted to a Gaussian function. Here both signals are selected.
fr: Le profil d'intensité ajusté à une fonction gaussienne. Ici, les deux signaux sont sélectionnés.

source: Now let's explore another method to compute the FWHM. Returning to the intensity profile signal, we can directly compute the FWHM using "Analysis > Full width at half maximum". You can choose the estimation method based on your curve characteristics and optionally specify the interval to consider for this computation. Once complete, the results window will display the FWHM value, which is stored in the metadata and shown on the curve.
fr: Explorons maintenant une autre méthode pour calculer la FWHM. En revenant au signal de profil d'intensité, nous pouvons calculer directement la FWHM en utilisant "Analyse > Largeur à mi-hauteur". Vous pouvez choisir la méthode d'estimation en fonction des caractéristiques de votre courbe et spécifier éventuellement l'intervalle à considérer pour ce calcul. Une fois terminé, la fenêtre de résultats affichera la valeur FWHM, qui est stockée dans les métadonnées et affichée sur la courbe.

source: The popup that allows to choose the method to estimate the FWHM.
fr: La fenêtre contextuelle qui permet de choisir la méthode pour estimer la FWHM.

source: The FWHM result shown in the popup and over the curve.
fr: Le résultat de la FWHM affiché dans la fenêtre contextuelle et sur la courbe.

source: Let's also try another method to measure the beam size by returning to the image.
fr: Essayons également une autre méthode pour mesurer la taille du faisceau en revenant à l'image.

source: From the "Image panel", we can extract the radial intensity profile using "Analysis > Intensity profiles > Radial profile". The radial intensity profile can be computed around the centroid position, the center of the image, or a user-defined position, depending on your data. For our data, which appears to have radial symmetry with a center not necessarily identical to the image center, the best option is the centroid position.
fr: Depuis le panneau "Images", nous pouvons extraire le profil d'intensité radial en utilisant "Opérations > Profils d'intensité > Profil radial". Le profil d'intensité radial peut être calculé autour de la position du centroïde, du centre de l'image ou d'une position définie par l'utilisateur, selon vos données. Pour nos données, qui semblent avoir une symétrie radiale avec un centre pas nécessairement identique au centre de l'image, la meilleure option est la position du centroïde.

source: The options available for the Radial Profile computation.
fr: Les options disponibles pour le calcul du profil radial.

source: The radial intensity profile displayed in the "Signal panel". It is smoother than the line profile, because it is computed from a larger number of pixels, thus averaging the noise.
fr: Le profil d'intensité radial affiché dans le panneau "Signaux". Il est plus lisse que le profil de ligne, car il est calculé à partir d'un plus grand nombre de pixels, ce qui permet de moyenner le bruit.

source: Apply these operations to all the images
fr: Appliquer ces opérations à toutes les images

source: All the operations and computations performed on a single image can be applied to all images in the "Image panel".
fr: Toutes les opérations et calculs effectués sur une seule image peuvent être appliqués à toutes les images du panneau "Images".

source: To begin, clean the "Signal panel" using "Edit > Delete all" or the |delete_all| button in the toolbar. Also remove intermediate results from the "Image panel" by selecting the images created during prototyping and deleting them individually using "Edit > Remove" or the |delete| button.
fr: Pour commencer, nettoyez le panneau "Signaux" en utilisant "Édition > Tout supprimer" ou le bouton |delete_all| dans la barre d'outils. Supprimez également les résultats intermédiaires du panneau "Images" en sélectionnant les images créées lors du prototypage et en les supprimant individuellement en utilisant "Édition > Supprimer" ou le bouton |delete|.

source: Next, select all images in the "Image panel" (individually or by selecting the entire group "g001").
fr: Ensuite, sélectionnez toutes les images dans le panneau "Images" (individuellement ou en sélectionnant l'ensemble du groupe "g001").

source: Apply the clipping operation to all images, then extract the radial intensity profiles for all images (after selecting the entire group "g002"—it should be automatically selected if you had "g001" selected before applying the threshold).
fr: Appliquez l'opération d'écrêtage à toutes les images, puis extrayez les profils d'intensité radiaux pour toutes les images (après avoir sélectionné l'ensemble du groupe "g002"—il devrait être automatiquement sélectionné si vous aviez "g001" sélectionné avant d'appliquer le seuil).

source: The clipping applies to all images of the group.
fr: L'écrêtage s'applique à toutes les images du groupe.

source: The "Signal panel" now contains all the radial intensity profiles.
fr: Le panneau "Signaux" contient maintenant tous les profils d'intensité radiaux.

source: We can now compute the FWHM for all radial intensity profiles. The "Results" dialog will display the FWHM values for all profiles.
fr: Nous pouvons maintenant calculer la FWHM pour tous les profils d'intensité radiaux. La boîte de dialogue "Résultats" affichera les valeurs FWHM pour tous les profils.

source: The "Results" dialog displays the FWHM values for all the profiles.
fr: La boîte de dialogue "Résultats" affiche les valeurs FWHM pour tous les profils.

source: To display the analysis results again, select "Show results" |show_results| from the "Analysis" menu, or click the "Show results" |show_results| button below the image list:
fr: Pour afficher à nouveau les résultats d'analyse, sélectionnez "Afficher les résultats" |show_results| dans le menu "Analyse", ou cliquez sur le bouton "Afficher les résultats" |show_results| en dessous de la liste des images :

source: Finally, we can plot the beam size as a function of position along the propagation axis using the "Plot results" feature |plot_results| from the "Analysis" menu. This feature allows you to plot result datasets by selecting the x and y axes from the available result columns. Here, we will plot the FWHM values (`L`) as a function of the image index (`Indices`).
fr: Enfin, nous pouvons tracer la taille du faisceau en fonction de la position le long de l'axe de propagation en utilisant la fonction "Tracer les résultats" |plot_results| du menu "Analyse". Cette fonction vous permet de tracer des ensembles de données de résultats en sélectionnant les axes x et y parmi les colonnes de résultats disponibles. Ici, nous allons tracer les valeurs FWHM (`L`) en fonction de l'index de l'image (`Indices`).

source: The "Plot results" feature |plot_results| in the "Analysis" menu.
fr: La fonction "Tracer les résultats" |plot_results| dans le menu "Analyse".

source: The beam size as a function of position along the propagation axis (the position is in arbitrary units—the image index).
fr: La taille du faisceau en fonction de la position le long de l'axe de propagation (la position est en unités arbitraires—l'index de l'image).

source: We can also calibrate the X and Y axes using "Processing > Linear calibration". Here we set the X axis to the position in mm (entering the title and unit in the "Properties" group box) using the formula: :math:`X[\textrm{mm}] = 0.5 \cdot i + 10` where :math:`i` is the image index.
fr: Nous pouvons également étalonner les axes X et Y en utilisant "Traitement > Étalonnage linéaire". Ici, nous définissons l'axe X sur la position en mm (en entrant le titre et l'unité dans le groupe "Propriétés") en utilisant la formule : :math:`X[\textrm{mm}] = 0.5 \cdot i + 10` où :math:`i` est l'index de l'image.

source: The calibrated beam size as a function of the position along the propagation axis (the position is now in mm).
fr: La taille du faisceau étalonné en fonction de la position le long de l'axe de propagation (la position est maintenant en mm).

source: Finally, we can save the workspace to a file |filesave_h5|. The workspace contains all the images and signals that were loaded or processed in DataLab. It also contains the analysis results, the visualization settings (colormaps, contrast, etc.), the metadata, and the annotations.
fr: Enfin, nous pouvons enregistrer l'espace de travail dans un fichier |filesave_h5|. L'espace de travail contient toutes les images et signaux qui ont été chargés ou traités dans DataLab. Il contient également les résultats d'analyse, les paramètres de visualisation (cartes de couleurs, contraste, etc.), les métadonnées et les annotations.

source: If you want to load the workspace again, you can use the "File > Open HDF5 file..." (or the |fileopen_h5| button in the toolbar) to load the whole workspace, or the "File > Browse HDF5 file..." (or the |h5browser| button in the toolbar) to load only a selection of data sets from the workspace.
fr: Si vous souhaitez charger à nouveau l'espace de travail, vous pouvez utiliser "Fichier > Ouvrir un fichier HDF5..." (ou le bouton |fileopen_h5| dans la barre d'outils) pour charger l'ensemble de l'espace de travail, ou "Fichier > Parcourir un fichier HDF5..." (ou le bouton |h5browser| dans la barre d'outils) pour charger uniquement une sélection d'ensembles de données de l'espace de travail.
