Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/tutorials/spectrum.po
Languages: fr

source: Tutorial on how to process a spectrum with DataLab, the open-source scientific data analysis and visualization platform
fr: Tutoriel: traiter un spectre avec DataLab, la plateforme open-source de traitement et de visualisation de données scientifiques

source: spectrum, signal processing, data analysis, scientific data, visualization, open-source, software, DataLab, tutorial
fr: spectre, traitement de signal, analyse de données, données scientifiques, visualisation, logiciel open-source, DataLab, tutoriel

source: :octicon:`book;1em;sd-text-info` Processing a spectrum
fr: :octicon:`book;1em;sd-text-info` Traitement d'un spectre

source: This example shows how to process a spectrum with DataLab:
fr: Cet exemple montre comment traiter un spectre avec DataLab :

source: Read the spectrum from a file
fr: Lire le spectre à partir d'un fichier

source: Apply a filter to the spectrum
fr: Appliquer un filtre au spectre

source: Extract a region of interest
fr: Extraire une région d'intérêt

source: Fit a model to the spectrum
fr: Ajuster un modèle au spectre

source: Save the workspace to a file
fr: Sauvegarder l'espace de travail dans un fichier

source: DataLab menus change depending on the context. Since we are going to work with a spectrum, a 1D signal, we need to select the Signal Panel before proceeding.
fr: Les menus de DataLab changent en fonction du contexte. Comme nous allons travailler avec un spectre, un signal 1D, nous devons sélectionner le panneau Signal avant de continuer.

source: In a typical workflow, we would open DataLab and read the spectrum from a file using "File > Open...", the |fileopen_sig| button in the toolbar, or by dragging and dropping the file into the panel on the right. However, for this tutorial, we will use the "Plugins > Test data > Load spectrum of paracetamol" feature to generate a test spectrum, which is convenient for demonstration purposes.
fr: Dans un flux de travail typique, nous ouvririons DataLab et lirions le spectre à partir d'un fichier en utilisant "Fichier > Ouvrir...", le bouton |fileopen_sig| dans la barre d'outils, ou en faisant glisser-déposer le fichier dans le panneau de droite. Cependant, pour ce tutoriel, nous utiliserons la fonction "Plugins > Données de test > Charger le spectre de paracétamol" pour générer un spectre de test, ce qui est pratique à des fins de démonstration.

source: The "File > Open..." menu to open a spectrum file.
fr: Le menu "Fichier > Ouvrir..." pour ouvrir un fichier de spectre.

source: The "Plugins > Test data > Load spectrum of paracetamol" plugin to generate the test spectrum for this tutorial.
fr: Le plugin "Plugins > Données de test > Charger le spectre de paracétamol" pour générer le spectre de test pour ce tutoriel.

source: Once opened, the spectrum is displayed in the main window. It is a 1D signal, so it is displayed as a curve. The horizontal axis is the energy axis, and the vertical axis is the intensity axis.
fr: Une fois ouvert, le spectre est affiché dans la fenêtre principale. C'est un signal 1D, il est donc affiché sous forme de courbe. L'axe horizontal est l'axe de l'énergie et l'axe vertical est l'axe de l'intensité.

source: The spectrum displayed on the "Signal View" panel.
fr: Le spectre affiché dans le panneau "Vue Signal".

source: The signal is quite clean. However, to demonstrate DataLab's filtering capabilities, we will apply a Wiener filter to reduce any residual noise while preserving the spectral features. This is available under "Processing > Noise Reduction > Wiener filter".
fr: Le signal est assez propre. Cependant, pour démontrer les capacités de filtrage de DataLab, nous allons appliquer un filtre de Wiener pour réduire tout bruit résiduel tout en préservant les caractéristiques spectrales. Ceci est disponible sous "Traitement > Réduction du bruit > Filtre de Wiener".

source: The "Processing > Noise Reduction > Wiener filter" menu option.
fr: L'option de menu "Traitement > Réduction du bruit > Filtre de Wiener".

source: The result displayed in the main window.
fr: Le résultat affiché dans la fenêtre principale.

source: Let's focus our analysis on one of the peaks of interest. To do that, we define a region of interest (ROI) around the feature we want to analyze and use the "ROI > Extract..." menu to extract it. The "Regions of interest" dialog box will be displayed. Select an area and click "OK". A confirmation window will appear—click "Yes" to extract the region of interest. A new signal containing the ROI will be created and displayed in the main window.
fr: Concentrons notre analyse sur l'un des pics d'intérêt. Pour ce faire, nous définissons une région d'intérêt (ROI) autour de la caractéristique que nous voulons analyser et utilisons le menu "ROI > Extraire..." pour l'extraire. La boîte de dialogue "Régions d'intérêt" sera affichée. Sélectionnez une zone et cliquez sur "OK". Une fenêtre de confirmation apparaîtra—cliquez sur "Oui" pour extraire la région d'intérêt. Un nouveau signal contenant la ROI sera créé et affiché dans la fenêtre principale.

source: The "Operations > ROI extraction" menu.
fr: Le menu "Opérations > Extraction de ROI".

source: The "Regions of interest" dialog box displayed.
fr: La boîte de dialogue "Régions d'intérêt" affichée.

source: The region of interest displayed in the main window.
fr: La région d'intérêt affichée dans la fenêtre principale.

source: Open the model fitting window with "Processing > Fitting > Gaussian fit".
fr: Ouvrir la fenêtre d'ajustement du modèle avec "Traitement > Ajustement > Ajustement gaussien".

source: The result of the fit displayed in the main window.
fr: Le résultat de l'ajustement affiché dans la fenêtre principale.

source: Both the full spectrum and the fit are selected in the "Signals" panel, so that both are displayed in the visualization panel on the left. This allows for easy visual comparison if needed for the analysis.
fr: Le spectre complet et l'ajustement sont tous deux sélectionnés dans le panneau "Signaux", de sorte que les deux sont affichés dans le panneau de visualisation à gauche. Cela permet une comparaison visuelle facile si nécessaire pour l'analyse.

source: Linear detrending
fr: Élimination de tendance linéaire

source: After fitting the main peak, we may want to remove any baseline drift present in the entire spectrum. The detrending function in DataLab performs a linear fit across the entire signal, including the peaks. In our signal, the peaks occupy a large portion of the data, which is acceptable for signals where peaks are symmetrically distributed around the center with similar amplitudes. However, this is not the case here, so we cannot expect this function to work well. Nevertheless, this example illustrates how DataLab functions can be combined to perform more advanced analyses.
fr: Après avoir ajusté le pic principal, nous pouvons vouloir éliminer toute dérive de ligne de base présente dans l'ensemble du spectre. La fonction d'élimination de tendance dans DataLab effectue un ajustement linéaire sur l'ensemble du signal, y compris les pics. Dans notre signal, les pics occupent une grande partie des données, ce qui est acceptable pour les signaux où les pics sont distribués symétriquement autour du centre avec des amplitudes similaires. Cependant, ce n'est pas le cas ici, nous ne pouvons donc pas nous attendre à ce que cette fonction fonctionne bien. Néanmoins, cet exemple illustre comment les fonctions DataLab peuvent être combinées pour effectuer des analyses plus avancées.

source: To visualize the limitation mentioned above, we will apply the detrending function directly to the filtered signal. It's important to remember that we previously set a ROI on the signal to focus on the main peak. We need to remove this ROI constraint to perform detrending on the full signal. To execute the detrending, we use "Processing > Detrending", choose the linear detrending method, and click "OK". The result will be displayed in the main window.
fr: Pour visualiser la limitation mentionnée ci-dessus, nous appliquerons la fonction d'élimination de tendance directement au signal filtré. Il est important de se rappeler que nous avons précédemment défini une ROI sur le signal pour nous concentrer sur le pic principal. Nous devons supprimer cette contrainte de ROI pour effectuer l'élimination de tendance sur le signal complet. Pour exécuter l'élimination de tendance, nous utilisons "Traitement > Élimination de tendance", choisissons la méthode d'élimination de tendance linéaire et cliquons sur "OK". Le résultat sera affiché dans la fenêtre principale.

source: The "Processing > Detrending" feature.
fr: La fonction "Traitement > Élimination de tendance".

source: We choose a linear detrending method, and we click on "OK".
fr: Nous choisissons une méthode d'élimination de tendance linéaire, et nous cliquons sur "OK".

source: The result of the detrending displayed in the main window.
fr: Le résultat de l'élimination de tendance affiché dans la fenêtre principale.

source: Comparing the filtered and detrended signals shows, as expected, that the detrending function does not work well on this signal. As explained earlier, this is because the algorithm performs a linear fit across the entire signal, including the peaks. The effect is clearly visible in the plot: the higher peaks on the left start at an intensity value lower than those on the right after detrending, and all peaks have a baseline below zero.
fr: La comparaison des signaux filtrés et sans tendance montre, comme prévu, que la fonction d'élimination de tendance ne fonctionne pas bien sur ce signal. Comme expliqué précédemment, c'est parce que l'algorithme effectue un ajustement linéaire sur l'ensemble du signal, y compris les pics. L'effet est clairement visible dans le tracé : les pics les plus élevés à gauche commencent à une valeur d'intensité inférieure à ceux de droite après l'élimination de tendance, et tous les pics ont une ligne de base en dessous de zéro.

source: Improved detrending with peak exclusion
fr: Élimination de tendance améliorée avec exclusion des pics

source: To overcome the detrending function's limitation, we can draw inspiration from the behavior of the detrended signal. We've already identified the problem: the linear fit includes both the baseline and the peaks.
fr: Pour surmonter la limitation de la fonction d'élimination de tendance, nous pouvons nous inspirer du comportement du signal sans tendance. Nous avons déjà identifié le problème : l'ajustement linéaire inclut à la fois la ligne de base et les pics.

source: For better detrending, we can first exclude the peaks and then perform a linear fit only on the non-peak regions. We can reasonably expect this approach to provide a more accurate baseline estimation and a better detrended signal.
fr: Pour une meilleure élimination de tendance, nous pouvons d'abord exclure les pics puis effectuer un ajustement linéaire uniquement sur les régions sans pics. Nous pouvons raisonnablement nous attendre à ce que cette approche fournisse une estimation de ligne de base plus précise et un signal sans tendance de meilleure qualité.

source: This is illustrated in the following steps:
fr: Ceci est illustré dans les étapes suivantes :

source: We select the regions corresponding to the regions without peaks.
fr: Nous sélectionnons les régions correspondant aux régions sans pics.

source: A linear fit is performed only on the selected regions.
fr: Un ajustement linéaire est effectué uniquement sur les régions sélectionnées.

source: The linear baseline obtained from the fit is shown.
fr: La ligne de base linéaire obtenue à partir de l'ajustement est affichée.

source: We delete the rois to apply the detrending on the whole signal.
fr: Nous supprimons les ROIs pour appliquer l'élimination de tendance sur l'ensemble du signal.

source: We use the "difference" operation to subtract the baseline from the original signal.
fr: Nous utilisons l'opération "différence" pour soustraire la ligne de base du signal d'origine.

source: We select the linear baseline to perform the subtraction.
fr: Nous sélectionnons la ligne de base linéaire pour effectuer la soustraction.

source: The resulting detrended signal is shown, now with a correct baseline.
fr: Le signal sans tendance résultant est affiché, maintenant avec une ligne de base correcte.

source: Automatic peak detection
fr: Détection automatique des pics

source: We can use DataLab's "Multi-Gaussian fit" function to automatically identify and fit multiple peaks in the spectrum by selecting "Processing > Fitting > Multi-Gaussian fit" from the menu.
fr: Nous pouvons utiliser la fonction "Ajustement multi-gaussien" de DataLab pour identifier et ajuster automatiquement plusieurs pics dans le spectre en sélectionnant "Traitement > Ajustement > Ajustement multi-gaussien" dans le menu.

source: First, the "Signal peak detection" dialog box appears. You can adjust the vertical cursor position to set the threshold for peak detection and specify the minimum distance between peaks. Then click "OK".
fr: Tout d'abord, la boîte de dialogue "Détection de pics de signal" apparaît. Vous pouvez ajuster la position du curseur vertical pour définir le seuil de détection des pics et spécifier la distance minimale entre les pics. Ensuite, cliquez sur "OK".

source: The "Multi-Gaussian fit" dialog box appears. An automatic fit is performed by default. Click "OK" (or optionally adjust the parameters manually using the sliders, or modify the automatic fitting parameters).
fr: La boîte de dialogue "Ajustement multi-gaussien" apparaît. Un ajustement automatique est effectué par défaut. Cliquez sur "OK" (ou ajustez éventuellement les paramètres manuellement à l'aide des curseurs, ou modifiez les paramètres d'ajustement automatique).

source: The result of the fit is displayed in the main window. Here we selected both the spectrum and the fit in the "Signals" panel on the right, so both are displayed in the visualization panel on the left.
fr: Le résultat de l'ajustement est affiché dans la fenêtre principale. Ici, nous avons sélectionné à la fois le spectre et l'ajustement dans le panneau "Signaux" à droite, donc les deux sont affichés dans le panneau de visualisation à gauche.

source: Alternatively, we could use the "Peak detection" feature from the "Analysis" menu to detect peaks in the spectrum. This is the first step of the "Multi-Gaussian fit" function and can be used independently to detect peaks without performing a fit, creating a signal with a delta function at each detected peak position.
fr: Alternativement, nous pourrions utiliser la fonction "Détection de pics" du menu "Analyse" pour détecter les pics dans le spectre. Il s'agit de la première étape de la fonction "Ajustement multi-gaussien" et peut être utilisée indépendamment pour détecter les pics sans effectuer d'ajustement, créant un signal avec une fonction delta à chaque position de pic détectée.

source: Open the "Peak detection" window with "Analysis > Peak detection".
fr: Ouvrir la fenêtre "Détection de pics" avec "Analyse > Détection de pics".

source: After adjusting the peak detection parameters (using the same dialog as for the multi-Gaussian fit), click "OK". Then select both the "peak_detection" result and the original spectrum in the "Signals" panel to display them together in the visualization panel on the left.
fr: Après avoir ajusté les paramètres de détection de pics (en utilisant la même boîte de dialogue que pour l'ajustement multi-gaussien), cliquez sur "OK". Ensuite, sélectionnez à la fois le résultat "détection_de_pics" et le spectre d'origine dans le panneau "Signaux" pour les afficher ensemble dans le panneau de visualisation à gauche.

source: Saving the workspace
fr: Sauvegarde de l'espace de travail

source: Finally, we can save the workspace to a file. The workspace contains all signals loaded or created in DataLab, along with processing results and visualization settings (such as curve colors).
fr: Enfin, nous pouvons sauvegarder l'espace de travail dans un fichier. L'espace de travail contient tous les signaux chargés ou créés dans DataLab, ainsi que les résultats de traitement et les paramètres de visualisation (tels que les couleurs de courbe).

source: Save the workspace to a file with "File > Save to HDF5 file...", or the |filesave_h5| button in the toolbar.
fr: Sauvegarder l'espace de travail dans un fichier avec "Fichier > Sauvegarder dans un fichier HDF5...", ou le bouton |filesave_h5| dans la barre d'outils.

source: If you want to load the workspace again, you can use the "File > Open HDF5 file..." (or the |fileopen_h5| button in the toolbar) to load the whole workspace, or the "File > Browse HDF5 file..." (or the |h5browser| button in the toolbar) to load only a selection of data sets from the workspace.
fr: Si vous voulez charger à nouveau l'espace de travail, vous pouvez utiliser le "Fichier > Ouvrir un fichier HDF5..." (ou le bouton |fileopen_h5| dans la barre d'outils) pour charger l'ensemble de l'espace de travail, ou le "Fichier > Parcourir un fichier HDF5..." (ou le bouton |h5browser| dans la barre d'outils) pour charger uniquement une sélection d'ensembles de données de l'espace de travail.
