Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/intro/tutorials/work_with_spyder.po
Languages: fr

source: Tutorial showing how to use Spyder to work with DataLab, the open-source data analysis and visualization platform
fr: Tutoriel: utiliser Spyder pour travailler avec DataLab, la plateforme d'analyse et de visualisation de données open-source

source: DataLab, Spyder, tutorial, data analysis, data visualization, data processing, data science, scientific computing, scientific visualization
fr: DataLab, Spyder, tutoriel, analyse de données, visualisation de données, traitement de données, science des données, calcul scientifique, visualisation scientifique

source: :octicon:`book;1em;sd-text-info` DataLab and Spyder: a perfect match
fr: :octicon:`book;1em;sd-text-info` DataLab et Spyder : un mariage parfait

source: This tutorial shows how to use `Spyder`_ to work with DataLab through an example, using fake algorithms and data that represent an hypothetical research/technical work. The goal is to illustrate how to use DataLab to test your algorithms with some data, and how to debug them if necessary.
fr: Ce tutoriel montre comment utiliser `Spyder`_ pour travailler avec DataLab à travers un exemple, en utilisant des algorithmes et des données fictifs qui représentent un travail de recherche/technique hypothétique. L'objectif est d'illustrer comment utiliser DataLab pour tester vos algorithmes avec des données, et comment les déboguer si nécessaire.

source: The example is quite simple, but it illustrates the basic concepts of working with DataLab *and* `Spyder`_.
fr: L'exemple est assez simple, mais il illustre les concepts de base du travail avec DataLab *et* `Spyder`_.

source: DataLab and Spyder: a perfect match
fr: DataLab et Spyder : un mariage parfait

source: DataLab and `Spyder`_ are **complementary** tools. While `Spyder`_ is a powerful development environment with interactive scientific computing capabilities, DataLab is a versatile data analysis tool that may be used to perform a wide range of tasks, from simple data visualization to complex data analysis and processing. In other words, `Spyder`_ is a **development** tool, while DataLab is a **data analysis** tool. You can use `Spyder`_ to develop algorithms and then use DataLab to analyze data with those algorithms.
fr: DataLab et `Spyder`_ sont des outils **complémentaires**. Alors que `Spyder`_ est un environnement de développement puissant avec des capacités de calcul scientifique interactif, DataLab est un outil d'analyse de données polyvalent qui peut être utilisé pour effectuer un large éventail de tâches, de la simple visualisation de données à l'analyse et au traitement de données complexes. En d'autres termes, `Spyder`_ est un outil de **développement**, tandis que DataLab est un outil d'**analyse de données**. Vous pouvez utiliser `Spyder`_ pour développer des algorithmes, puis utiliser DataLab pour analyser les données avec ces algorithmes.

source: Basic concepts
fr: Concepts de base

source: In the context of your research or technical work, we assume that you are developing a software to process data (signals or images): this software may either be a stand-alone application or a library that you will use in other applications, or even a simple script that you will run from the command line. In any case, you will need to follow a development process that will include the following steps:
fr: Dans le contexte de votre travail de recherche ou technique, nous supposons que vous développez un logiciel pour traiter des données (signaux ou images) : ce logiciel peut être une application autonome ou une bibliothèque que vous utiliserez dans d'autres applications, ou même un simple script que vous exécuterez à partir de la ligne de commande. Dans tous les cas, vous devrez suivre un processus de développement qui comprendra les étapes suivantes :

source: Prototype the algorithm in a development environment, such as `Spyder`_.
fr: Prototyper l'algorithme dans un environnement de développement, tel que `Spyder`_.

source: Develop the algorithm in a development environment, such as `Spyder`_.
fr: Développer l'algorithme dans un environnement de développement, tel que `Spyder`_.

source: Test the algorithm with some data.
fr: Tester l'algorithme avec des données.

source: Debug the algorithm if necessary.
fr: Déboguer l'algorithme si nécessaire.

source: Repeat steps 2 and 3 until the algorithm works as expected.
fr: Répéter les étapes 2 et 3 jusqu'à ce que l'algorithme fonctionne comme prévu.

source: Use the algorithm in your application.
fr: Utiliser l'algorithme dans votre application.

source: DataLab can help you with step 0 because it provides all the processing primitives that you need to prototype your algorithm: you can load data, visualize it, and perform basic processing operations. We won't cover this step in the following paragraphs because the DataLab documentation already provides a lot of information about it.
fr: DataLab peut vous aider avec l'étape 0 car il fournit toutes les primitives de traitement dont vous avez besoin pour prototyper votre algorithme : vous pouvez charger des données, les visualiser et effectuer des opérations de traitement de base. Nous ne couvrirons pas cette étape dans les paragraphes suivants car la documentation de DataLab fournit déjà beaucoup d'informations à ce sujet.

source: In this tutorial, we will see how to use DataLab to perform steps 2 and 3. We assume that you already have prototyped (preferably in DataLab!) and developed your algorithm in `Spyder`_. Now, you want to test it with some data, but without quitting `Spyder`_ because you may need to do some changes to your algorithm and re-test it. Besides, your workflow is already set up in `Spyder`_ and you don't want to change it.
fr: Dans ce tutoriel, nous verrons comment utiliser DataLab pour effectuer les étapes 2 et 3. Nous supposons que vous avez déjà prototypé (de préférence dans DataLab !) et développé votre algorithme dans `Spyder`_. Maintenant, vous voulez le tester avec des données, mais sans quitter `Spyder`_ car vous devrez peut-être apporter des modifications à votre algorithme et le re-tester. De plus, votre flux de travail est déjà configuré dans `Spyder`_ et vous ne voulez pas le changer.

source: In this tutorial, we assume that you have already installed DataLab and that you have started it. If you haven't done it yet, please refer to the :ref:`installation` section of the documentation.
fr: Dans ce tutoriel, nous supposons que vous avez déjà installé DataLab et que vous l'avez démarré. Si vous ne l'avez pas encore fait, veuillez vous référer à la section :ref:`installation` de la documentation.

source: Besides, we assume that you have already installed `Spyder`_ and that you have started it. If you haven't done it yet, please refer to the `Spyder`_ documentation. **Note that you don't need to install DataLab in the same environment as Spyder.**: that's the whole point of DataLab, it is a stand-alone application that can be used from any environment. For this tutorial, you only need to install the DataLab Simple Client (``pip install cdlclient``) in the same environment as `Spyder`_.
fr: De plus, nous supposons que vous avez déjà installé `Spyder`_ et que vous l'avez démarré. Si vous ne l'avez pas encore fait, veuillez vous référer à la documentation de `Spyder`_. **Notez que vous n'avez pas besoin d'installer DataLab dans le même environnement que Spyder.**: c'est tout l'intérêt de DataLab, c'est une application autonome qui peut être utilisée à partir de n'importe quel environnement. Pour ce tutoriel, vous n'avez besoin d'installer que le client DataLab Simple (`pip install cdlclient`) dans le même environnement que `Spyder`_.

source: Testing your algorithm with DataLab
fr: Tester votre algorithme avec DataLab

source: Let's assume that you have developed algorithms in the ``my_work`` module of your project. You have already prototyped them in DataLab, and you have developed them in `Spyder`_ by writing functions that take some data as input and return some processed data as output. Now, you want to test these algorithms with some data.
fr: Supposons que vous ayez développé des algorithmes dans le module ``my_work`` de votre projet. Vous les avez déjà prototypés dans DataLab, et vous les avez développés dans `Spyder`_ en écrivant des fonctions qui prennent des données en entrée et renvoient des données traitées en sortie. Maintenant, vous voulez tester ces algorithmes avec des données.

source: To test these algorithms, you have written two functions in the ``my_work`` module:
fr: Pour tester ces algorithmes, vous avez écrit deux fonctions dans le module ``my_work`` :

source: ``test_my_1d_algorithm``: this function returns some 1D data that will allow you to validate your first algorithm which works on 1D data.
fr: ``test_my_1d_algorithm`` : cette fonction renvoie des données 1D qui vous permettront de valider votre premier algorithme qui fonctionne sur des données 1D.

source: ``test_my_2d_algorithm``: this function returns some 2D data that will allow you to validate your second algorithm which works on 2D data.
fr: ``test_my_2d_algorithm`` : cette fonction renvoie des données 2D qui vous permettront de valider votre deuxième algorithme qui fonctionne sur des données 2D.

source: You can now use DataLab to visualize the data returned by these functions directly from `Spyder`_:
fr: Vous pouvez maintenant utiliser DataLab pour visualiser les données renvoyées par ces fonctions directement depuis `Spyder`_ :

source: First, you need to start both DataLab and `Spyder`_.
fr: Tout d'abord, vous devez démarrer DataLab et `Spyder`_.

source: Remember that DataLab is a stand-alone application that can be used from any environment, so you don't need to install it in the same environment as `Spyder`_ because the connection between these two applications is done through a communication protocol.
fr: Rappelez-vous que DataLab est une application autonome qui peut être utilisée à partir de n'importe quel environnement, vous n'avez donc pas besoin de l'installer dans le même environnement que `Spyder`_ car la connexion entre ces deux applications se fait via un protocole de communication.

source: Here is how to do it:
fr: Voici comment faire :

source: If we execute the first two cells, we will see the following output in the `Spyder`_ console:
fr: Si nous exécutons les deux premières cellules, nous verrons la sortie suivante dans la console `Spyder`_ :

source: On this screenshot, we can see the result of evaluating the first two cells: the first cell connects to DataLab, and the second cell visualizes the 1D data returned by the ``test_my_1d_algorithm`` function.
fr: Sur cette capture d'écran, nous pouvons voir le résultat de l'évaluation des deux premières cellules : la première cellule se connecte à DataLab, et la deuxième cellule visualise les données 1D renvoyées par la fonction ``test_my_1d_algorithm``.

source: On this screenshot, we can see the result of evaluating the third cell: the ``test_my_2d_algorithm`` function returns a 2D array, and we can visualize it directly in DataLab.
fr: Sur cette capture d'écran, nous pouvons voir le résultat de l'évaluation de la troisième cellule : la fonction ``test_my_2d_algorithm`` renvoie un tableau 2D, et nous pouvons le visualiser directement dans DataLab.

source: Debugging your algorithm with DataLab
fr: Déboguer votre algorithme avec DataLab

source: Now that you have tested your algorithms with some data, you may want to debug them if necessary. To do so, you can combine the `Spyder`_ debugging capabilities with DataLab.
fr: Maintenant que vous avez testé vos algorithmes avec des données, vous voudrez peut-être les déboguer si nécessaire. Pour ce faire, vous pouvez combiner les capacités de débogage de `Spyder`_ avec DataLab.

source: Here is the code of the fake algorithm that we want to debug, in which we have introduced an optional ``debug_with_datalab`` parameter that - if set to ``True`` - will create a proxy object allowing to visualize the data step-by-step in DataLab:
fr: Voici le code de l'algorithme fictif que nous voulons déboguer, dans lequel nous avons introduit un paramètre optionnel ``debug_with_datalab`` qui - s'il est défini sur ``True`` - créera un objet proxy permettant de visualiser les données étape par étape dans DataLab :

source: The corresponding ``test_my_2d_algorithm`` function also has an optional ``debug_with_datalab`` parameter that is simply passed to the ``generate_2d_data`` function.
fr: La fonction ``test_my_2d_algorithm`` correspondante a également un paramètre optionnel ``debug_with_datalab`` qui est simplement passé à la fonction ``generate_2d_data``.

source: Now, we can use `Spyder`_ to debug the ``test_my_2d_algorithm`` function:
fr: Maintenant, nous pouvons utiliser `Spyder`_ pour déboguer la fonction ``test_my_2d_algorithm`` :

source: In this simple example, the algorithm is just iterating 10 times and generating a 1D array at each iteration. Each 1D array is then stacked in a 2D array that is returned by the ``generate_2d_data`` function. With the ``debug_with_datalab`` parameter set to ``True``, we can visualize each 1D array in DataLab: that way, we can check that the algorithm is working as expected.
fr: Dans cet exemple simple, l'algorithme itère simplement 10 fois et génère un tableau 1D à chaque itération. Chaque tableau 1D est ensuite empilé dans un tableau 2D qui est renvoyé par la fonction ``generate_2d_data``. Avec le paramètre ``debug_with_datalab`` défini sur ``True``, nous pouvons visualiser chaque tableau 1D dans DataLab : de cette façon, nous pouvons vérifier que l'algorithme fonctionne comme prévu.

source: On this screenshot, we can see the result of evaluating the first cell: the ``test_my_2d_algorithm`` function is called with the ``debug_with_datalab`` parameter set to ``True``: 10 1D arrays are generated and visualized in DataLab.
fr: Sur cette capture d'écran, nous pouvons voir le résultat de l'évaluation de la première cellule : la fonction ``test_my_2d_algorithm`` est appelée avec le paramètre ``debug_with_datalab`` défini sur ``True`` : 10 tableaux 1D sont générés et visualisés dans DataLab.

source: If we had executed the script using `Spyder`_ debugger and set a breakpoint in the ``generate_2d_data`` function, we would have seen the generated 1D arrays in DataLab at each iteration: since DataLab is executed in a separate process, we would have been able to manipulate the data in DataLab while the algorithm is paused in `Spyder`_.
fr: Si nous avions exécuté le script en utilisant le débogueur `Spyder`_ et défini un point d'arrêt dans la fonction ``generate_2d_data``, nous aurions vu les tableaux 1D générés dans DataLab à chaque itération : comme DataLab est exécuté dans un processus séparé, nous aurions pu manipuler les données dans DataLab pendant que l'algorithme est en pause dans `Spyder`_.
