Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: ROI extraction was not taking into account the pixel size (dx, dy) and the origin (x0, y0) of the image. This is now fixed (see [Issue #8](https://github.com/DataLab-Platform/DataLab/issues/8) - Image ROI extraction: take into account pixel size)
fr: L'extraction de la ROI ne prenait pas en compte la taille des pixels (dx, dy) et l'origine (x0, y0) de l'image. Ceci est maintenant corrigé (voir [Issue #8](https://github.com/DataLab-Platform/DataLab/issues/8) - Extraction de la ROI de l'image : prendre en compte la taille des pixels)

source: Macro-command console is now read-only:
fr: La console de macro-commande est désormais en lecture seule :

source: The macro-command panel Python console is currently not supporting standard input stream (`stdin`) and this is intended (at least for now)
fr: La console Python du panneau de macro-commande ne prend actuellement pas en charge le flux d'entrée standard (`stdin`) et c'est voulu (du moins pour l'instant)

source: Set Python console read-only to avoid confusion
fr: Définir la console Python en lecture seule pour éviter toute confusion

source: French translation is not available on Windows/Stand alone version:
fr: La traduction française n'est pas disponible sur Windows/Version autonome :

source: Locale was not properly detected on Windows for stand-alone version (frozen with `pyinstaller`) due to an issue with `locale.getlocale()` (function returning `None` instead of the expected locale on frozen applications)
fr: La locale n'était pas correctement détectée sur Windows pour la version autonome (gelée avec `pyinstaller`) en raison d'un problème avec `locale.getlocale()` (fonction renvoyant `None` au lieu de la locale attendue sur les applications gelées)

source: This is ultimately a `pyinstaller` issue, but a workaround has been implemented in `guidata` V3.2.2 (see [guidata issue #68](https://github.com/PlotPyStack/guidata/issues/68) - Windows: gettext translation is not working on frozen applications)
fr: C'est finalement un problème de `pyinstaller`, mais une solution de contournement a été implémentée dans `guidata` V3.2.2 (voir [Issue guidata #68](https://github.com/PlotPyStack/guidata/issues/68) - Windows : la traduction gettext ne fonctionne pas sur les applications gelées)

source: [Issue #2](https://github.com/DataLab-Platform/DataLab/issues/2) - French translation is not available on Windows Stand alone version
fr: [Issue #2](https://github.com/DataLab-Platform/DataLab/issues/2) - La traduction française n'est pas disponible sur la version autonome de Windows

source: Saving image to JPEG2000 fails for non integer data:
fr: L'enregistrement d'une image au format JPEG2000 échoue pour les données non entières :

source: JPEG2000 encoder does not support non integer data or signed integer data
fr: L'encodeur JPEG2000 ne prend pas en charge les données non entières ou les données entières signées

source: Before, DataLab was showing an error message when trying to save incompatible data to JPEG2000: this was not a consistent behavior with other standard image formats (e.g. PNG, JPG, etc.) for which DataLab was automatically converting data to the appropriate format (8-bit unsigned integer)
fr: Avant, DataLab affichait un message d'erreur lors de la tentative de sauvegarde de données incompatibles au format JPEG2000 : cela n'était pas cohérent avec le comportement des autres formats d'image standard (par exemple PNG, JPG, etc.) pour lesquels DataLab convertissait automatiquement les données au format approprié (entier non signé sur 8 bits)

source: Current behavior is now consistent with other standard image formats: when saving to JPEG2000, DataLab automatically converts data to 8-bit unsigned integer or 16-bit unsigned integer (depending on the original data type)
fr: Le comportement actuel est maintenant cohérent avec les autres formats d'image standard : lors de la sauvegarde au format JPEG2000, DataLab convertit automatiquement les données en entier non signé sur 8 bits ou en entier non signé sur 16 bits (en fonction du type de données original)

source: [Issue #3](https://github.com/DataLab-Platform/DataLab/issues/3) - Save image to JPEG2000: 'OSError: encoder error -2 when writing image file'
fr: [Issue #3](https://github.com/DataLab-Platform/DataLab/issues/3) - Sauvegarde d'image au format JPEG2000 : 'OSError: erreur d'encodeur -2 lors de l'écriture du fichier image'

source: Windows stand-alone version shortcuts not showing in current user start menu:
fr: Les raccourcis de la version autonome de Windows ne s'affichent pas dans le menu de démarrage de l'utilisateur actuel :

source: When installing DataLab on Windows from a non-administrator account, the shortcuts were not showing in the current user start menu but in the administrator start menu instead (due to the elevated privileges of the installer and the fact that the installer does not support installing shortcuts for all users)
fr: Lors de l'installation de DataLab sur Windows à partir d'un compte non administrateur, les raccourcis ne s'affichaient pas dans le menu de démarrage de l'utilisateur actuel, mais dans le menu de démarrage de l'administrateur (en raison des privilèges élevés de l'installeur et du fait que l'installeur ne prend pas en charge l'installation de raccourcis pour tous les utilisateurs)

source: Now, the installer *does not* ask for elevated privileges anymore, and shortcuts are installed in the current user start menu (this also means that the current user must have write access to the installation directory)
fr: Désormais, l'installeur ne demande plus de privilèges élevés, et les raccourcis sont installés dans le menu de démarrage de l'utilisateur actuel (cela signifie également que l'utilisateur actuel doit disposer d'un accès en écriture au répertoire d'installation)

source: In future releases, the installer will support installing shortcuts for all users if there is a demand for it (see [Issue #5](https://github.com/DataLab-Platform/DataLab/issues/5))
fr: Dans les futures versions, l'installeur prendra en charge l'installation de raccourcis pour tous les utilisateurs s'il y a une demande à cet effet (voir [Issue #5](https://github.com/DataLab-Platform/DataLab/issues/5))

source: [Issue #4](https://github.com/DataLab-Platform/DataLab/issues/4) - Windows: stand-alone version shortcuts not showing in current user start menu
fr: [Issue #4](https://github.com/DataLab-Platform/DataLab/issues/4) - Windows : les raccourcis de la version autonome ne s'affichent pas dans le menu de démarrage de l'utilisateur actuel

source: Installation and configuration window for stand-alone version:
fr: Fenêtre d'installation et de configuration pour la version autonome :

source: Do not show ambiguous error message 'Invalid dependencies' anymore
fr: Ne plus afficher le message d'erreur ambigu 'Dépendances invalides'

source: Dependencies are supposed to be checked when building the stand-alone version
fr: Les dépendances sont censées être vérifiées lors de la construction de la version autonome

source: Added PDF documentation to stand-alone version:
fr: Ajout de la documentation PDF à la version autonome :

source: The PDF documentation was missing in previous release
fr: La documentation PDF était manquante dans la version précédente

source: Now, the PDF documentation (in English and French) is included in the stand-alone version
fr: Désormais, la documentation PDF (en anglais et en français) est incluse dans la version autonome

source: New dependencies:
fr: Nouvelles dépendances :

source: DataLab is now powered by [PlotPyStack](https://github.com/PlotPyStack):
fr: DataLab est désormais alimenté par [PlotPyStack](https://github.com/PlotPyStack) :

source: [opencv-python](https://pypi.org/project/opencv-python/) (algorithms for image processing)
fr: [opencv-python](https://pypi.org/project/opencv-python/) (algorithmes de traitement d'image)

source: New reference platform:
fr: Nouvelle plateforme de référence :

source: DataLab is validated on Windows 11 with Python 3.11 and PyQt 5.15
fr: DataLab est validé sur Windows 11 avec Python 3.11 et PyQt 5.15

source: DataLab is also compatible with other OS (Linux, MacOS) and other Python-Qt bindings and versions (Python 3.8-3.12, PyQt6, PySide6)
fr: DataLab est également compatible avec d'autres systèmes d'exploitation (Linux, MacOS) et d'autres liaisons Python-Qt et versions (Python 3.8-3.12, PyQt6, PySide6)

source: New features:
fr: Nouvelles fonctionnalités :

source: DataLab is a platform:
fr: DataLab est une plateforme :

source: Added support for plugins
fr: Ajout de la prise en charge des plugins

source: Custom processing features available in the "Plugins" menu
fr: Fonctionnalités de traitement personnalisées disponibles dans le menu "Plugins"

source: Custom I/O features: new file formats can be added to the standard I/O features for signals and images
fr: Fonctionnalités d'E/S personnalisées : de nouveaux formats de fichier peuvent être ajoutés aux fonctionnalités d'E/S standard pour les signaux et les images

source: Custom HDF5 features: new HDF5 file formats can be added to the standard HDF5 import feature
fr: Fonctionnalités HDF5 personnalisées : de nouveaux formats de fichier HDF5 peuvent être ajoutés à la fonctionnalité d'importation HDF5 standard

source: More features to come...
fr: D'autres fonctionnalités à venir...

source: Added remote control feature: DataLab can be controlled remotely via a TCP/IP connection (see [Remote control](https://datalab-platform.com/en/remote_control.html))
fr: Ajout de la fonctionnalité de contrôle à distance : DataLab peut être contrôlé à distance via une connexion TCP/IP (voir [Contrôle à distance](https://datalab-platform.com/fr/remote_control.html))

source: Added macro commands: DataLab can be controlled via a macro file (see [Macro commands](https://datalab-platform.com/en/macro_commands.html))
fr: Ajout de commandes de macro : DataLab peut être contrôlé via un fichier macro (voir [Commandes de macro](https://datalab-platform.com/fr/macro_commands.html))

source: General features:
fr: Fonctionnalités générales :

source: Added settings dialog box (see "Settings" entry in "File" menu):
fr: Ajout de la boîte de dialogue des paramètres (voir l'entrée "Paramètres" dans le menu "Fichier") :

source: General settings
fr: Paramètres généraux

source: Visualization settings
fr: Paramètres de visualisation

source: Processing settings
fr: Paramètres de traitement

source: New default layout: signal/image panels are on the right side of the main window, visualization panels are on the left side with a vertical toolbar
fr: Nouvelle disposition par défaut : les panneaux de signaux/images sont sur le côté droit de la fenêtre principale, les panneaux de visualisation sont sur le côté gauche avec une barre d'outils verticale

source: Signal/Image features:
fr: Fonctionnalités de signal/image :

source: Added process isolation: each signal/image is processed in a separate process, so that DataLab does not freeze anymore when processing large signals/images
fr: Ajout de l'isolation des processus : chaque signal/image est traité dans un processus séparé, de sorte que DataLab ne se fige plus lors du traitement de signaux/images volumineux

source: Added support for groups: signals and images can be grouped together, and operations can be applied to all objects in a group, or between groups
fr: Ajout de la prise en charge des groupes : les signaux et les images peuvent être regroupés, et des opérations peuvent être appliquées à tous les objets d'un groupe ou entre les groupes

source: Added warning and error dialogs with detailed traceback links to the source code (warnings may be optionally ignored)
fr: Ajout de boîtes de dialogue d'avertissement et d'erreur avec des liens de poursuite détaillés vers le code source (les avertissements peuvent être ignorés en option)

source: Drastically improved performance when selecting objects
fr: Amélioration significative des performances lors de la sélection d'objets

source: Optimized performance when showing large images
fr: Optimisation des performances lors de l'affichage d'images volumineuses

source: Added support for dropping files on signal/image panel
fr: Ajout de la prise en charge du dépôt de fichiers sur le panneau de signal/image

source: Added "Analysis parameters" group box to show last result input parameters
fr: Ajout de la boîte de groupe "Paramètres de calcul" pour afficher les paramètres d'entrée du dernier résultat

source: Added "Copy titles to clipboard" feature in "Edit" menu
fr: Ajout de la fonctionnalité "Copier les titres dans le presse-papiers" dans le menu "Édition"

source: For every single processing feature (operation, processing and analysis menus), the entered parameters (dialog boxes) are stored in cache to be used as defaults the next time the feature is used
fr: Pour chaque fonctionnalité de traitement individuelle (menus opération, traitement et analyse), les paramètres saisis (boîtes de dialogue) sont stockés en cache pour être utilisés par défaut la prochaine fois que la fonctionnalité est utilisée

source: Signal processing:
fr: Traitement de signal :

source: Added support for optional FFT shift (see Settings dialog box)
fr: Ajout de la prise en charge du décalage FFT facultatif (voir la boîte de dialogue des paramètres)

source: Image processing:
fr: Traitement d'image :

source: Added pixel binning operation (X/Y binning factors, operation: sum, mean...)
fr: Ajout de l'opération de binning de pixels (facteurs de binning X/Y, opération : somme, moyenne...)

source: Added "Distribute on a grid" and "Reset image positions" in operation menu
fr: Ajout des options "Distribuer sur une grille" et "Réinitialiser les positions des images" dans le menu des opérations

source: Added Butterworth filter
fr: Ajout du filtre de Butterworth

source: Added exposure processing features:
fr: Ajout des fonctionnalités de traitement de l'exposition :

source: Gamma correction
fr: Correction gamma

source: Logarithmic correction
fr: Correction logarithmique

source: Sigmoïd correction
fr: Correction sigmoïde

source: Added restoration processing features:
fr: Ajout des fonctionnalités de traitement de la restauration :

source: Total variation denoising filter (TV Chambolle)
fr: Filtre de débruitage par variation totale (TV Chambolle)

source: Bilateral filter (denoising)
fr: Filtre bilatéral (débruitage)

source: Wavelet denoising filter
fr: Filtre de débruitage par ondelettes

source: White Top-Hat denoising filter
fr: Filtre de débruitage White Top-Hat

source: Added morphological transforms (disk footprint):
fr: Ajout des transformations morphologiques (empreinte de disque) :

source: Erosion
fr: Érosion

source: Dilation
fr: Dilatation

source: Opening
fr: Ouverture

source: Closing
fr: Fermeture

source: Added edge detection features:
fr: Ajout des fonctionnalités de détection des contours :

source: Roberts filter
fr: Filtre de Roberts

source: Prewitt filter (vertical, horizontal, both)
fr: Filtre de Prewitt (vertical, horizontal, les deux)

source: Sobel filter (vertical, horizontal, both)
fr: Filtre de Sobel (vertical, horizontal, les deux)

source: Scharr filter (vertical, horizontal, both)
fr: Filtre de Scharr (vertical, horizontal, les deux)

source: Farid filter (vertical, horizontal, both)
fr: Filtre de Farid (vertical, horizontal, les deux)

source: Laplace filter
fr: Filtre de Laplace

source: Canny filter
fr: Filtre de Canny

source: Contour detection: added support for polygonal contours (in addition to circle and ellipse contours)
fr: Détection des contours : ajout de la prise en charge des contours polygonaux (en plus des contours de cercle et d'ellipse)

source: Added circle Hough transform (circle detection)
fr: Ajout de la transformation de Hough pour les cercles (détection de cercles)

source: Added image intensity levels rescaling
fr: Ajout du rééchelonnement des niveaux d'intensité de l'image

source: Added histogram equalization
fr: Ajout de l'égalisation d'histogramme

source: Added adaptative histogram equalization
fr: Ajout de l'égalisation d'histogramme adaptative

source: Added blob detection methods:
fr: Ajout des méthodes de détection de blobs :

source: Difference of Gaussian
fr: Différence de Gaussienne

source: Determinant of Hessian method
fr: Méthode du déterminant de Hessian

source: Laplacian of Gaussian
fr: Laplacien de Gaussienne

source: Blob detection using OpenCV
fr: Détection de blobs à l'aide d'OpenCV

source: Result shapes and annotations are now transformed (instead of removed) when executing one of the following operations:
fr: Les formes et les annotations des résultats sont maintenant transformées (au lieu d'être supprimées) lors de l'exécution de l'une des opérations suivantes :

source: Rotation (arbitrary angle, +90°, -90°)
fr: Rotation (angle arbitraire, +90°, -90°)

source: Symetry (vertical/horizontal)
fr: Symétrie (verticale/horizontale)

source: Console: added configurable external editor (default: VSCode) to follow the traceback links to the source code
fr: Console : ajout d'un éditeur externe configurable (par défaut : VSCode) pour suivre les liens de poursuite vers le code source
