Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: **Consistent behavior** for all X-array incompatibilities:
fr: **Comportement cohérent** pour toutes les incompatibilités de tableaux X :

source: **Seamless processing**: When signals have identical X arrays, operations proceed normally without interruption.
fr: **Traitement transparent** : Lorsque les signaux ont des tableaux X identiques, les opérations se déroulent normalement sans interruption.

source: **User choice with interpolation**: When signals have any X-array differences (different sizes or ranges), user is presented with a dialog to either cancel or interpolate signals to match.
fr: **Choix de l'utilisateur avec interpolation** : Lorsque les signaux présentent des différences de tableau X (tailles ou plages différentes), une boîte de dialogue est présentée à l'utilisateur pour annuler ou interpoler les signaux afin de les faire correspondre.

source: **No blocking errors**: Operations are never blocked when interpolation can provide a technical solution.
fr: **Pas d'erreurs bloquantes** : Les opérations ne sont jamais bloquées lorsque l'interpolation peut fournir une solution technique.

source: **New configuration setting**: Added `xarray_compat_behavior` setting in Processing preferences with options:
fr: **Nouvelle option de configuration** : Ajout de l'option `xarray_compat_behavior` dans les préférences de traitement avec les options :

source: "Ask user" (default): Shows dialog for user decision when X arrays differ
fr: "Demander à l'utilisateur" (par défaut) : Affiche une boîte de dialogue pour la décision de l'utilisateur lorsque les tableaux X diffèrent

source: "Interpolate automatically": Automatically interpolates signals when X arrays differ
fr: "Interpolation automatique" : Interpole automatiquement les signaux lorsque les tableaux X diffèrent

source: **Enhanced user experience**: Clear dialogs explain compatibility options and always offer interpolation as a solution.
fr: **Expérience utilisateur améliorée** : Des boîtes de dialogue claires expliquent les options de compatibilité et offrent toujours l'interpolation comme solution.

source: **Comprehensive coverage**: Affects all multi-signal operations including:
fr: **Couverture complète** : Affecte toutes les opérations multi-signaux, y compris :

source: N-to-1 computations (e.g., average of multiple signals, arithmetic operations)
fr: Calculs N-à-1 (par exemple, moyenne de plusieurs signaux, opérations arithmétiques)

source: 2-to-1 computations in both pairwise and single operand modes (e.g., addition, subtraction, convolution)
fr: Calculs 2-à-1 en modes par paires et à un seul opérande (par exemple, addition, soustraction, convolution)

source: **Intelligent interpolation**: Automatically interpolates signals to match when needed, ensuring accurate results
fr: **Interpolation intelligente** : Interpole automatiquement les signaux pour qu'ils soient compatibles lorsque cela est nécessaire, garantissant des résultats précis

source: This enhancement prevents unexpected results from operations on incompatible signal arrays while providing a consistent and user-friendly approach to handling X-array differences.
fr: Cette amélioration empêche les résultats inattendus des opérations sur des tableaux de signaux incompatibles tout en offrant une approche cohérente et conviviale pour gérer les différences de tableaux X.

source: **Enhanced curve fitting functions**: Significantly improved curve fitting capabilities:
fr: **Fonctions de fitting de courbes améliorées** : Capacités de fitting de courbes considérablement améliorées :

source: **Smarter initial parameter estimation**: Curve fitting now automatically provides better starting values for parameters, resulting in:
fr: **Estimation initiale des paramètres plus intelligente** : Le fitting de courbes fournit désormais automatiquement de meilleures valeurs de départ pour les paramètres, ce qui entraîne :

source: More robust convergence to optimal solutions
fr: Une convergence plus robuste vers des solutions optimales

source: Reduced fitting failures and improved success rates
fr: Réduction des échecs de fitting et amélioration des taux de réussite

source: Better handling of noisy or challenging experimental data
fr: Meilleure gestion des données expérimentales bruitées ou difficiles

source: Faster convergence with fewer iterations required
fr: Convergence plus rapide avec moins d'itérations requises

source: **Improved fitting for all curve types**:
fr: **Ajustement amélioré pour tous les types de courbes** :

source: Gaussian, Lorentzian, and Voigt profile fitting with better peak detection
fr: Ajustement de profils gaussiens, lorentziens et Voigt avec une meilleure détection des pics

source: Exponential and double exponential fitting with enhanced decay/growth parameter estimation
fr: Ajustement exponentiel et double exponentiel avec une estimation améliorée des paramètres de décroissance/croissance

source: Sinusoidal fitting with frequency estimation for improved accuracy
fr: Ajustement sinusoïdal avec estimation de la fréquence pour une meilleure précision

source: Planckian (blackbody) fitting with physics-correct parameter bounds
fr: Ajustement planckien (corps noir) avec des limites de paramètres correctes sur le plan physique

source: Asymmetric peak fitting (two-half Gaussian) with independent left/right parameters
fr: Ajustement de pics asymétriques (deux moitiés gaussiennes) avec des paramètres gauche/droite indépendants

source: CDF (Cumulative Distribution Function) fitting for statistical analysis
fr: Ajustement de la fonction de distribution cumulative (CDF) pour l'analyse statistique

source: **Locked parameter support** (requires PlotPy v2.8.0):
fr: **Prise en charge des paramètres verrouillés** (nécessite PlotPy v2.8.0) :

source: You can now lock individual fit parameters during automatic optimization
fr: Vous pouvez désormais verrouiller des paramètres d'ajustement individuels pendant l'optimisation automatique

source: Manually adjust certain parameters and lock them to prevent changes during auto-fit
fr: Ajustez manuellement certains paramètres et verrouillez-les pour empêcher les modifications lors de l'ajustement automatique

source: Visual indicators: locked parameters show 🔒 emoji and are grayed out
fr: Indicateurs visuels : les paramètres verrouillés affichent l'emoji 🔒 et sont grisés

source: Enables partial optimization: fix well-determined parameters, optimize uncertain ones
fr: Permet une optimisation partielle : fixer les paramètres bien déterminés, optimiser ceux incertains

source: Improves fit convergence by focusing on parameters that need adjustment
fr: Améliore la convergence de l'ajustement en se concentrant sur les paramètres qui nécessitent un ajustement

source: Lock/unlock parameters via the parameter settings dialog (gear icon)
fr: Verrouiller/déverrouiller les paramètres via la boîte de dialogue des paramètres (icône d'engrenage)

source: **Improved user experience**: The curve fitting dialogs now provide:
fr: **Amélioration de l'expérience utilisateur** : Les boîtes de dialogue de fitting de courbes offrent désormais :

source: More reliable initial parameter guesses reducing manual adjustment needs
fr: Des estimations de paramètres initiaux plus fiables réduisant les besoins d'ajustement manuel

source: Better parameter bounds preventing optimization failures
fr: Meilleures limites de paramètres empêchant les échecs d'optimisation

source: Enhanced stability for difficult-to-fit datasets
fr: Stabilité améliorée pour les ensembles de données difficiles à ajuster

source: Zero padding:
fr: Complément de zéros :

source: Enhanced feature to support both prepending and appending zeros.
fr: Amélioration de la fonctionnalité pour prendre en charge l'ajout de zéros au début et à la fin.

source: Partial implementation of [Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216).
fr: Implémentation partielle de l'[Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216).

source: Default strategy is now "Next power of 2".
fr: La stratégie par défaut est maintenant "Prochain puissance de 2".

source: Ideal frequency domain filter ("Brick wall filter"):
fr: Filtre idéal dans le domaine fréquentiel ("Filtre coupe-bande") :

source: This closes [Issue #215](https://github.com/DataLab-Platform/DataLab/issues/215) - Filters / Brickwall filter (Signal).
fr: Ceci clôture [Issue #215](https://github.com/DataLab-Platform/DataLab/issues/215) - Filtres / Filtre coupe-bande (Signal).

source: Bandwidth at -3dB:
fr: Bande passante à -3dB :

source: Enhanced to support passband bandwidth in addition to baseband bandwidth.
fr: Amélioration de la prise en charge de la bande passante en plus de la bande de base.

source: **Pulse features extraction**: New comprehensive pulse analysis feature for step and square signals:
fr: **Extraction des caractéristiques des impulsions** : Nouvelle fonctionnalité complète d'analyse des impulsions pour les signaux en escalier et carrés :

source: **Automated pulse shape recognition**: Automatically identifies signal type (step, square, or other) for optimal analysis
fr: **Reconnaissance automatisée de la forme d'impulsion** : Identifie automatiquement le type de signal (escalier, carré ou autre) pour une analyse optimale.

source: **Signal polarity detection**: Automatically determines positive/negative pulse polarity
fr: **Détection de la polarité du signal** : Détermine automatiquement la polarité positive/négative de l'impulsion.

source: **Comprehensive parameter extraction**: Measures amplitude, rise time, fall time, full width at half maximum (FWHM), timing parameters (x10, x50, x90, x100), and foot duration
fr: **Extraction complète des paramètres** : Mesure l'amplitude, le temps de montée, le temps de descente, la largeur à mi-hauteur (FWHM), les paramètres temporels (x10, x50, x90, x100) et la durée du pied.

source: **Baseline characterization**: Extracts start and end baseline ranges for accurate feature computation
fr: **Caractérisation de la ligne de base** : Extrait les plages de ligne de base de début et de fin pour un calcul précis des caractéristiques.

source: **Intelligent baseline estimation**: Determines baseline levels from user-defined ranges
fr: **Estimation intelligente de la ligne de base** : Détermine les niveaux de ligne de base à partir de plages définies par l'utilisateur.

source: **Visual feedback**: Results displayed in tabular format with pulse feature visualization on the signal plot
fr: **Retour visuel** : Résultats affichés au format tabulaire avec visualisation des caractéristiques des impulsions sur le tracé du signal.

source: Supports both step and square pulse analysis
fr: Prend en charge l'analyse des impulsions en escalier et carrées

source: New "Extent" group box in image properties:
fr: Nouvelle boîte de groupe "Bornes" dans les propriétés de l'image :

source: Added computed parameters for image extent: `Xmin`, `Xmax`, `Ymin`, and `Ymax`.
fr: Ajout des paramètres calculés pour l'étendue de l'image : `Xmin`, `Xmax`, `Ymin` et `Ymax`.

source: These parameters are automatically calculated based on the image origin, pixel spacing, and dimensions.
fr: Ces paramètres sont automatiquement calculés en fonction de l'origine de l'image, de l'espacement des pixels et des dimensions.

source: They provide the physical coordinate boundaries of the image for enhanced spatial analysis.
fr: Ils fournissent les limites de coordonnées physiques de l'image pour une analyse spatiale améliorée.

source: The parameters are displayed in a dedicated "Extent" group in the image properties panel.
fr: Les paramètres sont affichés dans un groupe dédié "Bornes" dans le panneau des propriétés de l'image.

source: New I/O features:
fr: Nouvelles fonctionnalités d'E/S :

source: Improved delimiter handling in CSV reading (signals) to better support files with various whitespace separators
fr: Amélioration de la gestion des délimiteurs dans la lecture CSV (signaux) pour mieux prendre en charge les fichiers avec divers séparateurs d'espaces.

source: FT-Lab signals and images:
fr: Signaux et images FT-Lab :

source: Added support for CEA's FT-Lab signal and image binary formats.
fr: Ajout de la prise en charge des formats binaires de signaux et d'images FT-Lab du CEA.

source: This closes [Issue #211](https://github.com/DataLab-Platform/DataLab/issues/211) - Add support for .sig and .ima file types
fr: Ceci clôture le ticket [Issue #211](https://github.com/DataLab-Platform/DataLab/issues/211) - Ajout de la prise en charge des types de fichiers .sig et .ima

source: Coordinated text image files (similar to the Matris image format):
fr: Fichiers image texte avec coordonnées (similaires au format d'image Matris) :

source: Supports both real and complex-valued image data with optional error images.
fr: Prend en charge à la fois les données d'image réelles et à valeurs complexes avec des images d'erreur facultatives.

source: Automatically handles NaN values in the data.
fr: Gère automatiquement les valeurs NaN dans les données.

source: Reads metadata including units (X, Y, Z) and labels from file headers.
fr: Lit les métadonnées, y compris les unités (X, Y, Z) et les étiquettes, à partir des en-têtes de fichiers.

source: This feature is provided by the underlying Sigima library.
fr: Cette fonctionnalité est fournie par la bibliothèque Sigima sous-jacente.

source: Application settings:
fr: Paramètres de l'application :

source: Added new "Lock image aspect ratio to 1:1" option in the "Image" section of the "Settings" dialog box:
fr: Ajout d'une nouvelle option "Verrouiller le ratio d'aspect à 1:1" dans la section "Image" de la boîte de dialogue "Paramètres" :

source: If enabled, the aspect ratio of images is locked to 1:1 (square pixels) when resizing images
fr: Si activé, le ratio d'aspect des images est verrouillé à 1:1 (pixels carrés) lors du redimensionnement des images

source: The default and recommended setting is to disable this option, so that the aspect ratio of images is locked to a value corresponding to the physical pixel size of the image
fr: Le paramètre par défaut et recommandé est de désactiver cette option, afin que le ratio d'aspect des images soit verrouillé à une valeur correspondant à la taille physique des pixels de l'image

source: This closes [Issue #244](https://github.com/DataLab-Platform/DataLab/issues/244) - Add option to lock image aspect ratio to 1:1 (disabled by default, so that physical pixel size is used)
fr: Ceci clôture le ticket [Issue #244](https://github.com/DataLab-Platform/DataLab/issues/244) - Ajout de l'option de verrouillage du ratio d'aspect de l'image à 1:1 (désactivé par défaut, afin que la taille des pixels physiques soit utilisée)

source: Added new "Show console on error" option in the "Console" section of the "Settings" dialog box:
fr: Ajout d'une nouvelle option "Afficher la console en cas d'erreur" dans la section "Console" de la boîte de dialogue "Paramètres" :

source: If enabled, the console will be shown when an error occurs in the application, allowing to see the error traceback (this was previously the default behavior)
fr: Si activé, la console sera affichée lorsqu'une erreur se produit dans l'application, permettant de voir la trace de l'erreur (c'était auparavant le comportement par défaut)

source: Now, the console is not shown by default on error, but it does not prevent the console from containing the error traceback as it works in the background.
fr: Maintenant, la console n'est pas affichée par défaut en cas d'erreur, mais cela n'empêche pas la console de contenir la trace de l'erreur car elle fonctionne en arrière-plan.

source: Added configurable autoscale margins for signal and image plots in the "Visualization" section of the "Settings" dialog box:
fr: Ajout de marges d'autoscale configurables pour les tracés de signaux et d'images dans la section "Visualisation" de la boîte de dialogue "Paramètres" :

source: New "Autoscale margin" setting allows customizing the autoscale margin percentage
fr: Nouveau paramètre "Marge de zoom automatique" permet de personnaliser le pourcentage de marge de zoom automatique

source: Signal and image plots have separate margin settings for fine-tuned control
fr: Les graphiques de signaux et d'images ont des paramètres de marge séparés pour un contrôle précis

source: Margins can be set between 0% and 50% to control the amount of whitespace around data when autoscaling plots
fr: Les marges peuvent être définies entre 0 % et 50 % pour contrôler la quantité d'espace blanc autour des données lors de l'autoscaling des graphiques

source: Changes are applied immediately to all existing plot widgets without requiring application restart
fr: Les modifications sont appliquées immédiatement à tous les widgets de tracé existants sans nécessiter de redémarrage de l'application

source: Dialog sizing improvements:
fr: Améliorations de la taille des boîtes de dialogue :

source: Processing dialogs (profile extraction, offset subtraction, etc.) now intelligently resize based on the main window size
fr: Les boîtes de dialogue de traitement (extraction de profil, soustraction de décalage, etc.) redimensionnent désormais intelligemment en fonction de la taille de la fenêtre principale

source: Dialogs are automatically sized appropriately for your screen resolution while never exceeding the main window size
fr: Les boîtes de dialogue sont automatiquement redimensionnées de manière appropriée en fonction de votre résolution d'écran tout en ne dépassant jamais la taille de la fenêtre principale

source: Improved user experience with consistently appropriately-sized dialogs across different screen resolutions and window sizes
fr: Amélioration de l'expérience utilisateur avec des boîtes de dialogue de taille appropriée de manière cohérente sur différentes résolutions d'écran et tailles de fenêtre

source: Signal cursors:
fr: Curseurs de signal :

source: Fixed [Issue #231](https://github.com/DataLab-Platform/DataLab/issues/231) - Add horizontal cursors to the Signal View (requires PlotPy v2.8)
fr: Correction de l'[Issue #231](https://github.com/DataLab-Platform/DataLab/issues/231) - Ajout de curseurs horizontaux à la Vue Signal (nécessite PlotPy v2.8)

source: Fixed [Issue #232](https://github.com/DataLab-Platform/DataLab/issues/232) - Add Δx measurement on curve stats tool (vertical cursors)
fr: Correction de l'[Issue #232](https://github.com/DataLab-Platform/DataLab/issues/232) - Ajout de la mesure Δx sur l'outil de statistiques de courbe (curseurs verticaux)

source: Computation functions refactoring:
fr: Refactorisation des fonctions de calcul :

source: Added new `@computation_function` decorator to mark and register computation functions
fr: Ajout d'un nouveau décorateur `@computation_function` pour marquer et enregistrer les fonctions de calcul

source: Renamed computation functions to remove redundant "compute_" prefix (e.g., `compute_fft` ➝ `fft`)
fr: Renommé les fonctions de calcul pour supprimer le préfixe redondant "compute_" (par exemple, `compute_fft` ➝ `fft`)

source: Added infrastructure for discovering computation functions via introspection
fr: Ajout d'une infrastructure pour découvrir les fonctions de calcul via l'introspection

source: Improved function naming in coordinate transformations (e.g., `to_polar` ➝ `to_polar`)
fr: Amélioration de la nomination des fonctions dans les transformations de coordonnées (par exemple, `to_polar` ➝ `to_polar`)

source: Added type hints and improved documentation across computation modules
fr: Ajout de types d'indices et amélioration de la documentation dans les modules de calcul

source: These changes improve code organization and maintainability while making the API more intuitive
fr: Ces changements améliorent l'organisation et la maintenabilité du code tout en rendant l'API plus intuitive

source: Internal changes only - **no backward compatibility is maintained** for plugin developers
fr: Changements internes uniquement - **aucune compatibilité ascendante n'est maintenue** pour les développeurs de plugins

source: Generic processing types refactoring:
fr: Refactorisation des types de traitement génériques :

source: Refactored the naming convention of core `BaseProcessor` methods implementing generic data processing patterns (e.g. one input ➝ one output, n inputs ➝ one output, etc.)
fr: Refactorisation de la convention de nommage des méthodes `BaseProcessor` de base implémentant des modèles de traitement de données génériques (par exemple, une entrée ➝ une sortie, n entrées ➝ une sortie, etc.)

source: New method names are now based on their input/output signature for better clarity and extensibility:
fr: Les nouveaux noms de méthodes sont désormais basés sur leur signature d'entrée/sortie pour une meilleure clarté et extensibilité :

source: `compute_1_to_1`: transforms each selected object independently
fr: ``compute_1_to_1`` : transforme chaque objet sélectionné indépendamment

source: `compute_1_to_0`: performs a measurement or analysis without generating a new object
fr: ``compute_1_to_0`` : effectue une mesure ou une analyse sans générer un nouvel objet

source: `compute_1_to_n`: generates multiple outputs from a single input (e.g. ROI extraction)
fr: ``compute_1_to_n`` : génère plusieurs sorties à partir d'une seule entrée (par exemple, extraction de ROI)

source: `compute_n_to_1`: combines multiple inputs into a single output (e.g. sum, mean); supports pairwise mode
fr: ``compute_n_to_1`` : combine plusieurs entrées en une seule sortie (par exemple, somme, moyenne) ; prend en charge le mode pairwise

source: `compute_2_to_1`: applies a binary operation between an object and a second operand (object or constant); supports pairwise mode
fr: ``compute_2_to_1`` : applique une opération binaire entre un objet et un second opérande (objet ou constante) ; prend en charge le mode pairwise

source: These methods are internal and used by advanced developers (e.g. plugin authors); hence, **no backward compatibility is maintained**
fr: Ces méthodes sont internes et utilisées par des développeurs avancés (par exemple, auteurs de plugins) ; par conséquent, **aucune compatibilité ascendante n'est maintenue**

source: This closes [Issue #180](https://github.com/DataLab-Platform/DataLab/issues/180) - Rationalize `BaseProcessor` method names for core processing types
fr: Ceci corrige l'[Issue #180](https://github.com/DataLab-Platform/DataLab/issues/180) - Rationaliser les noms de méthodes `BaseProcessor` pour les types de traitement de base

source: **Enhanced HDF5 file support**: Improved support for HDF5 files with custom file extensions
fr: **Prise en charge améliorée des fichiers HDF5** : Prise en charge améliorée des fichiers HDF5 avec des extensions de fichier personnalisées

source: Expanded file dialog filters: File dialogs now include "All files (*)" option alongside standard HDF5 extensions (`.h5`, `.hdf5`, `.hdf`, `.he5`), allowing users to select HDF5 files regardless of their extension
fr: Filtres de boîte de dialogue de fichiers étendus : Les boîtes de dialogue de fichiers incluent désormais l'option "Tous les fichiers (*)" aux côtés des extensions HDF5 standard (`.h5`, `.hdf5`, `.hdf`, `.he5`), permettant aux utilisateurs de sélectionner des fichiers HDF5 quelle que soit leur extension

source: Intelligent HDF5 file detection: Added smart file detection that can identify HDF5 files by content, not just extension
fr: Détection intelligente des fichiers HDF5 : Ajout d'une détection de fichiers intelligente qui peut identifier les fichiers HDF5 par leur contenu, et pas seulement par leur extension
