Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Now, to improve performance, if multiple images are selected, only the last image of the selection is displayed in the image view if this last image has no transparency and if the other images are completely covered by this last image
fr: Maintenant, pour améliorer les performances, si plusieurs images sont sélectionnées, seule la dernière image de la sélection est affichée dans la vue image si cette dernière image n'a pas de transparence et si les autres images sont complètement recouvertes par cette dernière image

source: Clarification: action "Show first only" was renamed to "Show first object only", and a new icon was added to the action
fr: Clarification : l'action "Afficher uniquement le premier" a été renommée en "Afficher uniquement le premier objet", et une nouvelle icône a été ajoutée à l'action

source: API: added `width` and `height` properties to `ImageObj` class (returns the width and height of the image in physical units)
fr: API : ajout des propriétés `width` et `height` à la classe `ImageObj` (retourne la largeur et la hauteur de l'image en unités physiques)

source: Windows launcher "start.pyw": writing a log file "datalab_error.log" when an exception occurs at startup
fr: Lanceur Windows "start.pyw" : écriture d'un fichier journal "datalab_error.log" lorsqu'une exception se produit au démarrage

source: Changing the color theme now correctly updates all DataLab's user interface components without the need to restart the application
fr: Changer le thème de couleur met maintenant à jour correctement tous les composants de l'interface utilisateur de DataLab sans avoir besoin de redémarrer l'application

source: OpenCV is now an optional dependency:
fr: OpenCV est désormais une dépendance facultative :

source: This change is motivated by the fact that the OpenCV conda package is not maintained on Windows (at least), which leads to an error when installing DataLab with conda
fr: Ce changement est motivé par le fait que le paquet conda OpenCV n'est pas maintenu sur Windows (au moins), ce qui entraîne une erreur lors de l'installation de DataLab avec conda

source: When OpenCV is not installed, only the "OpenCV blob detection" feature won't work, and a warning message will be displayed when trying to use this feature
fr: Lorsque OpenCV n'est pas installé, seule la fonctionnalité "Détection de blob OpenCV" ne fonctionnera pas, et un message d'avertissement sera affiché lors de la tentative d'utilisation de cette fonctionnalité

source: ℹ️ PlotPy v2.6 is required for this release.
fr: ℹ️ PlotPy v2.6 est requis pour cette version.

source: Menu "Computing" was renamed to "Analysis" for both Signal and Image panels, to better reflect the nature of the features in this menu
fr: Le menu "Calcul" a été renommé en "Analyse" pour les panneaux Signal et Image, pour mieux refléter la nature des fonctionnalités de ce menu

source: Regions Of Interest (ROIs) are now taken into account everywhere in the application where it makes sense, and not only for the old "Computing" menu (now "Analysis") features. This closes [Issue #93](https://github.com/DataLab-Platform/DataLab/issues/93). If a signal or an image has an ROI defined:
fr: Les régions d'intérêt (ROIs) sont désormais prises en compte partout dans l'application là où cela a du sens, et pas seulement pour les anciennes fonctionnalités du menu "Calcul" (maintenant "Analyse"). Cela clôture l'[Issue #93](https://github.com/DataLab-Platform/DataLab/issues/93). Si un signal ou une image a une ROI définie :

source: Operations are done on the ROI only (except if the operation changes the data shape, or the pixel size for images)
fr: Les opérations sont effectuées uniquement sur la ROI (sauf si l'opération modifie la forme des données, ou la taille des pixels pour les images)

source: Processing features are done on the ROI only (if the destination object data type is compatible with the source object data type, which excludes thresholding, for instance)
fr: Les fonctionnalités de traitement sont effectuées uniquement sur la ROI (si le type de données de l'objet de destination est compatible avec le type de données de l'objet source, ce qui exclut le seuillage, par exemple)

source: Analysis features are done on the ROI only, like before
fr: Les fonctionnalités d'analyse sont effectuées uniquement sur la ROI, comme avant

source: As a consequence of previous point, and for clarity:
fr: En conséquence du point précédent, et pour plus de clarté :

source: The "Edit Regions of interest" and "Remove all Regions of interest" features have been moved from the old "Computing" (now "Analysis") menu to the "Edit" menu where all metadata-related features are located
fr: Les fonctionnalités "Modifier les régions d'intérêt" et "Supprimer toutes les régions d'intérêt" ont été déplacées du vieux menu "Calcul" (maintenant "Analyse") vers le menu "Édition" où se trouvent toutes les fonctionnalités liées aux métadonnées

source: The "Edit Regions of interest" action has been added to both Signal and Image View vertical toolbars (in second position, after the "View in a new window" action)
fr: L'action "Modifier les régions d'intérêt" a été ajoutée aux barres d'outils verticales de la Vue Signal et Image (en deuxième position, après l'action "Voir dans une nouvelle fenêtre")

source: Following the bug fix on image data type conversion issues with basic operations, a new "Arithmetic operation" feature has been added to the "Operations" menu for both Signal and Image panels. This feature allows to perform linear operations on signals and images, with the following operations:
fr: Suite à la correction des problèmes de conversion du type de données des images avec les opérations de base, une nouvelle fonctionnalité "Opération arithmétique" a été ajoutée au menu "Opérations" pour les panneaux Signal et Image. Cette fonctionnalité permet d'effectuer des opérations linéaires sur les signaux et les images, avec les opérations suivantes :

source: Subtraction: ``obj3 = (obj1 - obj2) * a + b``
fr: Soustraction : ``obj3 = (obj1 - obj2) * a + b``

source: Improved "View in a new window" and "ROI editor" dialog boxes size management: default size won't be larger than DataLab's main window size
fr: Amélioration de la gestion de la taille des boîtes de dialogue "Voir dans une nouvelle fenêtre" et "Éditeur de ROI" : la taille par défaut ne sera pas plus grande que la taille de la fenêtre principale de DataLab

source: ROI editor:
fr: Éditeur de ROI :

source: Added toolbars for both Signal and Image ROI editors, to allow to zoom in and out, and to reset the zoom level easily
fr: Ajout de barres d'outils pour les éditeurs de ROI Signal et Image, pour permettre de zoomer et dézoomer, et de réinitialiser facilement le niveau de zoom

source: Rearranged the buttons in the ROI editor dialog box for better ergonomics and consistency with the Annotations editor ("View in a new window" dialog box)
fr: Réorganisation des boutons dans la boîte de dialogue de l'éditeur de ROI pour une meilleure ergonomie et une cohérence avec l'éditeur d'annotations (boîte de dialogue "Voir dans une nouvelle fenêtre")

source: Application color theme:
fr: Application de thème de couleur :

source: Added support for color theme (auto, light, dark) in the "Settings" dialog box
fr: Ajout de la prise en charge du thème de couleur (auto, clair, foncé) dans la boîte de dialogue "Paramètres"

source: The color theme is applied without restarting the application
fr: Le thème de couleur est appliqué sans redémarrer l'application

source: Intensity profile / Segment profile extraction:
fr: Extraction de profil d'intensité / Profil de segment :

source: When extracting a profile on an image with a ROI defined, the associated PlotPy feature show a warning message ('UserWarning: Warning: converting a masked element to nan.') but the profile is correctly extracted and displayed, with NaN values where the ROI is not defined.
fr: Lors de l'extraction d'un profil sur une image avec une ROI définie, la fonction PlotPy associée affiche un message d'avertissement ('UserWarning: Attention : conversion d'un élément masqué en nan.') mais le profil est correctement extrait et affiché, avec des valeurs NaN là où la ROI n'est pas définie.

source: NaN values are now removed from the profile before plotting it
fr: Les valeurs NaN sont maintenant supprimées du profil avant de le tracer

source: Simple processing features with a one-to-on mapping with a Python function (e.g. `numpy.absolute`, `numpy.log10`, etc.) and without parameters: fix result object title which was systematically ending with "|" (the character that usually precedes the list of parameters)
fr: Les fonctionnalités de traitement simples avec une correspondance un-à-un avec une fonction Python (par exemple `numpy.absolute`, `numpy.log10`, etc.) et sans paramètres : correction du titre de l'objet résultat qui se terminait systématiquement par "|" (le caractère qui précède généralement la liste des paramètres)

source: Butterworth filter: fix cutoff frequency ratio default value and valid range
fr: Filtrage de Butterworth : correction de la valeur par défaut et de la plage de valeurs valides de la fréquence de coupure

source: Fix actions refresh issue in Image View vertical toolbar:
fr: Toutes les actions liées à la visualisation sont désormais regroupées dans la barre d'outils verticale du panneau de visualisation

source: When starting DataLab with the Signal Panel active, switching to the Image View was showing "View in a new window" or "Edit Regions of interest" actions enabled in the vertical toolbar, even if no image was displayed in the Image View
fr: Lors du démarrage de DataLab avec le panneau Signal actif, le passage à la Vue Image affichait les actions "Voir dans une nouvelle fenêtre" ou "Modifier les régions d'intérêt" activées dans la barre d'outils verticale, même si aucune image n'était affichée dans la Vue Image

source: The Image View vertical toolbar is now correctly updated at startup
fr: La barre d'outils verticale de la Vue Image est maintenant correctement mise à jour au démarrage

source: View in a new window: cross section tools (intensity profiles) stayed disabled unless the user selected an image through the item list - this is now fixed
fr: Voir dans une nouvelle fenêtre : les outils de coupe transversale (profils d'intensité) restaient désactivés à moins que l'utilisateur ne sélectionne une image via la liste des éléments - c'est maintenant corrigé

source: Image View: "Show contrast panel" toolbar button was not enabled at startup, and was only enabled when at least one image was displayed in the Image View - it is now always enabled, as expected
fr: Vue Image : le bouton de la barre d'outils "Afficher le panneau de contraste" n'était pas activé au démarrage, et n'était activé que lorsqu'au moins une image était affichée dans la Vue Image - il est maintenant toujours activé, comme prévu

source: Image data type conversion:
fr: Conversion du type de données des images :

source: Previously, the data type conversion feature was common to signal and image processing features, i.e. a simple conversion of the data type using NumPy's `astype` method
fr: Précédemment, la fonction de conversion de type de données était commune aux fonctionnalités de traitement de signal et d'image, c'est-à-dire une simple conversion du type de données en utilisant la méthode `astype` de NumPy

source: This was not sufficient for image processing features, in particular for integer images, because even if the result was correct from a numerical point of view, underflow or overflow could be legitimately seen as a bug from a mathematical point of view
fr: Cela n'était pas suffisant pour les fonctionnalités de traitement d'image, en particulier pour les images avec des données de type entier, car même si le résultat était correct d'un point de vue numérique, un débordement ou un dépassement pouvait légitimement être considéré comme un bug d'un point de vue mathématique

source: The image data type conversion feature now relies on the internal `clip_astype` function, which clips the data to the valid range of the target data type before converting it (in the case of integer images)
fr: La fonction de conversion du type de données des images repose désormais sur la fonction interne `clip_astype`, qui recadre les données dans la plage valide du type de données cible avant de les convertir (dans le cas des images de type entier)

source: Image ROI extraction issues:
fr: Problèmes d'extraction de ROI d'image :

source: Multiple regressions were introduced in version 0.16.0:
fr: Plusieurs régressions ont été introduites dans la version 0.16.0 :

source: Single circular ROI extraction was not working as expected (a rectangular ROI was extracted, with unexpected coordinates)
fr: L'extraction d'une seule ROI circulaire ne fonctionnait pas comme prévu (une ROI rectangulaire était extraite, avec des coordonnées inattendues)

source: Multiple circular ROI extraction lead to a rectangular ROI extraction
fr: L'extraction de plusieurs ROI circulaires conduisait à une extraction de ROI rectangulaire

source: Multiple ROI extraction was no longer cropping the image to the overall bounding box of the ROIs
fr: L'extraction de plusieurs ROI ne recadrait plus l'image à la boîte englobante globale des ROIs

source: These issues are now fixed, and unit tests have been added to prevent regressions:
fr: Ces problèmes sont maintenant corrigés, et des tests unitaires ont été ajoutés pour éviter les régressions :

source: An independent test algorithm has been implemented to check the correctness of the ROI extraction in all cases mentioned above
fr: Un algorithme de test indépendant a été implémenté pour vérifier la correction de l'extraction de ROI dans tous les cas mentionnés ci-dessus

source: Tests cover both single and multiple ROI extraction, with circular and rectangular ROIs
fr: Les tests couvrent à la fois l'extraction de ROI unique et multiple, avec des ROIs circulaires et rectangulaires

source: Overflow and underflow issues in some operations on integer images:
fr: Problèmes de débordement et de dépassement dans certaines opérations sur des images de type entier :

source: When processing integer images, some features were causing overflow or underflow issues, leading to unexpected results (correct results from a numerical point of view, but not from a mathematical point of view)
fr: Lors du traitement d'images de type entier, certaines fonctionnalités provoquaient des problèmes de débordement ou de dépassement, entraînant des résultats inattendus (résultats corrects d'un point de vue numérique, mais pas d'un point de vue mathématique)

source: This issue only concerned basic operations (addition, subtraction, multiplication, division, and constant operations) - all the other features were already working as expected
fr: Ce problème ne concernait que les opérations de base (addition, soustraction, multiplication, division et opérations constantes) - toutes les autres fonctionnalités fonctionnaient déjà comme prévu

source: This is now fixed as result output are now floating point images
fr: Cela est maintenant corrigé car les résultats sont désormais des images à virgule flottante.

source: Unit tests have been added to prevent regressions for all these operations
fr: Des tests unitaires ont été ajoutés pour éviter les régressions pour toutes ces opérations

source: This is a minor maintenance release.
fr: Cette version concerne une maintenance mineure.

source: Requires PlotPy v2.4.1 or later to fix the following issues related to the contrast adjustment feature:
fr: PlotPy v2.4.1 ou ultérieur est requis pour corriger les problèmes suivants liés à la fonction d'ajustement de contraste :

source: A regression was introduced in an earlier version of PlotPy: levels histogram was no longer removed from contrast adjustment panel when the associated image was removed from the plot
fr: Une régression a été introduite dans une version antérieure de PlotPy : l'histogramme des niveaux n'était plus supprimé du panneau d'ajustement de contraste lorsque l'image associée était supprimée du graphique

source: This is now fixed: when an image is removed, the histogram is removed as well and the contrast panel is refreshed (which was not the case even before the regression)
fr: Cela est maintenant corrigé : lorsque une image est supprimée, l'histogramme est également supprimé et le panneau de contraste est rafraîchi (ce qui n'était pas le cas même avant la régression)

source: Ignore `AssertionError` in *config_unit_test.py* when executing test suite on WSL
fr: Ignorer `AssertionError` dans *config_unit_test.py* lors de l'exécution de la suite de tests sur WSL

source: Fix class reference in `Wrap11Func` documentation
fr: Correction de la référence de classe dans la documentation de `Wrap11Func`

source: Fixed [Issue #84](https://github.com/DataLab-Platform/DataLab/issues/84) - Build issues with V0.16.1: `signal` name conflict, ...
fr: Correction de l'[Issue #84](https://github.com/DataLab-Platform/DataLab/issues/84) - Problèmes de construction avec V0.16.1 : conflit de nom `signal`, ...

source: This issue was intended to be fixed in version 0.16.2, but the fix was not complete
fr: Ce problème devait être corrigé dans la version 0.16.2, mais la correction n'était pas suffisante

source: Thanks to [@rolandmas](https://github.com/rolandmas) for reporting the issue and for the help in investigating the problem and testing the fix
fr: Merci à [@rolandmas](https://github.com/rolandmas) pour avoir signalé le problème et pour l'aide apportée dans l'investigation du problème et le test de la correction

source: Fixed [Issue #85](https://github.com/DataLab-Platform/DataLab/issues/85) - Test data paths may be added multiple times to `datalab.utils.tests.TST_PATH`
fr: Correction de l'[Issue #85](https://github.com/DataLab-Platform/DataLab/issues/85) - Les chemins des données de test peuvent être ajoutés plusieurs fois à `datalab.utils.tests.TST_PATH`

source: This issue is related to [Issue #84](https://github.com/DataLab-Platform/DataLab/issues/84)
fr: Ce problème est lié à l'[Issue #84](https://github.com/DataLab-Platform/DataLab/issues/84)

source: Adding the test data paths multiple times to `datalab.utils.tests.TST_PATH` was causing the test data to be loaded multiple times, which lead to some tests failing (a simple workaround was added to V0.16.2: this issue is now fixed)
fr: Ajouter les chemins des données de test plusieurs fois à `datalab.utils.tests.TST_PATH` entraînait le chargement multiple des données de test, ce qui a conduit à l'échec de certains tests (une solution de contournement simple a été ajoutée à V0.16.2 : ce problème est maintenant corrigé)

source: Thanks again to [@rolandmas](https://github.com/rolandmas) for reporting the issue in the context of the Debian packaging
fr: Merci encore à [@rolandmas](https://github.com/rolandmas) pour avoir signalé le problème dans le contexte de l'emballage Debian

source: Fixed [Issue #86](https://github.com/DataLab-Platform/DataLab/issues/86) - Average of N integer images overflows data type
fr: Correction de l'[Issue #86](https://github.com/DataLab-Platform/DataLab/issues/86) - La moyenne de N images entières dépasse le type de données

source: Fixed [Issue #87](https://github.com/DataLab-Platform/DataLab/issues/87) - Image average profile extraction: `AttributeError` when trying to edit profile parameters
fr: Correction de l'[Issue #87](https://github.com/DataLab-Platform/DataLab/issues/87) - Extraction du profil moyen de l'image : `AttributeError` lors de la tentative de modification des paramètres du profil

source: Fixed [Issue #88](https://github.com/DataLab-Platform/DataLab/issues/88) - Image segment profile: point coordinates inversion
fr: Correction de l'[Issue #88](https://github.com/DataLab-Platform/DataLab/issues/88) - Profil de segment d'image : inversion des coordonnées des points

source: This release requires PlotPy v2.4.0 or later, which brings the following bug fixes and new features:
fr: Cette version nécessite PlotPy v2.4.0 ou ultérieure, qui apporte les corrections de bugs et les nouvelles fonctionnalités suivantes :

source: New constrast adjustment features and bug fixes:
fr: Nouvelles fonctionnalités d'ajustement de contraste et corrections de bugs :

source: New layout: the vertical toolbar (which was constrained in a small area on the right side of the panel) is now a horizontal toolbar at the top of the panel, beside the title
fr: Nouvelle disposition : la barre d'outils verticale (qui était contrainte dans une petite zone sur le côté droit du panneau) est désormais une barre d'outils horizontale en haut du panneau, à côté du titre

source: New "Set range" button: allows the user to set manually the minimum and maximum values of the histogram range
fr: Nouveau bouton "Définir l'échelle" : permet à l'utilisateur de définir manuellement les valeurs minimale et maximale de la plage de l'histogramme

source: Fixed histogram update issues when no image was currently selected (even if the an image was displayed and was selected before)
fr: Correction des problèmes de mise à jour de l'histogramme lorsque aucune image n'était actuellement sélectionnée (même si une image était affichée et sélectionnée auparavant)

source: Histogram range was not updated when either the minimum or maximum value was set using the "Minimum value" or "Maximum value" buttons (which have been renamed to "Min." and "Max." in this release)
fr: La plage de l'histogramme n'était pas mise à jour lorsque la valeur minimale ou maximale était définie à l'aide des boutons "Valeur minimale" ou "Valeur maximale" (qui ont été renommés en "Min." et "Max." dans cette version)

source: Histogram range was not updated when the "Set full range" button was clicked, or when the LUT range was modified using the "Scales / LUT range" form in "Properties" group box
fr: La plage de l'histogramme n'était pas mise à jour lorsque le bouton "Définir la plage complète" était cliqué, ou lorsque la plage de LUT était modifiée à l'aide du formulaire "Échelles / Plage de LUT" dans le groupe "Propriétés"

source: Image view context menu: new "Reverse X axis" feature
fr: Menu contextuel de la Vue Image : nouvelle fonctionnalité "Inverser l'axe X"

source: ℹ️ Minor new features and enhancements:
fr: ℹ️ Nouvelles fonctionnalités mineures et améliorations :

source: Image file types:
fr: Types de fichiers image :

source: Added native support for reading .SPE, .GEL, .NDPI and .REC image files
fr: Ajout de la prise en charge native de la lecture des fichiers image .SPE, .GEL, .NDPI et .REC

source: Added support for any `imageio`-supported file format through configuration file (entry `imageio_formats` may be customized to complement the default list of supported formats: see [documentation](https://datalab-platform.com/en/features/image/menu_file.html#open-image) for more details)
fr: Ajout de la prise en charge de tout format de fichier pris en charge par `imageio` via le fichier de configuration (l'entrée `imageio_formats` peut être personnalisée pour compléter la liste par défaut des formats pris en charge : voir la [documentation](https://datalab-platform.com/fr/features/image/menu_file.html#open-image) pour plus de détails)

source: Image Fourier analysis:
fr: Analyse de Fourier des images :

source: Fixed logarithmic scale for the magnitude spectrum (computing dB instead of natural logarithm)
fr: Correction de l'échelle logarithmique pour le spectre de magnitude (calcul en dB au lieu du logarithme naturel)

source: Fixed PSD computation with logarithmic scale (computing dB instead of natural logarithm)
fr: Correction du calcul de la DSP avec une échelle logarithmique (calcul en dB au lieu du logarithme naturel)
