Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Automatically selects the source object(s) that were used to create the currently selected processed object
fr: Sélectionne automatiquement l'objet (ou les objets) source qui ont été utilisés pour créer l'objet traité actuellement sélectionné.

source: Works for all processing patterns (1-to-1, 2-to-1, n-to-1) by reading processing metadata
fr: Fonctionne pour tous les modèles de traitement (1-vers-1, 2-vers-1, n-vers-1) en lisant les métadonnées de traitement.

source: Handles multiple source objects (e.g., from n-to-1 operations)
fr: Gère plusieurs objets source (par exemple, à partir d'opérations n-vers-1)

source: Shows informative messages if source objects no longer exist or if some are missing
fr: Affiche des messages informatifs si les objets source n'existent plus ou si certains sont manquants.

source: Useful for understanding processing workflows and tracing data lineage
fr: Utile pour comprendre les flux de traitement et retracer la lignée des données.

source: Helps users navigate complex processing chains by jumping back to original source data
fr: Aide les utilisateurs à naviguer dans des chaînes de traitement complexes en revenant aux données source d'origine.

source: **Processing history**: New "History" tab shows object processing lineage
fr: **Historique de traitement** : Nouvel onglet "Historique" affichant la lignée de traitement des objets

source: Appears in the Properties panel for all signal and image objects
fr: Apparaît dans le panneau des propriétés pour tous les objets signal et image

source: Displays a hierarchical tree showing how the object was created and processed
fr: Affiche un arbre hiérarchique montrant comment l'objet a été créé et traité.

source: Shows processing chain from oldest (original/created object) to newest (current object)
fr: Affiche la chaîne de traitement de l'objet le plus ancien (objet d'origine/créé) à l'objet le plus récent (objet actuel).

source: Displays function names for each processing step in a clear, indented format
fr: Affiche les noms de fonction pour chaque étape de traitement dans un format clair et indenté.

source: Indicates when source objects have been deleted or when multiple sources were used
fr: Indique quand les objets source ont été supprimés ou lorsque plusieurs sources ont été utilisées.

source: Automatically updates when object selection changes
fr: Se met à jour automatiquement lorsque la sélection d'objet change.

source: Useful for understanding complex processing workflows and documenting analysis steps
fr: Utile pour comprendre les flux de travail de traitement complexes et documenter les étapes d'analyse.

source: Text is selectable and copyable for documentation purposes
fr: Le texte est sélectionnable et copiable à des fins de documentation.

source: **Non-uniform coordinate support for images**: Images can now have non-uniform pixel spacing
fr: **Prise en charge des coordonnées non uniformes pour les images** : Les images peuvent désormais avoir un espacement de pixel non uniforme

source: Image objects now support both uniform and non-uniform coordinate systems:
fr: Les objets image prennent désormais en charge les systèmes de coordonnées uniformes et non uniformes :

source: Uniform coordinates: regular grid with constant pixel spacing (traditional mode)
fr: Coordonnées uniformes : grille régulière avec espacement de pixel constant (mode traditionnel)

source: Non-uniform coordinates: arbitrary X and Y coordinate arrays for each pixel
fr: Coordonnées non uniformes : tableaux de coordonnées X et Y arbitraires pour chaque pixel

source: New "Set uniform coordinates" feature in Processing menu > Axis transformation:
fr: Nouvelle fonctionnalité "Définir les coordonnées uniformes" dans le menu Traitement > Transformation des axes :

source: Converts images with non-uniform coordinates to uniform coordinate system
fr: Convertit les images avec des coordonnées non uniformes en un système de coordonnées uniformes

source: Automatically calculates optimal uniform spacing from non-uniform arrays
fr: Calcule automatiquement l'espacement uniforme optimal à partir de tableaux non uniformes

source: Useful for standardizing coordinate systems before certain operations
fr: Utile pour standardiser les systèmes de coordonnées avant certaines opérations

source: Enhanced "Calibration" feature with polynomial support:
fr: Amélioration de la fonctionnalité "Calibration" avec prise en charge des polynômes :

source: Now supports polynomial calibration up to cubic order for all axes (X, Y, Z)
fr: Prend désormais en charge la calibration polynomiale jusqu'à l'ordre cubique pour tous les axes (X, Y, Z)

source: Polynomial transformation: `output = a0 + a1*input + a2*input² + a3*input³`
fr: Transformation polynomiale : `output = a0 + a1*input + a2*input² + a3*input³`

source: For X and Y axes: Creates non-uniform coordinates to represent polynomial transformations
fr: Pour les axes X et Y : Crée des coordonnées non uniformes pour représenter les transformations polynomiales

source: For Z axis: Applies polynomial transformation to pixel values
fr: Pour l'axe Z : Applique la transformation polynomiale aux valeurs des pixels

source: Linear calibration is achieved by setting quadratic and cubic coefficients to zero
fr: La calibration linéaire est obtenue en fixant les coefficients quadratiques et cubiques à zéro

source: Ideal for correcting non-linear distortions in imaging systems or sensors
fr: Idéal pour corriger les distorsions non linéaires dans les systèmes d'imagerie ou les capteurs

source: Updated image organization features to handle non-uniform coordinates:
fr: Mise à jour des fonctionnalités d'organisation des images pour gérer les coordonnées non uniformes :

source: "Distribute on grid" now works with both uniform and non-uniform coordinate images
fr: "Distribuer sur la grille" fonctionne désormais avec des images à coordonnées uniformes et non uniformes

source: "Reset image positions" maintains coordinate system type (uniform/non-uniform)
fr: "Réinitialiser les positions d'image" maintient le type de système de coordonnées (uniforme/non uniforme)

source: Plot display automatically adapts to show correct pixel positions
fr: L'affichage des tracés s'adapte automatiquement pour montrer les positions de pixels correctes

source: File I/O support:
fr: Prise en charge de l'entrée/sortie de fichiers :

source: HDF5 format preserves non-uniform coordinate information
fr: Le format HDF5 préserve les informations de coordonnées non uniformes

source: Coordinated text files can store and load non-uniform coordinate arrays
fr: Les fichiers texte coordonnés peuvent stocker et charger des tableaux de coordonnées non uniformes

source: All image processing operations handle non-uniform coordinates appropriately
fr: Toutes les opérations de traitement d'image gèrent les coordonnées non uniformes de manière appropriée

source: Performance optimized: Operations on uniform coordinates use fast array indexing when possible
fr: Performance optimisée : Les opérations sur des coordonnées uniformes utilisent un indexage de tableau rapide lorsque cela est possible

source: **DateTime signal support**: Signals can now handle time-series data with datetime X-axis
fr: **Prise en charge des signaux DateTime** : Les signaux peuvent désormais gérer des données de séries temporelles avec un axe X datetime

source: Automatic datetime detection when opening CSV files with timestamp columns
fr: Détection automatique des dates lors de l'ouverture de fichiers CSV avec des colonnes horodatées

source: DataLab automatically recognizes and converts datetime values (e.g., "2025-06-19 10:00:00") to numeric timestamps
fr: DataLab reconnaît et convertit automatiquement les valeurs datetime (par exemple, "2025-06-19 10:00:00") en horodatages numériques

source: Supports common datetime formats from data loggers and measurement instruments
fr: Prend en charge les formats datetime courants des enregistreurs de données et des instruments de mesure

source: Preserves datetime context for proper display and analysis
fr: Préserve le contexte datetime pour un affichage et une analyse appropriés

source: Time units can be configured (seconds, milliseconds, microseconds, minutes, hours)
fr: Les unités de temps peuvent être configurées (secondes, millisecondes, microsecondes, minutes, heures)

source: **Automatic datetime axis formatting**: When displaying signals with datetime X-axis, the plot automatically switches to datetime-formatted axis labels
fr: **Formatage automatique de l'axe datetime** : Lors de l'affichage de signaux avec un axe X datetime, le graphique passe automatiquement aux étiquettes d'axe au format datetime

source: X-axis labels show human-readable timestamps (e.g., "10:30:45") instead of numeric values
fr: Les étiquettes de l'axe X affichent des horodatages lisibles par l'homme (par exemple, "10:30:45") au lieu de valeurs numériques

source: Format adjusts based on signal time unit: sub-second units (ms/μs/ns) show fractional seconds
fr: Le format s'ajuste en fonction de l'unité de temps du signal : les unités sub-secondes (ms/μs/ns) affichent des secondes fractionnaires

source: Axis automatically reverts to standard formatting when no datetime signals are displayed
fr: L'axe revient automatiquement au format standard lorsque aucun signal datetime n'est affiché

source: Uses signal metadata for custom datetime formats when available
fr: Utilise les métadonnées du signal pour des formats datetime personnalisés lorsque cela est disponible

source: **Configurable datetime formats**: Users can customize the datetime axis label format via Settings dialog
fr: **Formats datetime configurables** : Les utilisateurs peuvent personnaliser le format des étiquettes de l'axe datetime via la boîte de dialogue des paramètres

source: Separate format strings for standard time units (s/min/h) and sub-second units (ms/μs/ns)
fr: Chaînes de format séparées pour les unités de temps standard (s/min/h) et les unités sub-secondes (ms/μs/ns)

source: Uses Python's strftime format codes for full flexibility
fr: Utilise les codes de format strftime de Python pour une flexibilité totale

source: Settings are persisted across sessions
fr: Les paramètres sont conservés entre les sessions

source: Default formats: "%H:%M:%S" for standard units, "%H:%M:%S.%f" for sub-second precision
fr: Formats par défaut : "%H:%M:%S" pour les unités standard, "%H:%M:%S.%f" pour la précision sub-seconde

source: Enhanced signal visualization with datetime-aware axis formatting
fr: **Visualisation améliorée des signaux avec un formatage d'axe sensible au datetime**

source: CSV export maintains datetime format for easy data sharing
fr: **L'exportation CSV préserve le format datetime pour un partage facile des données**

source: Ideal for analyzing sensor data, temperature logs, and time-series measurements
fr: **Idéal pour l'analyse des données de capteurs, des journaux de température et des mesures de séries temporelles**

source: This closes [Issue #258](https://github.com/DataLab-Platform/DataLab/issues/258) - Add support for CSV files with date/time X-axis
fr: Cela clôt [Issue #258](https://github.com/DataLab-Platform/DataLab/issues/258) - Ajout de la prise en charge des fichiers CSV avec un axe X de date/heure

source: **Customizable result shape and marker styles**: New settings to configure visual appearance of result shapes and markers
fr: **Styles personnalisables pour les formes et les marqueurs de résultats** : Nouveaux paramètres pour configurer l'apparence visuelle des formes et des marqueurs de résultats

source: Added four new button controls in the Settings dialog (Visualization tab) to customize styles:
fr: Ajout de quatre nouveaux contrôles de bouton dans la boîte de dialogue des paramètres (onglet Visualisation) pour personnaliser les styles :

source: **Shape style for signals**: Configure line style, color, width, fill pattern, symbol appearance, and selection styles for annotation shapes on signal plots
fr: **Style de forme pour les signaux** : Configurez le style de ligne, la couleur, la largeur, le motif de remplissage, l'apparence du symbole et les styles de sélection pour les formes d'annotation sur les graphiques de signaux

source: **Marker style for signals**: Configure cursor marker appearance including line style, symbol, text labels, and background transparency for signal analysis results
fr: **Style de marqueur pour les signaux** : Configurez l'apparence du marqueur de curseur, y compris le style de ligne, le symbole, les étiquettes de texte et la transparence de l'arrière-plan pour les résultats d'analyse des signaux

source: **Shape style for images**: Configure annotation shape appearance for image plots optimized for image visualization
fr: **Style de forme pour les images** : Configurez l'apparence des formes d'annotation pour les graphiques d'images optimisés pour la visualisation d'images

source: **Marker style for images**: Configure cursor marker styles for image analysis results
fr: **Style de marqueur pour les images** : Configurez les styles de marqueur de curseur pour les résultats d'analyse d'images

source: **Editable through PlotPy's shape parameter dialog**: Clicking each button opens an interactive editor with comprehensive style options including:
fr: **Éditable via la boîte de dialogue des paramètres de forme de PlotPy** : Cliquer sur chaque bouton ouvre un éditeur interactif avec des options de style complètes, y compris :

source: Line properties: style (solid, dashed, dotted), color, width
fr: Propriétés de la ligne : style (solide, en pointillés, en pointillés), couleur, largeur

source: Fill properties: pattern, color, transparency
fr: Propriétés de remplissage : motif, couleur, transparence

source: Symbol properties: marker type, size, edge and face colors
fr: Propriétés du symbole : type de marqueur, taille, couleurs de bord et de surface

source: Selection appearance: different styles when shapes are selected
fr: Apparence de sélection : styles différents lorsque les formes sont sélectionnées

source: Text formatting for marker labels
fr: Mise en forme du texte pour les étiquettes de marqueurs

source: **Persistent configuration**: All style settings are saved in the user configuration file and preserved across sessions
fr: **Configuration persistante** : Tous les paramètres de style sont enregistrés dans le fichier de configuration de l'utilisateur et préservés entre les sessions.

source: **Applied to all result shapes and markers**: Styles are applied to all result shapes and markers from analysis operations (peak detection, FWHM, centroid, statistics, etc.)
fr: **Appliqué à toutes les formes et tous les marqueurs de résultats** : Les styles sont appliqués à toutes les formes et tous les marqueurs de résultats des opérations d'analyse (détection de pics, FWHM, centroïde, statistiques, etc.)

source: **Shape refresh on settings change**: When shape/marker parameters are modified in Settings, users are prompted to refresh existing result shapes on visible plots to apply the new styles
fr: **Rafraîchissement des formes lors du changement de paramètres** : Lorsque les paramètres de forme/marqueur sont modifiés dans les paramètres, les utilisateurs sont invités à rafraîchir les formes de résultats existantes sur les graphiques visibles pour appliquer les nouveaux styles.

source: Improves workflow flexibility by allowing users to establish consistent visual styling for their analysis results
fr: Améliore la flexibilité du flux de travail en permettant aux utilisateurs d'établir un style visuel cohérent pour leurs résultats d'analyse.

source: Particularly useful for creating presentation-ready plots with custom color schemes or for adapting to different display environments
fr: Particulièrement utile pour créer des graphiques prêts pour la présentation avec des schémas de couleurs personnalisés ou pour s'adapter à différents environnements d'affichage.

source: **Enhance metadata handling by adding function name context to results**:
fr: **Amélioration de la gestion des métadonnées en ajoutant le contexte du nom de la fonction aux résultats** :

source: When computation functions (e.g., `full_width_at_y`, `x_at_y`) create results with parameters, the function name is now stored
fr: Lorsque les fonctions de calcul (par exemple, `full_width_at_y`, `x_at_y`) créent des résultats avec des paramètres, le nom de la fonction est désormais stocké.

source: Analysis parameters tab displays function name as a comment above parameter information for better context
fr: L'onglet des paramètres d'analyse affiche le nom de la fonction en tant que commentaire au-dessus des informations sur les paramètres pour un meilleur contexte.

source: Helps distinguish identical parameter classes (e.g., `OrdinateParam`) used by different functions
fr: Aide à distinguer les classes de paramètres identiques (par exemple, `OrdinateParam`) utilisées par différentes fonctions.

source: Improves clarity when reviewing analysis results with multiple computation parameters
fr: Améliore la clarté lors de l'examen des résultats d'analyse avec plusieurs paramètres de calcul.

source: Multi-object property editing:
fr: Édition des propriétés de plusieurs objets :

source: The properties panel now supports applying property changes to multiple selected objects simultaneously.
fr: Le panneau des propriétés prend désormais en charge l'application des modifications de propriétés à plusieurs objets sélectionnés simultanément.

source: When multiple signals or images are selected, modifying and applying properties updates all selected objects, not just the current one.
fr: Lorsque plusieurs signaux ou images sont sélectionnés, la modification et l'application des propriétés mettent à jour tous les objets sélectionnés, et pas seulement le courant.

source: Only the properties that were actually modified are applied to the selected objects, preserving individual object properties that were not changed.
fr: Seules les propriétés qui ont été réellement modifiées sont appliquées aux objets sélectionnés, préservant les propriétés individuelles des objets qui n'ont pas été changées.

source: Typical use case: changing the LUT boundaries (Z scale bounds) or colormap of multiple images at once, or adjusting display properties for a group of signals.
fr: Cas d'utilisation typique : modification des limites de la LUT (bornes de l'échelle Z) ou de la carte des couleurs de plusieurs images à la fois, ou ajustement des propriétés d'affichage d'un groupe de signaux.

source: This significantly improves workflow efficiency when working with multiple objects that need similar property adjustments.
fr: Cela améliore considérablement l'efficacité du flux de travail lors de la manipulation de plusieurs objets nécessitant des ajustements de propriétés similaires.

source: Result metadata management:
fr: Gestion des métadonnées des résultats :

source: **Merged result labels**: All analysis results for a signal or image are now displayed in a single consolidated, read-only label
fr: **Étiquettes de résultats fusionnées** : Tous les résultats d'analyse pour un signal ou une image sont désormais affichés dans une seule étiquette consolidée en lecture seule

source: Previously, each analysis result (FWHM, FW1e2, centroid, etc.) created a separate editable label on the plot
fr: Auparavant, chaque résultat d'analyse (FWHM, FW1e2, centroïde, etc.) créait une étiquette éditable distincte sur le graphique

source: Now, all results for an object are merged into one read-only label, providing a cleaner and more organized display
fr: Maintenant, tous les résultats pour un objet sont fusionnés en une seule étiquette en lecture seule, offrant un affichage plus propre et plus organisé

source: The merged label automatically updates when new results are computed or existing results are removed
fr: L'étiquette fusionnée se met à jour automatiquement lorsque de nouveaux résultats sont calculés ou que des résultats existants sont supprimés

source: Results are visually separated within the label using horizontal dividers for clarity
fr: Les résultats sont visuellement séparés au sein de l'étiquette à l'aide de diviseurs horizontaux pour plus de clarté

source: The label is read-only to prevent accidental deletion; individual results can be removed via the Analysis menu
fr: L'étiquette est en lecture seule pour éviter toute suppression accidentelle ; les résultats individuels peuvent être supprimés via le menu Analyse

source: Significantly reduces visual clutter when multiple analysis operations are performed on the same object
fr: Réduit considérablement le désordre visuel lorsque plusieurs opérations d'analyse sont effectuées sur le même objet

source: Improves plot readability and makes it easier to review all computed results at a glance
fr: Améliore la lisibilité du graphique et facilite la révision de tous les résultats calculés en un coup d'œil

source: The merged label is automatically positioned and managed by DataLab, freeing users from label placement concerns
fr: L'étiquette fusionnée est automatiquement positionnée et gérée par DataLab, libérant les utilisateurs des préoccupations liées au placement des étiquettes.

source: Deleting result labels (e.g., FWHM, statistics) from the plot now permanently removes the associated metadata.
fr: La suppression des étiquettes de résultats (par exemple, FWHM, statistiques) du graphique supprime désormais définitivement les métadonnées associées.

source: Previously, when a result label was deleted from the plot, the underlying result metadata remained in the object, causing the label to reappear when re-selecting the signal or image.
fr: Auparavant, lorsqu'une étiquette de résultat était supprimée du graphique, les métadonnées de résultat sous-jacentes restaient dans l'objet, ce qui faisait réapparaître l'étiquette lors de la re-sélection du signal ou de l'image.

source: Now, when a user deletes a result label via the plot interface, the associated result metadata is automatically removed from the object.
fr: Maintenant, lorsqu'un utilisateur supprime une étiquette de résultat via l'interface du graphique, les métadonnées de résultat associées sont automatiquement supprimées de l'objet.

source: This provides more intuitive behavior and gives users better control over which results are kept or discarded.
fr: Cela offre un comportement plus intuitif et donne aux utilisateurs un meilleur contrôle sur les résultats à conserver ou à supprimer.

source: Result deletion is persistent: labels do not reappear when de-selecting and re-selecting the object.
fr: La suppression des résultats est persistante : les étiquettes ne réapparaissent pas lors de la désélection et de la re-sélection de l'objet.

source: This enhancement applies to all result types including geometry results (FWHM, centroid, peak detection) and table results (statistics, pulse analysis).
fr: Cette amélioration s'applique à tous les types de résultats, y compris les résultats géométriques (FWHM, centroïde, détection de pics) et les résultats de tableau (statistiques, analyse d'impulsions).

source: **Individual result deletion**: Results can now be deleted individually from the Analysis menu
fr: **Suppression individuelle des résultats** : Les résultats peuvent désormais être supprimés individuellement depuis le menu Analyse

source: New "Delete results" submenu in the Analysis menu, similar to the ROI removal feature
fr: Nouveau sous-menu "Supprimer les résultats" dans le menu Analyse, similaire à la fonctionnalité de suppression des ROI

source: Lists all individual results for the selected object(s) with their titles
fr: Liste tous les résultats individuels pour l'objet ou les objets sélectionnés avec leurs titres
