Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Release notes
fr: Notes de version

source: See DataLab [roadmap page](https://datalab-platform.com/en/contributing/roadmap.html) for future and past milestones.
fr: Voir la page de la [feuille de route](https://datalab-platform.com/fr/contributing/roadmap.html) de DataLab pour les jalons futurs et passés.

source: 💥 New features and enhancements:
fr: 💥 Nouvelles fonctionnalités et améliorations :

source: **New parametric image types**: Added five new parametric image generation options in the "New image" menu
fr: **Nouveaux types d'images paramétriques** : Ajout de cinq nouvelles options de génération d'images paramétriques dans le menu "Nouvelle image"

source: **Checkerboard**: Alternating square pattern ideal for camera calibration, spatial frequency analysis, and MTF testing. Configure square size, offset position, and light/dark values
fr: **Damier** : Motif carré alterné idéal pour la calibration de la caméra, l'analyse de la fréquence spatiale et les tests MTF. Configurez la taille des carrés, la position de décalage et les valeurs claires/sombres.

source: **Sinusoidal grating**: Frequency response testing pattern with independent spatial frequencies in X and Y directions, adjustable phase, amplitude, and DC offset. Essential for optical testing and MTF measurements
fr: **Grille sinusoïdale** : Motif de test de réponse en fréquence avec des fréquences spatiales indépendantes dans les directions X et Y, phase, amplitude et décalage DC réglables. Essentiel pour les tests optiques et les mesures MTF.

source: **Ring pattern**: Concentric circular rings for radial analysis and PSF testing. Adjustable ring period, width, center position, and amplitude range
fr: **Motif en anneau** : Anneaux circulaires concentriques pour l'analyse radiale et les tests PSF. Période d'anneau, largeur, position centrale et plage d'amplitude réglables.

source: **Siemens star**: Resolution testing pattern with radial spokes for angular frequency analysis. Configure number of spokes (spoke pairs), inner/outer radius to create hole or solid center, and intensity range
fr: **Étoile de Siemens** : Motif de test de résolution avec des rayons radiaux pour l'analyse de la fréquence angulaire. Configurez le nombre de rayons (paires de rayons), le rayon intérieur/extérieur pour créer un centre vide ou plein, et la plage d'intensité.

source: **2D sinc**: Cardinal sine function for PSF modeling and diffraction pattern simulation. Parameters include amplitude, center position, scale factor (sigma), and DC offset
fr: **Sinc 2D** : Fonction sinus cardinal pour la modélisation de la PSF et la simulation de motifs de diffraction. Les paramètres incluent l'amplitude, la position centrale, le facteur d'échelle (sigma) et le décalage DC.

source: **Group short IDs now distinguish between panels**: Group identifiers are now panel-specific to avoid ambiguity in cross-panel operations
fr: **Les identifiants courts de groupe distinguent désormais les panneaux** : Les identifiants de groupe sont désormais spécifiques au panneau afin d'éviter toute ambiguïté dans les opérations inter-panneaux

source: Signal Panel groups use `gs` prefix (e.g., `gs001`, `gs002`, ...)
fr: **Les groupes du panneau de signal utilisent le préfixe `gs` (par exemple, `gs001`, `gs002`, ...)**

source: Image Panel groups use `gi` prefix (e.g., `gi001`, `gi002`, ...)
fr: **Les groupes du panneau d'image utilisent le préfixe `gi` (par exemple, `gi001`, `gi002`, ...)**

source: Cross-panel operation results now clearly indicate source panel (e.g., `radial_profile(gi001)` vs `radial_profile(gs001)`)
fr: **Les résultats des opérations inter-panneaux indiquent désormais clairement le panneau source (par exemple, `radial_profile(gi001)` contre `radial_profile(gs001)`)**

source: Improves clarity when working with groups across both Signal and Image panels
fr: **Améliore la clarté lors du travail avec des groupes à travers les panneaux de signal et d'image**

source: **Performance optimizations for large result sets**: Added configurable display limits to prevent UI freezing with large analysis results
fr: **Optimisations des performances pour les grands ensembles de résultats** : Ajout de limites d'affichage configurables pour éviter le gel de l'interface utilisateur avec de grands résultats d'analyse

source: New configuration options to control result display behavior:
fr: Nouvelles options de configuration pour contrôler le comportement d'affichage des résultats :

source: `max_shapes_to_draw` (default: 1,000): Maximum number of geometry shapes drawn on plots
fr: `max_shapes_to_draw` (par défaut : 1 000) : Nombre maximum de formes géométriques dessinées sur les graphiques

source: `max_cells_in_label` (default: 100): Maximum table cells displayed in merged result labels
fr: `max_cells_in_label` (par défaut : 100) : Nombre maximum de cellules de tableau affichées dans les étiquettes de résultats fusionnées

source: `max_cols_in_label` (default: 15): Maximum columns displayed in merged result labels
fr: `max_cols_in_label` (par défaut : 15) : Nombre maximum de colonnes affichées dans les étiquettes de résultats fusionnées

source: When limits are exceeded:
fr: Lorsque les limites sont dépassées :

source: Shape drawing: Only first N shapes drawn, with warning label on plot
fr: Dessin des formes : Seules les N premières formes sont dessinées, avec une étiquette d'avertissement sur le graphique

source: Result labels: Tables truncated with notice showing omitted rows/columns
fr: Étiquettes de résultats : Tables tronquées avec un avis indiquant les lignes/colonnes omises

source: Prevents application freezing when processing operations produce large result sets (e.g., contour detection finding 1000+ polygons)
fr: Empêche le gel de l'application lorsque les opérations de traitement produisent de grands ensembles de résultats (par exemple, la détection de contours trouvant plus de 1000 polygones)

source: All limits are configurable through Settings dialog (Visualization → Results display limits)
fr: Toutes les limites sont configurables via la boîte de dialogue des paramètres (Visualisation → Limites d'affichage des résultats)

source: Settings documented in user manual with explanations of performance implications
fr: Paramètres documentés dans le manuel utilisateur avec explications des implications sur les performances

source: **Result label visibility control**: Added option to show/hide merged result labels on plots
fr: **Contrôle de la visibilité des étiquettes de résultats** : Ajout d'une option pour afficher/masquer les étiquettes de résultats fusionnées sur les graphiques

source: New checkbox in Properties panel (between Results and Annotations buttons) to toggle result label visibility
fr: Nouvelle case à cocher dans le panneau des propriétés (entre les boutons Résultats et Annotations) pour basculer la visibilité de l'étiquette de résultat

source: Labels are always added to the plot but can be shown/hidden with a single click
fr: Les étiquettes sont toujours ajoutées au graphique mais peuvent être affichées/masquées d'un simple clic

source: Default visibility configurable in Settings (Visualization → Results display limits → "Show results label by default")
fr: La visibilité par défaut est configurable dans les paramètres (Visualisation → Limites d'affichage des résultats → "Afficher l'étiquette de résultat par défaut")

source: Setting is persisted across sessions and applies to all new analysis results
fr: Le paramètre est conservé entre les sessions et s'applique à tous les nouveaux résultats d'analyse

source: Useful for decluttering plots when working with multiple results or when labels overlap with data
fr: Utile pour désencombrer les graphiques lors du travail avec plusieurs résultats ou lorsque les étiquettes se chevauchent avec les données

source: **Annotation management**: New features for managing plot annotations on signals and images
fr: **Gestion des annotations** : Nouvelles fonctionnalités pour la gestion des annotations de tracé sur les signaux et les images

source: New "Annotations" submenu in Edit menu with dedicated annotation operations
fr: Nouveau sous-menu "Annotations" dans le menu Édition avec des opérations d'annotation dédiées

source: **Copy annotations**: Copy annotations from selected object to clipboard
fr: **Copier les annotations** : Copier les annotations de l'objet sélectionné dans le presse-papiers

source: Only enabled when exactly one object with annotations is selected
fr: Activé uniquement lorsqu'un seul objet avec des annotations est sélectionné

source: **Paste annotations**: Paste annotations from clipboard to selected object(s)
fr: **Coller les annotations** : Coller les annotations du presse-papiers sur l'objet (ou les objets) sélectionné(s)

source: Merges pasted annotations with any existing annotations on target objects
fr: Fusionne les annotations collées avec les annotations existantes sur les objets cibles

source: Only enabled when annotations clipboard is not empty
fr: Activé uniquement lorsque le presse-papiers d'annotations n'est pas vide

source: Works with multiple selected objects for batch annotation application
fr: Fonctionne avec plusieurs objets sélectionnés pour une application d'annotation par lots

source: **Edit annotations**: Open annotation editor dialog for interactive annotation management
fr: **Modifier les annotations** : Ouvrir la boîte de dialogue de l'éditeur d'annotations pour une gestion interactive des annotations

source: Create, modify, and delete plot annotations (shapes, labels, markers, etc.)
fr: Créer, modifier et supprimer des annotations de tracé (formes, étiquettes, marqueurs, etc.)

source: Visual editor with same PlotPy tools as main plot view
fr: Éditeur visuel avec les mêmes outils PlotPy que la vue principale du tracé

source: Changes are immediately applied to selected object
fr: Les modifications sont immédiatement appliquées à l'objet sélectionné

source: **Import annotations**: Load annotations from .dlabann JSON files
fr: **Importer les annotations** : Charger les annotations à partir de fichiers JSON .dlabann

source: Merges imported annotations with existing annotations
fr: Fusionne les annotations importées avec les annotations existantes

source: Supports versioned annotation format for future compatibility
fr: Prend en charge le format d'annotation versionné pour une compatibilité future

source: **Export annotations**: Save annotations to .dlabann JSON files
fr: **Exporter les annotations** : Enregistrer les annotations dans des fichiers JSON .dlabann

source: Preserves all annotation properties for later reuse
fr: Préserve toutes les propriétés des annotations pour une réutilisation ultérieure

source: Human-readable JSON format with version information
fr: Format JSON lisible avec des informations de version

source: **Delete annotations**: Remove all annotations from selected object(s)
fr: **Supprimer les annotations** : Supprimer toutes les annotations de l'objet (ou des objets) sélectionné(s)

source: Only enabled when at least one selected object has annotations
fr: Activé uniquement lorsque au moins un objet sélectionné a des annotations

source: Confirmation dialog prevents accidental deletion
fr: La boîte de dialogue de confirmation empêche la suppression accidentelle

source: Works with multiple selected objects for batch deletion
fr: Fonctionne avec plusieurs objets sélectionnés pour une suppression par lots

source: Annotations are managed using Sigima 1.0 annotation API
fr: Les annotations sont gérées à l'aide de l'API d'annotation Sigima 1.0

source: Annotations are stored in object metadata and preserved across save/load operations
fr: Les annotations sont stockées dans les métadonnées de l'objet et préservées lors des opérations de sauvegarde/chargement

source: Clipboard-based workflow enables efficient annotation reuse across objects
fr: Le flux de travail basé sur le presse-papiers permet une réutilisation efficace des annotations entre les objets

source: Independent from ROI management - annotations and ROIs can coexist on same object
fr: Indépendant de la gestion des ROI - les annotations et les ROI peuvent coexister sur le même objet

source: **Plot results improvements**: Enhanced result plotting with better organization and informative titles
fr: **Améliorations du tracé des résultats** : Tracé des résultats amélioré avec une meilleure organisation et des titres informatifs

source: **Results group creation**: All plot results operations now automatically organize results in a dedicated "Results" group
fr: **Création de groupe de résultats** : Toutes les opérations de tracé des résultats organisent désormais automatiquement les résultats dans un groupe "Résultats" dédié

source: First time plotting results creates a new "Results" group in the signal panel
fr: La première fois que les résultats sont tracés, un nouveau groupe "Résultats" est créé dans le panneau des signaux

source: Subsequent result plots reuse the same "Results" group for better organization
fr: Les tracés de résultats suivants réutilisent le même groupe "Résultats" pour une meilleure organisation

source: Keeps workspace clean by consolidating all results in one well-defined location
fr: Garde l'espace de travail propre en consolidant tous les résultats en un seul endroit bien défini

source: Consistent behavior regardless of whether groups or individual objects are selected
fr: Comportement cohérent, que des groupes ou des objets individuels soient sélectionnés

source: **Comprehensive result titles**: Result signal titles now include source object identifiers
fr: **Titres de résultats complets** : Les titres des signaux de résultats incluent désormais les identifiants des objets source

source: For "one curve per title" mode: titles include all source object short IDs (e.g., "FWHM (s001, s002, s003): Δx = f(indices)")
fr: Pour le mode "une courbe par titre" : les titres incluent tous les identifiants courts des objets source (par exemple, "FWHM (s001, s002, s003): Δx = f(indices)")

source: For many source objects (>3): uses compact format showing first 2 IDs, "...", then last ID (e.g., "FWHM (s001, s002, ..., s010): Δx = f(indices)")
fr: Pour de nombreux objets source (>3) : utilise un format compact montrant les 2 premiers identifiants, "...", puis le dernier identifiant (par exemple, "FWHM (s001, s002, ..., s010): Δx = f(indices)")

source: Makes it easy to identify which objects contributed to plotted results
fr: Facilite l'identification des objets ayant contribué aux résultats tracés

source: Maintains consistency with "one curve per object" mode which already included IDs
fr: Maintient la cohérence avec le mode "une courbe par objet" qui incluait déjà des identifiants

source: **Metadata management improvements**: Enhanced metadata handling with clipboard-based workflow
fr: **Améliorations de la gestion des métadonnées** : Gestion des métadonnées améliorée avec un flux de travail basé sur le presse-papiers

source: Reorganized Edit menu with new "Metadata" submenu grouping all metadata operations
fr: **Menu Édition réorganisé** : Nouveau sous-menu "Métadonnées" regroupant toutes les opérations sur les métadonnées

source: **Paste metadata** action now only enabled when metadata clipboard is not empty
fr: **L'action "Coller les métadonnées"** est désormais activée uniquement lorsque le presse-papiers des métadonnées n'est pas vide

source: Prevents confusion when no metadata is available to paste
fr: Évite toute confusion lorsque aucune métadonnée n'est disponible pour le collage

source: Clipboard state is checked dynamically as object selection changes
fr: L'état du presse-papiers est vérifié dynamiquement lorsque la sélection d'objet change

source: **2D peak detection enhancements**: Added an option to choose the ROI geometry around detected peaks (either rectangular or circular).
fr: **Améliorations de la détection de pics 2D** : Ajout d'une option pour choisir la géométrie de la ROI autour des pics détectés (soit rectangulaire, soit circulaire).

source: **Detection features with ROI creation**: All image detection functions now support automatic ROI creation
fr: **Fonctions de détection avec création de ROI** : Toutes les fonctions de détection d'images prennent désormais en charge la création automatique de ROI

source: ROI creation option available for 7 detection algorithms:
fr: Option de création de ROI disponible pour 7 algorithmes de détection :

source: Peak detection (`peak_detection`)
fr: Détection de pics (`peak_detection`)

source: Contour shape detection (`contour_shape`)
fr: Détection de formes de contour (`contour_shape`)

source: Blob detection - DOG method (`blob_dog`)
fr: Détection de taches - Méthode DOG (`blob_dog`)

source: Blob detection - DOH method (`blob_doh`)
fr: Détection de taches - Méthode DOH (`blob_doh`)

source: Blob detection - LOG method (`blob_log`)
fr: Détection de taches - Méthode LOG (`blob_log`)

source: Blob detection - OpenCV method (`blob_opencv`)
fr: Détection de taches - Méthode OpenCV (`blob_opencv`)

source: Hough circle detection (`hough_circle_peaks`)
fr: Détection de cercles de Hough (`hough_circle_peaks`)

source: Each detection function provides two parameters:
fr: Chaque fonction de détection fournit deux paramètres :

source: "Create ROIs around detected features": Enable/disable automatic ROI creation
fr: "Créer des ROI autour des caractéristiques détectées": Activer/désactiver la création automatique de ROI

source: "ROI geometry": Choose between rectangular or circular ROIs
fr: "Géométrie de la ROI": Choisir entre des ROI rectangulaires ou circulaires

source: ROIs are automatically created after detection completes
fr: Les ROI sont automatiquement créées après la détection.

source: ROI size is optimized based on feature spacing and image bounds
fr: La taille de la ROI est optimisée en fonction de l'espacement des caractéristiques et des limites de l'image.

source: **Interactive object creation and processing**: New interactive workflow for creating and processing objects
fr: **Création et traitement interactifs d'objets** : Nouveau flux de travail interactif pour la création et le traitement des objets

source: **Interactive object creation**: Signal/image creation parameters can now be modified after creation
fr: **Création d'objets interactifs** : Les paramètres de création de signaux/images peuvent désormais être modifiés après la création

source: When creating a new signal or image (Gaussian, sine, etc.), a new "Creation" tab appears in the object properties panel
fr: Lors de la création d'un nouveau signal ou d'une nouvelle image (gaussien, sinusoïdal, etc.), un nouvel onglet "Création" apparaît dans le panneau des propriétés de l'objet.

source: Users can modify creation parameters (amplitude, frequency, size, etc.) and click "Apply" to regenerate the object in-place
fr: Les utilisateurs peuvent modifier les paramètres de création (amplitude, fréquence, taille, etc.) et cliquer sur "Appliquer" pour régénérer l'objet sur place.

source: Object is updated without creating a new one, preserving any subsequent processing or analysis
fr: L'objet est mis à jour sans en créer un nouveau, préservant tout traitement ou analyse ultérieur.

source: Only available for objects created with parameter classes (not for imported data)
fr: Disponible uniquement pour les objets créés avec des classes de paramètres (pas pour les données importées)

source: Useful for exploring different parameter values or fine-tuning object characteristics
fr: Utile pour explorer différentes valeurs de paramètres ou affiner les caractéristiques des objets

source: **Interactive 1-to-1 processing**: Processing parameters can be adjusted and reapplied after initial processing
fr: **Traitement interactif 1-vers-1** : Les paramètres de traitement peuvent être ajustés et réappliqués après le traitement initial

source: When applying a 1-to-1 processing operation with parameters (Gaussian filter, threshold, etc.), a new "Processing" tab appears
fr: Lors de l'application d'une opération de traitement 1-vers-1 avec des paramètres (filtre gaussien, seuil, etc.), un nouvel onglet "Traitement" apparaît.

source: Users can modify processing parameters and click "Apply" to re-process the object with updated values
fr: Les utilisateurs peuvent modifier les paramètres de traitement et cliquer sur "Appliquer" pour re-traiter l'objet avec les valeurs mises à jour.

source: Result object is updated in-place with new processing parameters
fr: L'objet résultant est mis à jour sur place avec les nouveaux paramètres de traitement.

source: Processing metadata stores: parameters (JSON), source object UUID, and function name
fr: Les métadonnées de traitement stockent : les paramètres (JSON), l'UUID de l'objet source et le nom de la fonction.

source: Source object validation: displays error message if source object was deleted
fr: Validation de l'objet source : affiche un message d'erreur si l'objet source a été supprimé.

source: Only works for processing functions with parameter classes (filtering, morphology, etc.)
fr: Fonctionne uniquement pour les fonctions de traitement avec des classes de paramètres (filtrage, morphologie, etc.)

source: Not supported for processing without parameters (absolute, inverse, etc.) - these work as before
fr: Non pris en charge pour le traitement sans paramètres (absolu, inverse, etc.) - ceux-ci fonctionnent comme avant

source: Intentionally not supported for 2-to-1 or n-to-1 processing patterns (use cases don't benefit from interactive behavior)
fr: Non pris en charge intentionnellement pour les modèles de traitement 2-vers-1 ou n-vers-1 (les cas d'utilisation ne bénéficient pas d'un comportement interactif)

source: Ideal for iteratively tuning processing parameters while observing results in real-time
fr: Idéal pour ajuster itérativement les paramètres de traitement tout en observant les résultats en temps réel.

source: **Recompute feature**: Quickly reprocess objects with their stored processing parameters
fr: **Fonction de recomposition** : Reprocessus rapide des objets avec leurs paramètres de traitement stockés.

source: New "Recompute" action in Edit menu (keyboard shortcut: Ctrl+R)
fr: Nouvelle action "Recomposer" dans le menu Édition (raccourci clavier : Ctrl+R)

source: Allows reprocessing one or multiple objects that have stored 1-to-1 processing parameters
fr: Permet de re-traiter un ou plusieurs objets qui ont des paramètres de traitement 1-vers-1 stockés.

source: When source object data changes, recompute updates the processed object(s) accordingly
fr: Lorsque les données de l'objet source changent, la recomposition met à jour l'objet (ou les objets) traité(s) en conséquence.

source: Works with both individual objects and groups of objects
fr: Fonctionne avec des objets individuels et des groupes d'objets.

source: Shows progress dialog for batch recomputing multiple objects
fr: Affiche une boîte de dialogue de progression pour le re-traitement par lots de plusieurs objets.

source: Objects without recomputable parameters are automatically skipped
fr: Les objets sans paramètres recomposables sont automatiquement ignorés.

source: Useful for updating results when input data is modified or to propagate changes through a processing chain
fr: Utile pour mettre à jour les résultats lorsque les données d'entrée sont modifiées ou pour propager les changements à travers une chaîne de traitement.

source: **Select source objects**: Navigate to source objects used in processing
fr: **Sélectionner les objets source** : Naviguer vers les objets source utilisés dans le traitement

source: New "Select source objects" action in Edit menu
fr: Nouvelle action "Sélectionner les objets source" dans le menu Édition
