Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: MSI installer allows to integrate DataLab's installation seemlessly in an organization's deployment system
fr: L'installeur MSI permet d'intégrer l'installation de DataLab de manière transparente dans le système de déploiement d'une organisation

source: Added support for large text/CSV files:
fr: Ajout de la prise en charge des fichiers texte/CSV volumineux :

source: Files over 1 GB (and with reasonable number of lines) can now be imported as signals or images without crashing the application or even slowing it down
fr: Les fichiers de plus de 1 Go (et avec un nombre raisonnable de lignes) peuvent désormais être importés en tant que signaux ou images sans quitter inopinément l'application ou même la ralentir

source: The file is read by chunks and, for signals, the data is downsampled to a reasonable number of points for visualization
fr: Le fichier est lu par morceaux et, pour les signaux, les données sont rééchantillonnées à un nombre raisonnable de points pour la visualisation

source: Large files are supported when opening a file (or dragging and dropping a file in the Signal Panel) and when importing a file in the Text Import Wizard
fr: Les fichiers volumineux sont pris en charge lors de l'ouverture d'un fichier (ou du glisser-déposer d'un fichier dans le Panneau Signal) et lors de l'importation d'un fichier dans l'Assistant d'importation de texte

source: Auto downsampling feature:
fr: Nouvelle fonctionnalité de sous-échantillonnage automatique :

source: Added "Auto downsampling" feature to signal visualization settings (see "Settings" dialog box)
fr: Ajout de la fonctionnalité "Sous-échantillonnage automatique" aux paramètres de visualisation des signaux (voir la boîte de dialogue "Paramètres")

source: This feature allows to automatically downsample the signal data for visualization when the number of points is too high and would lead to a slow rendering
fr: Cette fonctionnalité permet de rééchantillonner automatiquement les données du signal pour la visualisation lorsque le nombre de points est trop élevé et entraînerait un rendu lent

source: The downsampling factor is automatically computed based on the configured maximum number of points to display
fr: Le facteur de sous-échantillonnage est automatiquement calculé en fonction du nombre maximal de points à afficher configuré

source: This feature is enabled by default and may be disabled in the signal visualization settings
fr: Cette fonctionnalité est activée par défaut et peut être désactivée dans les paramètres de visualisation du signal

source: CSV format handling:
fr: Gestion du format CSV :

source: Improved support for CSV files with a header row (column names)
fr: Amélioration de la prise en charge des fichiers CSV avec une ligne d'en-tête (noms de colonnes)

source: Added support for CSV files with empty columns
fr: Ajout de la prise en charge des fichiers CSV avec des colonnes vides

source: Open/save file error handling:
fr: Gestion des erreurs d'ouverture/enregistrement de fichiers :

source: Error messages are now more explicit when opening or saving a file fails
fr: Les messages d'erreur sont désormais plus explicites lorsque l'ouverture ou l'enregistrement d'un fichier échoue

source: Added a link to the folder containing the file in the error message
fr: Ajout d'un lien vers le dossier contenant le fichier dans le message d'erreur

source: Added "Plugins and I/O formats" page to the Installation and Configuration Viewer (see "Help" menu)
fr: Ajout de la page "Plugins et fonctionnalités d'entrée/sortie" au Visualiseur d'installation et de configuration (voir le menu "Aide")

source: Reset DataLab configuration:
fr: Réinitialisation de la configuration de DataLab :

source: In some cases, it may be useful to reset the DataLab configuration file to its default values (e.g. when the configuration file is corrupted)
fr: Dans certains cas, il peut être utile de réinitialiser le fichier de configuration de DataLab à ses valeurs par défaut (par exemple, lorsque le fichier de configuration est corrompu)

source: Added new `--reset` command line option to remove the configuration folder
fr: Ajout de la nouvelle option de ligne de commande `--reset` pour supprimer le dossier de configuration

source: Added new "Reset DataLab" Start Menu shortcut to the Windows installer
fr: Ajout du nouveau raccourci du Menu Démarer "Reset DataLab" à l'installeur Windows

source: Fixed [Issue #64](https://github.com/DataLab-Platform/DataLab/issues/64) - HDF5 browser does not show datasets with 1x1 size:
fr: Correction de l'[Issue #64](https://github.com/DataLab-Platform/DataLab/issues/64) - L'explorateur HDF5 ne montre pas les ensembles de données de taille 1x1 :

source: HDF5 datasets with a size of 1x1 were not shown in the HDF5 browser
fr: Les datasets HDF5 de taille 1x1 n'étaient pas affichés dans l'explorateur HDF5

source: Even if those datasets should not be considered as signals or images, they are now shown in the HDF5 browser (but not checkable, i.e. not importable as signals or images)
fr: Même si ces données ne devraient pas être considérées comme des signaux ou des images, elles sont désormais affichées dans l'explorateur HDF5 (mais non sélectionnables, c'est-à-dire non importables en tant que signaux ou images)

source: ⚠️ API changes required for fixing support for multiple signals loading feature:
fr: ⚠️ Modifications de l'API nécessaires pour corriger la fonctionnalité de chargement de plusieurs signaux :

source: Merged `open_object` and `open_objects` methods to `load_from_files` in proxy classes, main window and data panels
fr: Fusion des méthodes `open_object` et `open_objects` en `load_from_files` dans les classes proxy, la fenêtre principale et les panneaux de données

source: For consistency's sake: merged `save_object` and `save_objects` into `save_to_files`
fr: Pour des raisons de cohérence : fusion de `save_object` et `save_objects` en `save_to_files`

source: To sum up, those changes lead to the following situation:
fr: En résumé, ces changements mènent à la situation suivante :

source: `load_from_files`: load a sequence of objects from multiple files
fr: `load_from_files` : charge une séquence d'objets à partir de plusieurs fichiers

source: `save_to_files`: save a sequence of objects to multiple files (at the moment, it only supports saving a single object to a single file, but it may be extended in the future to support saving multiple objects to a single file)
fr: `save_to_files` : sauvegarde une séquence d'objets dans plusieurs fichiers (pour le moment, il ne prend en charge que la sauvegarde d'un seul objet dans un seul fichier, mais il pourrait être étendu à l'avenir pour prendre en charge la sauvegarde de plusieurs objets dans un seul fichier)

source: Fixed [Issue #61](https://github.com/DataLab-Platform/DataLab/issues/61) - Text file import wizard: application crash when importing a multiple curve text file:
fr: Correction de l'[Issue #61](https://github.com/DataLab-Platform/DataLab/issues/61) - Assistant d'importation de fichiers texte : plantage de l'application lors de l'importation d'un fichier texte à courbes multiples :

source: This issue concerns a use case where the text file contains multiple curves
fr: Ce problème concerne un cas d'utilisation où le fichier texte contient plusieurs courbes

source: This is now fixed and an automatic test has been added to prevent regressions
fr: C'est maintenant corrigé et un test automatique a été ajouté pour éviter les régressions

source: 🎉 New domain name: [datalab-platform.com](https://datalab-platform.com)
fr: 🎉 Nouveau nom de domaine : [datalab-platform.com](https://datalab-platform.com)

source: 💥 New features:
fr: 💥 Nouvelles fonctionnalités :

source: Added support for colormap inversion in Image View:
fr: Ajout de la prise en charge de l'inversion de la palette de couleurs dans la Vue Image :

source: New "Invert colormap" entry in plot context menu, image parameters, and in the default image view settings
fr: Ajout de la nouvelle entrée "Inverser la palette de couleurs" dans le menu contextuel du graphique, les paramètres de l'image et dans les paramètres par défaut de la vue image

source: This requires `PlotPy` v2.3 or later
fr: Cette fonctionnalité nécessite `PlotPy` v2.3 ou ultérieur

source: HDF5 Browser:
fr: Explorateur HDF5 :

source: Added "Show array" button at the corner of the "Group" and "Attributes" tabs, to show the array in a separate window (useful for copy/pasting data to other applications, for instance)
fr: Ajout du bouton "Afficher le tableau" dans le coin des onglets "Groupe" et "Attributs", pour afficher le tableau dans une fenêtre séparée (utile pour copier/coller des données dans d'autres applications, par exemple)

source: Attributes: added support for more scalar data types
fr: Attributs : ajout de la prise en charge de plus de types de données scalaires

source: Testability and maintainability:
fr: Testabilité et maintenabilité :

source: DataLab's unit tests are now using [pytest](https://pytest.org). This has required a lot of work for the transition, especially to readapt the tests so that they may be executed in the same process. For instance, a particular attention has been given to sandboxing the tests, so that they do not interfere with each other.
fr: Les tests unitaires de DataLab utilisent désormais [pytest](https://pytest.org). Cela a nécessité beaucoup de travail pour la transition, en particulier pour réadapter les tests afin qu'ils puissent être exécutés dans le même processus. Par exemple, une attention particulière a été portée à l'isolement des tests, afin qu'ils n'interfèrent pas les uns avec les autres.

source: Added continuous integration (CI) with GitHub Actions
fr: Ajout de l'intégration continue (CI) avec GitHub Actions

source: For this release, test coverage is 87%
fr: Pour cette version, la couverture des tests est de 87%

source: Text file import assistant:
fr: Assistant d'importation de fichiers texte :

source: Drastically improved the performance of the array preview when importing large text files (no more progress bar, and the preview is now displayed almost instantaneously)
fr: Amélioration drastique des performances de l'aperçu du tableau lors de l'importation de fichiers texte volumineux (plus de barre de progression, et l'aperçu est désormais affiché presque instantanément)

source: XML-RPC server was not shut down properly when closing DataLab
fr: Le serveur XML-RPC n'était pas arrêté correctement lors de la fermeture de DataLab

source: Fixed test-related issues: some edge cases were hidden by the old test suite, and have been revealed by the transition to `pytest`. This has led to some bug fixes and improvements in the code.
fr: Correction de problèmes liés aux tests : certains cas limites étaient masqués par l'ancienne suite de tests, et ont été révélés par la transition vers `pytest`. Cela a conduit à des corrections de bugs et à des améliorations du code.

source: On Linux, when running a computation on a signal or an image, and on rare occasions, the computation was stuck as if it was running indefinitely. Even though the graphical user interface was still responsive, the computation was not progressing and the user had to cancel the operation and restart it. This was due to the start method of the separate process used for the computation (default method was "fork" on Linux). This is now fixed by using the "spawn" method instead, which is the recommended method for latest versions of Python on Linux when multithreading is involved.
fr: Sur Linux, lors de l'exécution d'un calcul sur un signal ou une image, et à de rares occasions, le calcul restait bloqué comme s'il s'exécutait indéfiniment. Même si l'interface graphique était toujours réactive, le calcul n'avançait pas et l'utilisateur devait annuler l'opération et la redémarrer. Cela était dû à la méthode de démarrage du processus séparé utilisé pour le calcul (la méthode par défaut était "fork" sur Linux). Ceci est maintenant corrigé en utilisant la méthode "spawn" à la place, qui est la méthode recommandée pour les dernières versions de Python sur Linux lorsque le multithreading est employé.

source: Fixed [Issue #60](https://github.com/DataLab-Platform/DataLab/issues/60) - `OSError: Invalid HDF5 file [...]` when trying to open an HDF5 file with an extension other than ".h5"
fr: Correction de l'[Issue #60](https://github.com/DataLab-Platform/DataLab/issues/60) - `OSError: Invalid HDF5 file [...]` lors de la tentative d'ouverture d'un fichier HDF5 avec une extension autre que ".h5"

source: Image Region of Interest (ROI) extraction: when modifying the image bounds in the confirmation dialog box, the ROI was not updated accordingly until the operation was run again
fr: Région d'intérêt (ROI) d'image : lors de la modification des limites de l'image dans la boîte de dialogue de confirmation, la ROI n'était pas mise à jour en conséquence jusqu'à ce que l'opération soit relancée

source: Deprecation issues:
fr: Problèmes d'obsolescence :

source: Fixed `scipy.ndimage.filters` deprecation warning
fr: Correction de l'avertissement d'obsolescence `scipy.ndimage.filters`

source: Fixed `numpy.fromstring` deprecation warning
fr: Correction de l'avertissement d'obsolescence `numpy.fromstring`

source: New "Histogram" feature in "Analysis" menu:
fr: Nouvelle fonctionnalité "Histogramme" dans le menu Analyse" :

source: Added histogram computation feature for both signals and images
fr: Ajout de la fonctionnalité de calcul d'histogramme pour les signaux et les images

source: The histogram is computed on the regions of interest (ROI) if any, or on the whole signal/image if no ROI is defined
fr: L'histogramme est calculé sur les régions d'intérêt (ROI) le cas échéant, ou sur l'ensemble du signal/image si aucune ROI n'est définie

source: Editable parameters: number of bins, lower and upper bounds
fr: Paramètres modifiables : nombre de classes, limites inférieure et supérieure

source: HDF5 browser:
fr: Explorateur HDF5 :

source: Improved tree view layout (more compact and readable)
fr: Amélioration de la disposition de la vue arborescente (plus compacte et lisible)

source: Multiple files can now be opened at once, using the file selection dialog box
fr: Plusieurs fichiers peuvent désormais être ouverts en même temps, en utilisant la boîte de dialogue de sélection de fichiers

source: Added tabs with information below the graphical preview:
fr: Ajout d'onglets avec des informations sous l'aperçu graphique :

source: Group info: path, textual preview, etc.
fr: Informations sur le groupe : chemin, aperçu textuel, etc.

source: Attributes info: name, value
fr: Informations sur les attributs : nom, valeur

source: Added "Show only supported data" check box: when checked, only supported data (signals and images) are shown in the tree view
fr: Ajout de la case à cocher "Afficher uniquement les données prises en charge" : lorsqu'elle est cochée, seules les données prises en charge (signaux et images) sont affichées dans la vue arborescente

source: Added "Show values" check box, to show/hide the values in the tree view
fr: Ajout de la case à cocher "Afficher les valeurs", pour afficher/masquer les valeurs dans la vue arborescente

source: Macro Panel:
fr: Panneau de macro-commandes :

source: Macro commands are now numbered, starting from 1, like signals and images
fr: Les macro-commandes sont désormais numérotées, à partir de 1, comme les signaux et les images

source: Remote control API (`RemoteProxy` and `LocalProxy`):
fr: API de contrôle à distance (`RemoteProxy` et `LocalProxy`) :

source: `get_object_titles` method now accepts "macro" as panel name and returns the list of macro titles
fr: `get_object_titles` accepte désormais "macro" comme nom de panneau et retourne la liste des titres de macro

source: New `run_macro`, `stop_macro` and `import_macro_from_file` methods
fr: Nouvelles méthodes `run_macro`, `stop_macro` et `import_macro_from_file`

source: Stand-alone version - Integration in Windows start menu:
fr: Version autonome - Intégration dans le menu de démarrage de Windows :

source: Fixed "Uninstall" shortcut (unclickable due to a generic name)
fr: Correction du raccourci "Désinstaller" (non cliquable en raison d'un nom générique)

source: Translated "Browse installation directory" and "Uninstall" shortcuts
fr: Traduction des raccourcis "Parcourir le répertoire d'installation" et "Désinstaller"

source: Fixed [Issue #55](https://github.com/DataLab-Platform/DataLab/issues/55) - Changing image bounds in Image View has no effect on the associated image object properties
fr: Correction de l'[Issue #55](https://github.com/DataLab-Platform/DataLab/issues/55) - Changer les limites de l'image dans la vue d'image n'a aucun effet sur les propriétés de l'objet image associé

source: Fixed [Issue #56](https://github.com/DataLab-Platform/DataLab/issues/56) - "Test data" plugin: `AttributeError: 'NoneType' object has no attribute 'data'` when canceling "Create image with peaks"
fr: Correction de l'[Issue #56](https://github.com/DataLab-Platform/DataLab/issues/56) - Plugin "Données de test" : `AttributeError: 'NoneType' object has no attribute 'data'` lors de l'annulation de "Créer une image avec des pics"

source: Fixed [Issue #57](https://github.com/DataLab-Platform/DataLab/issues/57) - Circle and ellipse result shapes are not transformed properly
fr: Ceci corrige l'[Issue #57](https://github.com/DataLab-Platform/DataLab/issues/57) - Les formes résultat cercle et ellipse ne sont pas transformées correctement

source: Curve color and style cycle:
fr: Cycle de couleur et de style de courbe :

source: Before this release, this cycle was handled by the same mechanism either for the Signal Panel or the HDF5 Browser, which was not the expected behavior
fr: Avant cette version, ce cycle était géré par le même mécanisme pour le Panneau Signal ou l'Explorateur HDF5, ce qui n'était pas le comportement attendu

source: Now, the cycle is handled separately: the HDF5 Browser or the Text Import Wizard use always the same color and style for curves, and they don't interfere with the Signal Panel cycle
fr: A présent, le cycle est géré séparément : l'Explorateur HDF5 ou l'Assistant d'importation de texte utilisent toujours la même couleur et le même style pour les courbes, et ils n'interfèrent pas avec le cycle du Panneau Signal

source: 🧹 Clarity-Enhanced Interface Update:
fr: 🧹 Clarification de certains libellés des interfaces graphiques :

source: The tabs used to switch between the data panels (signals and images) and the visualization components ("Curve panel" and "Image panel") have been renamed to "Signal Panel" and "Image Panel" (instead of "Signals" and "Images")
fr: Les onglets utilisés pour basculer entre les panneaux de données (signaux et images) et les composants de visualisation ("Panneau de courbes" et "Panneau d'images") ont été renommés en "Panneau Signal" et "Panneau Image" (au lieu de "Signaux" et "Images")

source: The visualization components have been renamed to "Signal View" and "Image View" (instead of "Curve panel" and "Image panel")
fr: Les composants de visualisation ont été renommés en "Vue Signal" et "Vue Image" (au lieu de "Panneau de courbes" et "Panneau d'images")

source: The data panel toolbar has been renamed to "Signal Toolbar" and "Image Toolbar" (instead of "Signal Processing Toolbar" and "Image Processing Toolbar")
fr: Les barres d'outils des panneaux de données ont été renommées en "Barre d'outils Signal" et "Barre d'outils Image" (au lieu de "Barre d'outils Traitement du Signal" et "Barre d'outils Traitement d'Image")

source: Ergonomics improvements: the "Signal Panel" and "Image Panel" are now displayed on the left side of the main window, and the "Signal View" and "Image View" are displayed on the right side of the main window. This reduces the distance between the list of objects (signals and images) and the associated actions (toolbars and menus), and makes the interface more intuitive and easier to use
fr: Améliorations ergonomiques : le "Panneau Signal" et le "Panneau Image" sont désormais affichés sur le côté gauche de la fenêtre principale, et la "Vue Signal" et la "Vue Image" sont affichées sur le côté droit de la fenêtre principale. Cela réduit la distance entre la liste des objets (signaux et images) et les actions associées (barres d'outils et menus), et rend l'interface plus intuitive et plus facile à utiliser

source: ✨ New tour and demo feature:
fr: ✨ Nouvelle fonctionnalité de visite guidée et de démonstration :

source: When starting DataLab for the first time, an optional tour is now shown to the user to introduce the main features of the application
fr: Lors du premier démarrage de DataLab, une visite guidée est désormais affichée à l'utilisateur pour présenter les principales fonctionnalités de l'application

source: The tour can be started again at any time from the "?" menu
fr: La visite guidée peut être relancée à tout moment depuis le menu "?"

source: Also added a new "Demo" feature to the "?" menu
fr: Ajout d'une nouvelle fonctionnalité "Démonstration" dans le menu "?"

source: 🚀 New Binder environment to test DataLab online without installing anything
fr: 🚀 Nouvel environnement Binder pour tester DataLab en ligne sans rien installer

source: New text tutorials are available:
fr: De nouveaux tutoriels textuels sont disponibles :

source: Measuring Laser Beam Size
fr: Mesure de la taille d'un faisceau laser

source: DataLab and Spyder: a perfect match
fr: DataLab et Spyder : un mariage parfait

source: "Getting started" section: added more explanations and links to the tutorials
fr: Section "Premiers pas" : ajout de plus d'explications et de liens vers les tutoriels

source: New "Contributing" section explaining how to contribute to DataLab, whether you are a developer or not
fr: Nouvelle section "Contribuer" expliquant comment contribuer à DataLab, que vous soyez développeur ou non

source: New "Macros" section explaining how to use the macro commands feature
fr: Nouvelle section "Macros" expliquant comment utiliser la fonctionnalité de macro-commandes

source: Added "Copy" button to code blocks in the documentation
fr: Ajout du bouton "Copier" aux blocs de code dans la documentation

source: New "Text file import assistant" feature:
fr: Nouvelle fonctionnalité d'assistant d'importation de fichiers texte :

source: This feature allows to import text files as signals or images
fr: Cette fonctionnalité permet d'importer des fichiers texte en tant que signaux ou images

source: The user can define the source (clipboard or texte file)
fr: L'utilisateur peut définir la source (presse-papiers ou fichier texte)

source: Then, it is possible to define the delimiter, the number of rows to skip, the destination data type, etc.
fr: Ensuite, il est possible de définir le délimiteur, le nombre de lignes à sauter, le type de données de destination, etc.

source: Added menu on the "Signal Panel" and "Image Panel" tabs corner to quickly access the most used features (e.g. "Add", "Remove", "Duplicate", etc.)
fr: Ajout d'un menu dans le coin des onglets "Panneau Signal" et "Panneau Image" pour accéder rapidement aux fonctionnalités les plus utilisées (par exemple "Ajouter", "Supprimer", "Dupliquer", etc.)

source: Intensity profile extraction feature:
fr: Fonctionnalité d'extraction de profil d'intensité :

source: Added graphical user interface to extract intensity profiles from images, for both line and averaged profiles
fr: Ajout d'une interface graphique pour extraire des profils d'intensité des images, pour les profils linéaires et moyennés
