Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Updated the documentation to explicitly mention that the logarithmic scale is in dB
fr: Mise à jour de la documentation pour mentionner explicitement que l'échelle logarithmique est en dB

source: Fixed [Issue #82](https://github.com/DataLab-Platform/DataLab/issues/82) - Macros are not renamed in DataLab after exporting them to Python scripts
fr: Correction de l'[Issue #82](https://github.com/DataLab-Platform/DataLab/issues/82) - Les macros ne sont pas renommées dans DataLab après les avoir exportées vers des scripts Python

source: `ResultProperties` object can now be added to `SignalObj` or `ImageObj` metadata even outside a Qt event loop (because the label item is no longer created right away)
fr: L'objet `ResultProperties` peut désormais être ajouté aux métadonnées de `SignalObj` ou `ImageObj` même en dehors d'une boucle d'événements Qt (car l'élément d'étiquette n'est plus créé immédiatement)

source: Progress bar is now automatically closed as expected when an error occurrs during a long operation (e.g. when opening a file)
fr: La barre de progression est désormais automatiquement fermée en cas d'erreur lors d'une opération longue (par exemple, lors de l'ouverture d'un fichier)

source: Difference, division...: dialog box for the second operand selection was allowing to select a group (only a signal or an image should be selected)
fr: Soustraction, division... : la boîte de dialogue pour la sélection du second opérande permettait de sélectionner un groupe (seul un signal ou une image devrait être sélectionné)

source: When doing an operation which involves an object (signal or image) with higher order number than the current object (e.g. when subtracting an image with an image from a group below the current image), the resulting object's title now correctly refers to the order numbers of the objects involved in the operation (e.g., to continue with the subtraction example mentioned above, the resulting object's title was previously referring to the order number before the insertion of the resulting image)
fr: Lorsqu'une opération implique un objet (signal ou image) ayant un numéro d'ordre supérieur à l'objet actuel (par exemple, lors de la soustraction d'une image avec une image d'un groupe en dessous de l'image actuelle), le titre de l'objet résultant fait désormais correctement référence aux numéros d'ordre des objets impliqués dans l'opération (par exemple, pour continuer avec l'exemple de soustraction mentionné ci-dessus, le titre de l'objet résultant faisait précédemment référence au numéro d'ordre avant l'insertion de l'image résultante)

source: Added support for additional test data folder thanks to the `DATALAB_DATA` environment variable (useful for testing purposes, and especially in the context of Debian packaging)
fr: Ajout de la prise en charge d'un dossier de données de test supplémentaire grâce à la variable d'environnement `DATALAB_DATA` (utile à des fins de test, et notamment dans le contexte de la préparation du paquet Debian de DataLab)

source: Since version 0.16.0, many validation functions have been added to the test suite. The percentage of validated compute functions has increased from 37% to 84% in this release.
fr: Depuis la version 0.16.0, de nombreuses fonctions de validation ont été ajoutées à la suite de tests. Le pourcentage de fonctions de calcul validées est passé de 37 % à 84 % dans cette version.

source: NumPy 2.0 support has been added with this release.
fr: La prise en charge de NumPy 2.0 a été ajoutée avec cette version.

source: Signal and image moving average and median filters:
fr: Filtres moyenne mobile et médiane pour les signaux et les images :

source: Added "Mode" parameter to choose the mode of the filter (e.g. "reflect", "constant", "nearest", "mirror", "wrap")
fr: Ajout du paramètre "Mode" pour choisir le mode du filtre (par exemple "reflect", "constant", "nearest", "mirror", "wrap")

source: The default mode is "reflect" for moving average and "nearest" for moving median
fr: Le mode par défaut est "reflect" pour la moyenne mobile et "nearest" pour la médiane mobile

source: This allows to handle edge effects when filtering signals and images
fr: Cela permet de gérer les effets de bord lors du filtrage des signaux et des images

source: Fixed Canny edge detection to return binary image as `uint8` instead of `bool` (for consistency with other image processing features)
fr: Correction de la détection de bord de Canny pour renvoyer une image binaire en `uint8` au lieu de `bool` (par soucis de cohérence avec les autres fonctionnalités de traitement d'image)

source: Fixed Image normalization: lower bound was wrongly set for `maximum` method
fr: Correction de la normalisation d'image : la borne inférieure était mal définie pour la méthode `maximum`

source: Fixed `ValueError` when computing PSD with logarithmic scale
fr: Correction de l'erreur `ValueError` lors du calcul de la DSP avec une échelle logarithmique

source: Fixed Signal derivative algorithm: now using `numpy.gradient` instead of a custom implementation
fr: Correction de l'algorithme de dérivation d'un signal : utilisation de `numpy.gradient` au lieu d'une implémentation personnalisée

source: Fixed SciPy's `cumtrapz` deprecation: use `cumulative_trapezoid` instead
fr: Correction de l'obsolescence de `cumtrapz` de SciPy : utilisation de `cumulative_trapezoid` à la place

source: Curve selection now shows the individual points of the curve (before, only the curve line width was broadened)
fr: La sélection de courbe affiche désormais les points individuels de la courbe (auparavant, seule la largeur de la ligne de la courbe était élargie)

source: Windows installer: add support for unstable releases (e.g., 0.16.1.dev0), thus allowing to easily install the latest development version of DataLab on Windows
fr: Installeur Windows : ajout de la prise en charge des versions instables (par exemple, 0.16.1.dev0), permettant ainsi d'installer facilement la dernière version de développement de DataLab sur Windows

source: Fixed [Issue #81](https://github.com/DataLab-Platform/DataLab/issues/81) - When opening files, show progress dialog only if necessary
fr: Correction de l'[Issue #81](https://github.com/DataLab-Platform/DataLab/issues/81) - Lors de l'ouverture de fichiers, afficher la boîte de dialogue de progression uniquement si nécessaire

source: Fixed [Issue #80](https://github.com/DataLab-Platform/DataLab/issues/80) - Plotting results: support for two use cases
fr: Correction de l'[Issue #80](https://github.com/DataLab-Platform/DataLab/issues/80) - Tracé des résultats : prise en charge de deux cas d'utilisation

source: The features of the "Analysis" menu produce *results* (scalars): blob detection (circle coordinates), 2D peak detection (point coordinates), etc. Depending on the feature, result tables are displayed in the "Results" dialog box, and the results are also stored in the signal or image metadata: each line of the result table is an individual result, and each column is a property of the result - some results may consist only of a single individual result (e.g., image centroid or curve FHWM), while others may consist of multiple individual results (e.g., blob detection, contour detection, etc.).
fr: Les fonctionnalités du menu Analyse" produisent des *résultats* (scalaires) : détection de taches (coordonnées de cercle), détection de pics 2D (coordonnées de points), etc. Selon la fonctionnalité, des tables de résultats sont affichées dans la boîte de dialogue "Résultats", et les résultats sont également stockés dans les métadonnées du signal ou de l'image : chaque ligne de la table de résultats est un résultat individuel, et chaque colonne est une propriété du résultat - certains résultats peuvent ne consister qu'en un seul résultat individuel (par exemple, le centroïde de l'image ou la FWHM de la courbe), tandis que d'autres peuvent consister en plusieurs résultats individuels (par exemple, détection de taches, détection de contours, etc.).

source: Before this change, the "Plot results" feature only supported plotting the first individual result of a result table, as a function of the index (of the signal or image objects) or any of the columns of the result table. This was not sufficient for some use cases, where the user wanted to plot multiple individual results of a result table.
fr: Avant ce changement, la fonctionnalité "Tracer les résultats" ne prenait en charge que le tracé du premier résultat individuel d'une table de résultats, en fonction de l'index (des objets de signal ou d'image) ou de l'une des colonnes de la table de résultats. Cela n'était pas suffisant pour certains cas d'utilisation, où l'utilisateur souhaitait tracer plusieurs résultats individuels d'une table de résultats.

source: Now, the "Plot results" feature supports two use cases:
fr: A présent, la fonctionnalité "Tracer les résultats" prend en charge deux cas d'utilisation :

source: "One curve per result title": Plotting the first individual result of a result table, as before
fr: "Une courbe par titre de résultat" : Tracer le premier résultat individuel d'une table de résultats, comme auparavant

source: "One curve per object (or ROI) and per result title": Plotting all individual results of a result table, as a function of the index (of the signal or image objects) or any of the columns of the result table
fr: "Une courbe par objet (ou ROI) et par titre de résultat" : Tracer tous les résultats individuels d'une table de résultats, en fonction de l'index (des objets de signal ou d'image) ou de l'une des colonnes de la table de résultats

source: The selection of the use case is done in the "Plot results" dialog box
fr: La sélection du cas d'utilisation se fait dans la boîte de dialogue "Tracer les résultats"

source: The default use case is "One curve per result title" if the result table has only one line, and "One curve per object (or ROI) and per result title" otherwise
fr: Le cas d'utilisation par défaut est "Une courbe par titre de résultat" si la table de résultats ne comporte qu'une seule ligne, et "Une courbe par objet (ou ROI) et par titre de résultat" dans les autres cas

source: Major user interface overhaul:
fr: Refonte majeure de l'interface utilisateur :

source: The menu bar and toolbars have been reorganized to make the application more intuitive and easier to use
fr: La barre de menu et les barres d'outils ont été réorganisées pour rendre l'application plus intuitive et plus facile à utiliser

source: Operations and processing features have been regrouped in submenus
fr: Les fonctionnalités d'opérations et de traitement ont été regroupées dans des sous-menus

source: All visualization-related actions are now grouped in the plot view vertical toolbar
fr: Toutes les actions liées à la visualisation sont désormais regroupées dans la barre d'outils verticale du panneau de visualisation

source: Clarified the "Annotations" management (new buttons, toolbar action...)
fr: Clarification de la gestion des "Annotations" (nouveaux boutons, action de la barre d'outils...)

source: New validation process for signal and image features:
fr: Nouveau processus de validation pour les fonctionnalités de traitement du signal et de l'image :

source: Before this release, DataLab's validation process was exclusively done from the programmer's point of view, by writing unit tests and integration tests, thus ensuring that the code was working as expected (i.e. that no exception was raised and that the behavior was correct)
fr: Avant cette version, le processus de validation de DataLab était exclusivement effectué du point de vue du programmeur, en écrivant des tests unitaires et des tests d'intégration, garantissant ainsi que le code fonctionnait comme prévu (c'est-à-dire qu'aucune exception n'était levée et que le comportement était correct)

source: With this release, a new validation process has been introduced, from the user's point of view, by adding new validation functions (marked with the `@pytest.mark.validation` decorator) in the test suite
fr: Avec cette version, un nouveau processus de validation a été introduit, du point de vue de l'utilisateur, en ajoutant de nouvelles fonctions de validation (marquées avec le décorateur `@pytest.mark.validation`) dans la suite de tests

source: A new "Validation" section in the documentation explains how validation is done and contains a list of all validation functions with the statistics of the validation process (generated from the test suite)
fr: Une nouvelle section "Validation" dans la documentation explique comment la validation est effectuée et contient une liste de toutes les fonctions de validation avec les statistiques du processus de validation (générées à partir de la suite de tests)

source: The validation process is a work in progress and will be improved in future versions
fr: Le processus de validation est en cours et sera amélioré dans les versions futures

source: "Properties" group box:
fr: Groupe "Propriétés" :

source: Added "Scales" tab, to show and set the plot scales:
fr: Ajout de l'onglet "Échelles", pour afficher et définir les échelles du graphique :

source: X, Y for signals
fr: X, Y pour les signaux

source: X, Y, Z (LUT range) for images
fr: X, Y, Z (plage de LUT) pour les images

source: View options:
fr: Options d'affichage :

source: New "Show first only" option in the "View" menu, to show only the first curve (or image) when multiple curves (or images) are displayed in the plot view
fr: Nouvelle option "Afficher uniquement le premier" dans le menu "Affichage", pour afficher uniquement la première courbe (ou image) lorsque plusieurs courbes (ou images) sont affichées dans la vue du graphique

source: New (movable) label for FWHM computations, additional to the existing segment annotation
fr: Nouvelle étiquette (déplaçable) pour les calculs de FWHM, en plus de l'annotation de segment existante

source: I/O features:
fr: Fonctionnalités d'E/S :

source: Added support for reading and writing .MAT files (MATLAB format)
fr: Ajout de la prise en charge de la lecture et de l'écriture des fichiers .MAT (format MATLAB)

source: Create a new group when opening a file containing multiple signals or images (e.g. CSV file with multiple curves)
fr: Création d'un nouveau groupe lors de l'ouverture d'un fichier contenant plusieurs signaux ou images (par exemple, un fichier CSV avec plusieurs courbes)

source: Add support for binary images
fr: Ajout de la prise en charge des images binaires

source: Signal ROI extraction: added new dialog box to manually edit the ROI lower and upper bounds after defining the ROI graphically
fr: Extraction de ROI de signal : ajout d'une nouvelle boîte de dialogue pour éditer manuellement les bornes inférieure et supérieure du ROI après avoir défini le ROI graphiquement

source: ℹ️ New **Signal** operations, processing and analysis features:
fr: ℹ️ Nouvelles fonctionnalités de traitement des **Signaux** :

source: Submenu
fr: Sous-menu

source: Features
fr: Fonctionnalités

source: New
fr: Nouveau

source: New signal
fr: Nouveau signal

source: Exponential, pulse, polynomial, custom (manual input)
fr: Exponentielle, impulsion, polynomiale, personnalisé (entrée manuelle)

source: Operations
fr: Opérations

source: Exponential, Square root, Power
fr: Exponentielle, Racine carrée, Puissance

source: Operations with a constant
fr: Opérations avec une constante

source: Processing
fr: Traitement

source: Axis Transformation
fr: Transformation des axes

source: Reverse X-axis
fr: Inverser l'axe X

source: Level Adjustment
fr: Ajustement du niveau

source: Offset correction
fr: Correction d'offset

source: Fourier analysis
fr: Analyse de Fourier

source: Power spectrum, Phase spectrum, Magnitude spectrum, Power spectral density
fr: Spectre de puissance, Spectre de phase, Spectre de magnitude, Densité spectrale de puissance

source: Frequency filters
fr: Filtres fréquentiels

source: Low-pass, High-pass, Band-pass, Band-stop
fr: Passe-bas, Passe-haut, Passe-bande, Coupure de bande

source: Windowing (Hanning, Hamming, Blackman, Blackman-Harris, Nuttall, Flat-top...)
fr: Fenêtrage (Hanning, Hamming, Blackman, Blackman-Harris, Nuttall, Flat-top...)

source: Fit
fr: Ajustement

source: Linear fit, Sinusoidal fit, Exponential fit, CDF fit
fr: Ajustement linéaire, Ajustement sinusoïdal, Ajustement exponentiel, Ajustement CDF

source: Analysis
fr: Analyse

source: FWHM (Zero-crossing method), X value @ min/max, Sampling period/frequency, Dynamic parameters (ENOB, SNR, SINAD, THD, SFDR), -3dB bandwidth, Contrast
fr: LMH (Méthode du zéro-crossing), Valeur X @ min/max, Période/fréquence d'échantillonnage, Paramètres dynamiques (ENOB, SNR, SINAD, THD, SFDR), Largeur de bande -3dB, Contraste

source: ℹ️ New **Image** operations, processing and analysis features:
fr: ℹ️ Nouvelles fonctionnalités de traitement des **Images** :

source: Exponential
fr: Exponentielle

source: Intensity profiles
fr: Profils d'intensité

source: Profile along a segment
fr: Profil le long d'un segment

source: Normalization, Clipping, Offset correction
fr: Normalisation, Recadrage, Correction d'offset

source: Thresholding
fr: Seuillage

source: Parametric, ISODATA, Li, Mean, Minimum, Otsu, Triangle, Yen
fr: Paramétrique, ISODATA, Li, Moyenne, Minimum, Otsu, Triangle, Yen

source: Fixed a performance issue due to an unnecessary refresh of the plot view when adding a new signal or image
fr: Correction d'un problème de performance dû à un rafraîchissement inutile de la vue du graphique lors de l'ajout d'un nouveau signal ou d'une nouvelle image

source: Fixed [Issue #77](https://github.com/DataLab-Platform/DataLab/issues/77) - Intensity profiles: unable to accept dialog the second time
fr: Correction de l'[Issue #77](https://github.com/DataLab-Platform/DataLab/issues/77) - Profils d'intensité : impossible d'accepter la boîte de dialogue la deuxième fois

source: Fixed [Issue #75](https://github.com/DataLab-Platform/DataLab/issues/75) - View in a new window: curve anti-aliasing is not enabled by default
fr: Correction de l'[Issue #75](https://github.com/DataLab-Platform/DataLab/issues/75) - Afficher dans une nouvelle fenêtre : l'anti-crénelage de la courbe n'est pas activé par défaut

source: Annotations visibility is now correctly saved and restored:
fr: La visibilité des annotations est désormais correctement sauvegardée et restaurée :

source: Before this release, when modifying the annotations visibility in the separate plot view, the visibility was not saved and restored when reopening the plot view
fr: Avant cette version, lorsque la visibilité des annotations était modifiée dans la vue du graphique séparée, elle n'était pas sauvegardée et restaurée lors de la réouverture de la vue du graphique

source: This has been [fixed upstream](https://github.com/PlotPyStack/PlotPy/commit/03faaa42e5d6d4016ea8c99334c29d46a5963467) in PlotPy (v2.3.3)
fr: Cela a été [corrigé en amont](https://github.com/PlotPyStack/PlotPy/commit/03faaa42e5d6d4016ea8c99334c29d46a5963467) dans PlotPy (v2.3.3)

source: Fixed [Issue #68](https://github.com/DataLab-Platform/DataLab/issues/68) - Slow loading of even simple plots:
fr: Correction de l'[Issue #68](https://github.com/DataLab-Platform/DataLab/issues/68) - Chargement lent même pour des graphiques simples :

source: On macOS, the user experience was degraded when handling even simple plots
fr: Sur macOS, l'expérience utilisateur était dégradée lors de la manipulation de graphiques simples

source: This was due to the way macOS handles the pop-up windows, e.g. when refreshing the plot view ("Creating plot items" progress bar), hence causing a very annoying flickering effect and a global slowdown of the application
fr: Cela était dû à la manière dont macOS gère les fenêtres contextuelles, par exemple lors du rafraîchissement de la vue du graphique (barre de progression "Création d'éléments de graphique"), provoquant ainsi un effet de scintillement très gênant et un ralentissement global de l'application

source: This is now fixed by showing the progress bar only after a short delay (1s), that is when it is really needed (i.e. for long operations)
fr: Le problème est maintenant résolu en affichant la barre de progression uniquement après un court délai (1s), c'est-à-dire lorsqu'elle est vraiment nécessaire (c'est-à-dire pour les opérations longues)

source: Thanks to [@marcel-goldschen-ohm](https://github.com/marcel-goldschen-ohm) for the very thorough feedback and the help in testing the fix
fr: Merci à [@marcel-goldschen-ohm](https://github.com/marcel-goldschen-ohm) pour la description très détaillée du problème et l'aide apportée pour tester la correction

source: Fixed [Issue #69](https://github.com/DataLab-Platform/DataLab/issues/69) - Annotations should be read-only in Signal/Image View
fr: Correction de l'[Issue #68](https://github.com/DataLab-Platform/DataLab/issues/69) - Les annotations devraient être en lecture seule dans la vue Signal/Image

source: Regarding the annotations, DataLab's current behavior is the following:
fr: En ce qui concerne les annotations, le comportement actuel de DataLab est le suivant :

source: Annotations are created only when showing the signal/image in a separate window (double-click on the object, or "View" > "View in a new window")
fr: Les annotations ne sont créées que lors de l'affichage du signal/image dans une fenêtre séparée (double-clic sur l'objet, ou "Affichage" > "Afficher dans une nouvelle fenêtre")

source: When displaying the objects in either the "Signal View" or the "Image View", the annotations should be read-only (i.e. not movable, nor resizable or deletable)
fr: Quand les objets sont affichés dans la "Vue Signal" ou la "Vue Image", les annotations devraient être en lecture seule (c'est-à-dire non déplaçables, ni redimensionnables ou supprimables)

source: However, some annotations were still deletable in the "Signal View" and the "Image View": this is now fixed
fr: Toutefois, certaines annotations étaient toujours supprimables dans la "Vue Signal" et la "Vue Image" : c'est maintenant corrigé

source: Note that the fact that annotations can't be created in the "Signal View" or the "Image View" is a limitation of the current implementation, and may be improved in future versions
fr: Notons que le fait que les annotations ne peuvent pas être créées dans la "Vue Signal" ou la "Vue Image" est une limitation de l'implémentation actuelle, et peut être amélioré dans les versions futures

source: 🎁 New installer for the stand-alone version on Windows:
fr: 🎁 Nouvel installeur pour la version autonome sur Windows :

source: The stand-alone version on Windows is now distributed as an MSI installer (instead of an EXE installer)
fr: La version autonome sur Windows est désormais distribuée en tant qu'installeur MSI (au lieu d'un installeur EXE)

source: This avoids the false positive detection of the stand-alone version as a potential threat by some antivirus software
fr: Cela évite la détection de faux positifs de la version autonome comme une menace potentielle par certains logiciels antivirus

source: The program will install files and shortcuts:
fr: Le programme installera des fichiers et des raccourcis :

source: For current user, if the user has no administrator privileges
fr: Pour l'utilisateur actuel, si l'utilisateur n'a pas de privilèges d'administrateur

source: For all users, if the user has administrator privileges
fr: Pour tous les utilisateurs, si l'utilisateur a des privilèges d'administrateur

source: Installation directory may be customized
fr: Le répertoire d'installation peut être personnalisé
