Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Before this release, when running computations on a circular ROI, the results were unexpected in terms of coordinates (results seemed to be computed in a region located above the actual ROI).
fr: Avant cette version, lors de l'exécution de calculs sur une ROI circulaire, les résultats étaient inattendus en termes de coordonnées (les résultats semblaient être calculés dans une région située au-dessus de la ROI réelle).

source: This was due to a regression introduced in an earlier release.
fr: Cela était dû à une régression introduite dans une version antérieure.

source: Now, when defining a circular ROI and running computations on it, the results are computed on the actual ROI
fr: A présent, lors de la définition d'une ROI circulaire et de l'exécution de calculs sur celle-ci, les résultats sont calculés sur la ROI réelle

source: This fixes [Issue #33](https://github.com/DataLab-Platform/DataLab/issues/33) - Analysis on circular ROI: unexpected results
fr: Ceci corrige l'[Issue #33](https://github.com/DataLab-Platform/DataLab/issues/33) - Analyse sur ROI circulaire : résultats inattendus

source: Contour detection on ROI:
fr: Détection des contours sur ROI :

source: Before this release, when running contour detection on a ROI, some contours were detected outside the ROI (it may be due to a limitation of the scikit-image `find_contours` function).
fr: Avant cette version, lors de l'exécution de la détection des contours sur une ROI, certains contours étaient détectés en dehors de la ROI (cela peut être dû à une limitation de la fonction `find_contours` de scikit-image).

source: Now, thanks a workaround, the erroneous contours are filtered out.
fr: A présent, grâce à une solution de contournement, les contours erronés sont filtrés.

source: A new test module `datalab.tests.features.images.contour_fabryperot_app` has been added to test the contour detection feature on a Fabry-Perot image (thanks to [@emarin2642](https://github.com/emarin2642) for the contribution)
fr: Un nouveau module de test `datalab.tests.features.images.contour_fabryperot_app` a été ajouté pour tester la fonctionnalité de détection des contours sur une image Fabry-Perot (merci à [@emarin2642](https://github.com/emarin2642) pour sa contribution)

source: This fixes [Issue #34](https://github.com/DataLab-Platform/DataLab/issues/34) - Contour detection: unexpected results outside ROI
fr: Ceci corrige l'[Issue #34](https://github.com/DataLab-Platform/DataLab/issues/34) - Détection des contours : résultats inattendus en dehors de la ROI

source: Analysis result merging:
fr: Fusion des résultats d'analyse :

source: Before this release, when doing a `1->N` computation (sum, average, product) on a group of signals/images, the analysis results associated to each signal/image were merged into a single result, but only the type of result present in the first signal/image was kept.
fr: Avant cette version, lors d'un calcul `1->N` (somme, moyenne, produit) sur un groupe de signaux/images, les résultats d'analyse associés à chaque signal/image étaient fusionnés en un seul résultat, mais seul le type de résultat présent dans le premier signal/image était conservé.

source: Now, the analysis results associated to each signal/image are merged into a single result, whatever the type of result is.
fr: A présent, les résultats d'analyse associés à chaque signal/image sont fusionnés en un seul résultat, quel que soit le type de résultat.

source: Fixed [Issue #36](https://github.com/DataLab-Platform/DataLab/issues/36) - "Delete all" action enable state is sometimes not refreshed
fr: Ceci corrige l'[Issue #36](https://github.com/DataLab-Platform/DataLab/issues/36) - L'état d'activation de l'action "Tout supprimer" n'est parfois pas rafraîchi

source: Image X/Y swap: when swapping X and Y axes, the regions of interest (ROI) were not removed and not swapped either (ROI are now removed, until we implement the swap feature, if requested)
fr: Inversion X/Y de l'image : lors de l'inversion des axes X et Y, les régions d'intérêt (ROI) n'étaient ni supprimées ni inversées (les ROI sont désormais supprimées, jusqu'à ce que nous implémentions la fonction d'inversion, si demandé)

source: "Properties" group box: the "Apply" button was enabled by default, even when no property was modified, which was confusing for the user (the "Apply" button is now disabled by default, and is enabled only when a property is modified)
fr: Groupe "Propriétés" : le bouton "Appliquer" était activé par défaut, même lorsqu'aucune propriété n'avait été modifiée, ce qui était déroutant pour l'utilisateur (le bouton "Appliquer" est désormais désactivé par défaut, et n'est activé que lorsqu'une propriété est modifiée)

source: Fixed proxy `get_object` method when there is no object to return (`None` is returned instead of an exception)
fr: Correction de la méthode `get_object` du proxy lorsqu'il n'y a pas d'objet à retourner (`None` est retourné au lieu d'une exception)

source: Fixed `IndexError: list index out of range` when performing some operations or computations on groups of signals/images (e.g. "ROI extraction", "Peak detection", "Resize", etc.)
fr: Correction de `IndexError: list index out of range` lors de certaines opérations ou calculs sur des groupes de signaux/images (par exemple "Extraction de ROI", "Détection de pics", "Redimensionnement", etc.)

source: Drag and drop from a file manager: filenames are now sorted alphabetically
fr: Glisser-déposer depuis un gestionnaire de fichiers : les noms de fichiers sont désormais triés par ordre alphabétique

source: *Note*: V0.10.0 was almost immediately replaced by V0.10.1 due to a last minute bug fix
fr: *Note* : la version 0.10.0 a été presque immédiatement remplacée par la version 0.10.1 en raison d'une correction de bogue de dernière minute

source: Features common to signals and images:
fr: Fonctionnalités communes aux signaux et aux images :

source: Added "Real part" and "Imaginary part" features to "Operation" menu
fr: Ajout des fonctionnalités "Partie réelle" et "Partie imaginaire" au menu "Opération"

source: Added "Convert data type" feature to "Operation" menu
fr: Ajout de la fonctionnalité "Convertir le type de données" au menu "Opération"

source: Features added following user requests (12/18/2023 meetup @ CEA):
fr: Fonctionnalités ajoutées suite aux demandes des utilisateurs (rencontre du 18/12/2023 au CEA) :

source: Curve and image styles are now saved in the HDF5 file:
fr: Les styles de courbe et d'image sont désormais enregistrés dans le fichier HDF5 :

source: Curve style covers the following properties: color, line style, line width, marker style, marker size, marker edge color, marker face color, etc.
fr: Le style de courbe couvre les propriétés suivantes : couleur, style de ligne, largeur de ligne, style de marqueur, taille de marqueur, couleur de bordure de marqueur, couleur de remplissage de marqueur, etc.

source: Image style covers the following properties: colormap, interpolation, etc.
fr: Le style d'image couvre les propriétés suivantes : colormap, interpolation, etc.

source: Those properties were already persistent during the working session, but were lost when saving and reloading the HDF5 file
fr: Ces propriétés étaient déjà persistantes pendant la session de travail, mais étaient perdues lors de l'enregistrement et du rechargement du fichier HDF5

source: Now, those properties are saved in the HDF5 file and are restored when reloading the HDF5 file
fr: Désormais, ces propriétés sont enregistrées dans le fichier HDF5 et sont restaurées lors du rechargement du fichier HDF5

source: New profile extraction features for images:
fr: Nouvelles fonctionnalités d'extraction de profil pour les images :

source: Added "Line profile" to "Operations" menu, to extract a profile from an image along a row or a column
fr: Ajout de la fonctionnalité "Profil rectiligne" au menu "Opérations", pour extraire un profil d'une image le long d'une ligne ou d'une colonne

source: Added "Average profile" to "Operations" menu, to extract the average profile on a rectangular area of an image, along a row or a column
fr: Ajout de la fonctionnalité "Profil moyen" au menu "Opérations", pour extraire le profil moyen sur une zone rectangulaire d'une image, le long d'une ligne ou d'une colonne

source: Image LUT range (contrast/brightness settings) is now saved in the HDF5 file:
fr: La plage LUT de l'image (paramètres de contraste/luminosité) est désormais enregistrée dans le fichier HDF5 :

source: As for curve and image styles, the LUT range was already persistent during the working session, but was lost when saving and reloading the HDF5 file
fr: Comme pour les styles de courbe et d'image, la plage LUT était déjà persistante pendant la session de travail, mais était perdue lors de l'enregistrement et du rechargement du fichier HDF5

source: Now, the LUT range is saved in the HDF5 file and is restored when reloading it
fr: Désormais, la plage LUT est enregistrée dans le fichier HDF5 et est restaurée lors du rechargement

source: Added "Auto-refresh" and "Refresh manually" actions in "View" menu (and main toolbar):
fr: Ajout des actions "Rafraîchissement automatique" et "Rafraîchissement manuel" dans le menu "Affichage" (et la barre d'outils principale) :

source: When "Auto-refresh" is enabled (default), the plot view is automatically refreshed when a signal/image is modified, added or removed. Even though the refresh is optimized, this may lead to performance issues when working with large datasets.
fr: Lorsque "Rafraîchissement automatique" est activé (par défaut), la vue du graphique est automatiquement rafraîchie lorsqu'un signal/image est modifié, ajouté ou supprimé. Même si le rafraîchissement est optimisé, cela peut entraîner des problèmes de performances lors de l'utilisation de grands ensembles de données.

source: When disabled, the plot view is not automatically refreshed. The user must manually refresh the plot view by clicking on the "Refresh manually" button in the main toolbar or by pressing the standard refresh key (e.g. "F5").
fr: Lorsqu'il est désactivé, la vue du graphique n'est pas automatiquement rafraîchie. L'utilisateur doit rafraîchir manuellement la vue du graphique en cliquant sur le bouton "Rafraîchir manuellement" de la barre d'outils principale ou en appuyant sur la touche de rafraîchissement standard (par exemple "F5").

source: Added `toggle_auto_refresh` method to DataLab proxy object:
fr: Ajout de la méthode `toggle_auto_refresh` à l'objet proxy de DataLab :

source: This method allows to toggle the "Auto-refresh" feature from a macro-command, a plugin or a remote control client.
fr: Cette méthode permet d'activer/désactiver la fonctionnalité "Rafraîchissement automatique" à partir d'une macro-commande, d'un plugin ou d'un client de contrôle à distance.

source: A context manager `context_no_refresh` is also available to temporarily disable the "Auto-refresh" feature from a macro-command, a plugin or a remote control client. Typical usage:
fr: Un gestionnaire de contexte `context_no_refresh` est également disponible pour désactiver temporairement la fonctionnalité "Rafraîchissement automatique" à partir d'une macro-commande, d'un plugin ou d'un client de contrôle à distance. Utilisation typique :

source: Improved curve readability:
fr: Amélioration de la lisibilité des courbes :

source: Until this release, the curve style was automatically set by cycling through **PlotPy** predefined styles
fr: Jusqu'à cette version, le style de la courbe était automatiquement défini en faisant défiler les styles prédéfinis de **PlotPy**

source: However, some styles are not suitable for curve readability (e.g. "cyan" and "yellow" colors are not readable on a white background, especially when combined with a "dashed" line style)
fr: Cependant, certains styles ne sont pas adaptés à la lisibilité des courbes (par exemple, les couleurs "cyan" et "jaune" ne sont pas lisibles sur un fond blanc, en particulier lorsqu'elles sont combinées avec un style de ligne "pointillée")

source: This release introduces a new curve style management with colors which are distinguishable and accessible, even to color vision deficiency people
fr: Cette version introduit une nouvelle gestion du style de courbe avec des couleurs qui sont distinguables et accessibles, même pour les personnes atteintes de déficience de la vision des couleurs

source: Added "Curve anti-aliasing" feature to "View" menu (and toolbar):
fr: Ajout de la fonctionnalité "Anti-aliasing de la courbe" au menu "Affichage" (et à la barre d'outils) :

source: This feature allows to enable/disable curve anti-aliasing (default: enabled)
fr: Cette fonctionnalité permet d'activer/désactiver l'anti-aliasing de la courbe (par défaut : activé)

source: When enabled, the curve rendering is smoother but may lead to performance issues when working with large datasets (that's why it can be disabled)
fr: Lorsqu'il est activé, le rendu de la courbe est plus lisse mais peut entraîner des problèmes de performances lors de l'utilisation de grands ensembles de données (c'est pourquoi il peut être désactivé)

source: Added `toggle_show_titles` method to DataLab proxy object. This method allows to toggle the "Show graphical object titles" feature from a macro-command, a plugin or a remote control client.
fr: Ajout de la méthode `toggle_show_titles` à l'objet proxy de DataLab. Cette méthode permet d'activer/désactiver la fonctionnalité "Afficher les titres des objets graphiques" à partir d'une macro-commande, d'un plugin ou d'un client de contrôle à distance.

source: Remote client is now checking the server version and shows a warning message if the server version may not be fully compatible with the client version.
fr: Le client distant vérifie désormais la version du serveur et affiche un message d'avertissement si la version du serveur n'est peut-être pas entièrement compatible avec la version du client.

source: Image contour detection feature ("Analysis" menu):
fr: Fonctionnalité de détection des contours de l'image (menu Analyseer") :

source: The contour detection feature was not taking into account the "shape" parameter (circle, ellipse, polygon) when computing the contours. The parameter was stored but really used only when calling the feature a second time.
fr: La fonctionnalité de détection des contours ne prenait pas en compte le paramètre "shape" (cercle, ellipse, polygone) lors du calcul des contours. Le paramètre était stocké mais vraiment utilisé uniquement lors de l'appel de la fonctionnalité une deuxième fois.

source: This unintentional behavior led to an `AssertionError` when choosing "polygon" as the contour shape and trying to compute the contours for the first time.
fr: Ce comportement involontaire a conduit à une `AssertionError` lors du choix de "polygone" comme forme de contour et de la tentative de calcul des contours pour la première fois.

source: This is now fixed (see [Issue #9](https://github.com/DataLab-Platform/DataLab/issues/9) - Image contour detection: `AssertionError` when choosing "polygon" as the contour shape)
fr: Ceci est maintenant corrigé (voir [Issue #9](https://github.com/DataLab-Platform/DataLab/issues/9) - Détection des contours de l'image : `AssertionError` lors du choix de "polygone" comme forme de contour)

source: Keyboard shortcuts:
fr: Raccourcis clavier :

source: The keyboard shortcuts for "New", "Open", "Save", "Duplicate", "Remove", "Delete all" and "Refresh manually" actions were not working properly.
fr: Les raccourcis clavier pour les actions "Nouveau", "Ouvrir", "Enregistrer", "Dupliquer", "Supprimer", "Tout supprimer" et "Rafraîchir manuellement" ne fonctionnaient pas correctement.

source: Those shortcuts were specific to each signal/image panel, and were working only when the panel on which the shortcut was pressed for the first time was active (when activated from another panel, the shortcut was not working and a warning message was displayed in the console, e.g. `QAction::event: Ambiguous shortcut overload: Ctrl+C`)
fr: Ces raccourcis étaient spécifiques à chaque panneau de signal/image et ne fonctionnaient que lorsque le panneau sur lequel le raccourci a été pressé pour la première fois était actif (lorsqu'il était activé à partir d'un autre panneau, le raccourci ne fonctionnait pas et un message d'avertissement était affiché dans la console, par exemple `QAction::event: Ambiguous shortcut overload: Ctrl+C`)

source: Besides, the shortcuts were not working at startup (when no panel had focus).
fr: De plus, les raccourcis ne fonctionnaient pas au démarrage (lorsqu'aucun panneau n'avait le focus).

source: This is now fixed: the shortcuts are now working whatever the active panel is, and even at startup (see [Issue #10](https://github.com/DataLab-Platform/DataLab/issues/10) - Keyboard shortcuts not working properly: `QAction::event: Ambiguous shortcut overload: Ctrl+C`)
fr: Ceci est maintenant corrigé : les raccourcis fonctionnent maintenant quel que soit le panneau actif, et même au démarrage (voir [Issue #10](https://github.com/DataLab-Platform/DataLab/issues/10) - Raccourcis clavier ne fonctionnant pas correctement : `QAction::event: Ambiguous shortcut overload: Ctrl+C`)

source: "Show graphical object titles" and "Auto-refresh" actions were not working properly:
fr: Les actions "Afficher les titres des objets graphiques" et "Rafraîchissement automatique" ne fonctionnaient pas correctement :

source: The "Show graphical object titles" and "Auto-refresh" actions were only working on the active signal/image panel, and not on all panels.
fr: Les actions "Afficher les titres des objets graphiques" et "Rafraîchissement automatique" ne fonctionnaient que sur le panneau de signal/image actif, et non sur tous les panneaux.

source: This is now fixed (see [Issue #11](https://github.com/DataLab-Platform/DataLab/issues/11) - "Show graphical object titles" and "Auto-refresh" actions were working only on current signal/image panel)
fr: Ceci est maintenant corrigé (voir [Issue #11](https://github.com/DataLab-Platform/DataLab/issues/11) - Les actions "Afficher les titres des objets graphiques" et "Rafraîchissement automatique" ne fonctionnaient que sur le panneau de signal/image actuel)

source: Fixed [Issue #14](https://github.com/DataLab-Platform/DataLab/issues/14) - Saving/Reopening HDF5 project without cleaning-up leads to `ValueError`
fr: Correction de l'[Issue #14](https://github.com/DataLab-Platform/DataLab/issues/14) - Enregistrer/Réouvrir le projet HDF5 sans nettoyage entraîne une `ValueError`

source: Fixed [Issue #15](https://github.com/DataLab-Platform/DataLab/issues/15) - MacOS: 1. `pip install datalab` error - 2. Missing menus:
fr: Correction de l'[Issue #15](https://github.com/DataLab-Platform/DataLab/issues/15) - MacOS : 1. Erreur `pip install datalab` - 2. Menus manquants :

source: Part 1: `pip install datalab` error on MacOS was actually an issue from **PlotPy** (see [this issue](https://github.com/PlotPyStack/PlotPy/issues/9)), and has been fixed in PlotPy v2.0.3 with an additional compilation flag indicating to use C++11 standard
fr: Partie 1 : l'erreur `pip install datalab` sur MacOS était en fait un problème de **PlotPy** (voir [ce problème]

source: Part 2: Missing menus on MacOS was due to a PyQt/MacOS bug regarding dynamic menus
fr: Partie 2 : les menus manquants sur MacOS étaient dus à un bogue PyQt/MacOS concernant les menus dynamiques

source: HDF5 file format: when importing an HDF5 dataset as a signal or an image, the dataset attributes were systematically copied to signal/image metadata: we now only copy the attributes which match standard data types (integers, floats, strings) to avoid errors when serializing/deserializing the signal/image object
fr: Format de fichier HDF5 : lors de l'importation d'un ensemble de données HDF5 en tant que signal ou image, les attributs de l'ensemble de données étaient systématiquement copiés dans les métadonnées du signal/image : nous ne copions désormais que les attributs qui correspondent aux types de données standard (entiers, flottants, chaînes de caractères) pour éviter les erreurs lors de la sérialisation/désérialisation de l'objet signal/image

source: Installation/configuration viewer: improved readability (removed syntax highlighting)
fr: Visualiseur d'installation/configuration : amélioration de la lisibilité (suppression de la coloration syntaxique)

source: PyInstaller specification file: added missing `skimage` data files manually in order to continue supporting Python 3.8 (see [Issue #12](https://github.com/DataLab-Platform/DataLab/issues/12) - Stand-alone version on Windows 7: missing `api-ms-win-core-path-l1-1-0.dll`)
fr: Fichier de spécification de PyInstaller : ajout manuel des fichiers de données `skimage` manquants afin de continuer à prendre en charge Python 3.8 (voir [Issue #12](https://github.com/DataLab-Platform/DataLab/issues/12) - Version autonome sur Windows 7 : `api-ms-win-core-path-l1-1-0.dll` manquant)

source: Fixed [Issue #13](https://github.com/DataLab-Platform/DataLab/issues/13) - ArchLinux: `qt.qpa.plugin: Could not load the Qt platform plugin "xcb" in "" even though it was found`
fr: Correction de l'[Issue #13](https://github.com/DataLab-Platform/DataLab/issues/13) - ArchLinux : `qt.qpa.plugin: Could not load the Qt platform plugin "xcb" in "" even though it was found`

source: Region of interest (ROI) extraction feature for images:
fr: Fonctionnalité d'extraction de la région d'intérêt (ROI) pour les images :

source: ROI extraction was not working properly when the "Extract all ROIs into a single image object" option was enabled if there was only one defined ROI. The result was an image positioned at the origin (0, 0) instead of the expected position (x0, y0) and the ROI rectangle itself was not removed as expected. This is now fixed (see [Issue #6](https://github.com/DataLab-Platform/DataLab/issues/6) - 'Extract multiple ROI' feature: unexpected result for a single ROI)
fr: L'extraction de la ROI ne fonctionnait pas correctement lorsque l'option "Extraire toutes les ROI dans un seul objet image" était activée s'il n'y avait qu'une seule ROI définie. Le résultat était une image positionnée à l'origine (0, 0) au lieu de la position attendue (x0, y0) et le rectangle de la ROI lui-même n'était pas supprimé comme prévu. Ceci est maintenant corrigé (voir [Issue #6](https://github.com/DataLab-Platform/DataLab/issues/6) - Fonctionnalité 'Extraire plusieurs ROI' : résultat inattendu pour une seule ROI)

source: ROI rectangles with negative coordinates were not properly handled: ROI extraction was raising a `ValueError` exception, and the image mask was not displayed properly. This is now fixed (see [Issue #7](https://github.com/DataLab-Platform/DataLab/issues/7) - Image ROI extraction: `ValueError: zero-size array to reduction operation minimum which has no identity`)
fr: Les rectangles ROI avec des coordonnées négatives n'étaient pas correctement gérés : l'extraction de la ROI levait une exception `ValueError`, et le masque de l'image n'était pas correctement affiché. Ceci est maintenant corrigé (voir [Issue #7](https://github.com/DataLab-Platform/DataLab/issues/7) - Extraction de la ROI de l'image : `ValueError: zero-size array to reduction operation minimum which has no identity`)
