Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Extension-based detection (fast): Used for file dialog filtering and standard workflows
fr: Détection basée sur l'extension (rapide) : Utilisée pour le filtrage des boîtes de dialogue de fichiers et les flux de travail standard

source: Content-based detection (thorough): Used for drag-and-drop operations to automatically detect HDF5 files with custom extensions
fr: Détection basée sur le contenu (approfondie) : Utilisée pour les opérations de glisser-déposer afin de détecter automatiquement les fichiers HDF5 avec des extensions personnalisées

source: Improved drag-and-drop support: Users can now drag and drop HDF5 files with any extension (e.g., `.data`, `.experiment`, `.custom`) and DataLab will automatically recognize them as HDF5 files if they contain valid HDF5 data
fr: Prise en charge améliorée du glisser-déposer : Les utilisateurs peuvent désormais glisser-déposer des fichiers HDF5 avec n'importe quelle extension (par exemple, `.data`, `.experiment`, `.custom`) et DataLab les reconnaîtra automatiquement comme des fichiers HDF5 s'ils contiennent des données HDF5 valides

source: Backward compatibility maintained: All existing functionality for standard HDF5 extensions continues to work exactly as before
fr: Compatibilité ascendante maintenue : Toutes les fonctionnalités existantes pour les extensions HDF5 standard continuent de fonctionner exactement comme avant

source: HDF5 Browser usability improvements:
fr: Améliorations de l'utilisabilité de l'explorateur HDF5 :

source: Changed default tree view state from fully expanded to collapsed for better navigation of large HDF5 files
fr: Changement de l'état par défaut de la vue en arbre de complètement développé à réduit pour une meilleure navigation dans les grands fichiers HDF5

source: When opening an HDF5 file, only the root node is expanded, keeping all groups and datasets collapsed by default
fr: Lors de l'ouverture d'un fichier HDF5, seul le nœud racine est développé, maintenant tous les groupes et ensembles de données réduits par défaut

source: Users can still expand specific nodes of interest, reducing visual clutter and improving performance
fr: Les utilisateurs peuvent toujours développer des nœuds spécifiques d'intérêt, réduisant l'encombrement visuel et améliorant les performances

source: This behavior matches the "Restore" action which collapses all nodes except the root level
fr: Ce comportement correspond à l'action "Restaurer" qui réduit tous les nœuds sauf le niveau racine

source: 🛠️ Bug fixes:
fr: 🛠️ Corrections de bugs :

source: **Improved responsiveness when switching between images with many analysis results**: Fixed performance issue when navigating between images that have hundreds of geometric shapes from contour detection or other analysis operations
fr: **Amélioration de la réactivité lors du changement entre des images avec de nombreux résultats d'analyse** : Correction d'un problème de performance lors de la navigation entre des images contenant des centaines de formes géométriques issues de la détection de contours ou d'autres opérations d'analyse

source: When switching away from an image with many analysis results (e.g., 710 detected contours), the application now responds immediately instead of freezing for over a minute
fr: Lors du changement d'une image avec de nombreux résultats d'analyse (par exemple, 710 contours détectés), l'application répond désormais immédiatement au lieu de se figer pendant plus d'une minute.

source: The responsiveness improvement is dramatic: operations that took 66 seconds now complete in under 1 millisecond
fr: L'amélioration de la réactivité est spectaculaire : les opérations qui prenaient 66 secondes se terminent désormais en moins d'une milliseconde.

source: Users can now work smoothly with images containing extensive analysis results without performance degradation
fr: Les utilisateurs peuvent désormais travailler sans problème avec des images contenant des résultats d'analyse étendus sans dégradation des performances.

source: This enhancement particularly benefits workflows involving blob detection, contour analysis, or peak detection that generate many geometric shapes
fr: Cette amélioration bénéficie particulièrement aux flux de travail impliquant la détection de blobs, l'analyse de contours ou la détection de pics qui génèrent de nombreuses formes géométriques.

source: **Cross-panel computation group handling**: Fixed inconsistent behavior when running cross-panel computations (image to signal) on groups of objects
fr: **Gestion des groupes de calcul inter-panneaux** : Correction d'un comportement incohérent lors de l'exécution de calculs inter-panneaux (image vers signal) sur des groupes d'objets

source: When applying operations like "Analysis > Histogram" or "Operations > Intensity profiles > Radial profile" to a group of images, results are now organized in a new signal group (as expected)
fr: Lors de l'application d'opérations telles que "Analyse > Histogramme" ou "Opérations > Profils d'intensité > Profil radial" à un groupe d'images, les résultats sont désormais organisés dans un nouveau groupe de signaux (comme prévu).

source: Previously, results were incorrectly added to the current signal group instead of creating a dedicated group
fr: Auparavant, les résultats étaient incorrectement ajoutés au groupe de signaux actuel au lieu de créer un groupe dédié.

source: This fix ensures consistent behavior between same-panel operations (e.g., signal → signal) and cross-panel operations (e.g., image → signal)
fr: Cette correction garantit un comportement cohérent entre les opérations dans le même panneau (par exemple, signal → signal) et les opérations inter-panneaux (par exemple, image → signal).

source: Group creation now works uniformly for all 1-to-1 processing patterns regardless of whether results are native or non-native objects
fr: La création de groupes fonctionne désormais de manière uniforme pour tous les modèles de traitement 1-à-1, qu'il s'agisse d'objets natifs ou non natifs.

source: **Action enable states not updated after operations**: Fixed issue where menu action states were not updated after performing annotation or metadata operations
fr: **Les états d'activation des actions ne sont pas mis à jour après les opérations** : Correction d'un problème où les états des actions de menu n'étaient pas mis à jour après l'exécution d'opérations d'annotation ou de métadonnées

source: After copying/pasting/deleting annotations or metadata, action states now refresh immediately
fr: Après la copie/le collage/la suppression d'annotations ou de métadonnées, les états des actions se rafraîchissent désormais immédiatement

source: Users no longer need to select another object to see correct action enabled/disabled states
fr: Les utilisateurs n'ont plus besoin de sélectionner un autre objet pour voir les états d'activation/désactivation des actions corrects

source: Examples: "Delete annotations" now disables immediately when annotations are deleted, "Paste annotations" enables immediately when annotations are copied
fr: Exemples : "Supprimer les annotations" se désactive désormais immédiatement lorsque les annotations sont supprimées, "Coller les annotations" s'active immédiatement lorsque les annotations sont copiées

source: Improves user experience by keeping UI state synchronized with actual object state
fr: Améliore l'expérience utilisateur en maintenant l'état de l'interface utilisateur synchronisé avec l'état réel de l'objet.

source: **File import ordering**: Fixed inconsistent file ordering across platforms when importing images/signals
fr: **Ordre d'importation des fichiers** : Correction de l'ordre incohérent des fichiers entre les plateformes lors de l'importation d'images/signaux

source: Files are now explicitly sorted alphabetically in all import methods (dialog, drag-and-drop, directory)
fr: **Les fichiers sont désormais explicitement triés par ordre alphabétique dans toutes les méthodes d'importation (dialogue, glisser-déposer, répertoire)**

source: Previously, the method used for opening files directly or opening whole directories returned files in filesystem-dependent order (sorted on Windows, arbitrary on Linux/WSL)
fr: Auparavant, la méthode utilisée pour ouvrir des fichiers directement ou ouvrir des répertoires entiers renvoyait les fichiers dans un ordre dépendant du système de fichiers (trié sous Windows, arbitraire sous Linux/WSL)

source: All import methods now use consistent lexicographic sorting for predictable, platform-independent behavior
fr: **Toutes les méthodes d'importation utilisent désormais un tri lexicographique cohérent pour un comportement prévisible et indépendant de la plateforme**

source: **Plot cleanup robustness**: Fixed occasional errors when removing analysis results from plots
fr: **Robustesse du nettoyage des graphiques** : Correction d'erreurs occasionnelles lors de la suppression des résultats d'analyse des graphiques

source: Analysis result labels and shapes are now removed more reliably without triggering internal errors
fr: Les étiquettes et formes des résultats d'analyse sont désormais supprimées de manière plus fiable sans déclencher d'erreurs internes

source: Improved handling of cases where plot items might be removed by multiple operations simultaneously
fr: Amélioration de la gestion des cas où les éléments de tracé pourraient être supprimés par plusieurs opérations simultanément

source: **Faster rendering of contour detection results**: Significantly improved performance when displaying images with contour detection results
fr: **Rendu plus rapide des résultats de détection de contours** : Amélioration significative des performances lors de l'affichage d'images avec des résultats de détection de contours

source: Drawing contour polygons is now over 5 times faster, especially beneficial when displaying many contours
fr: Le dessin de polygones de contours est désormais plus de 5 fois plus rapide, ce qui est particulièrement bénéfique lors de l'affichage de nombreux contours

source: Users will notice smoother interaction when working with contour detection on complex images
fr: Les utilisateurs remarqueront une interaction plus fluide lors de l'utilisation de la détection de contours sur des images complexes

source: Example: Drawing 50 contour polygons now takes 288ms instead of 1560ms
fr: Exemple : Le dessin de 50 polygones de contours prend désormais 288 ms au lieu de 1560 ms

source: **Critical fix**: Result label items are now properly excluded from cleanup to prevent accidental removal
fr: **Correction critique** : Les éléments d'étiquette de résultat sont désormais correctement exclus du nettoyage pour éviter une suppression accidentelle

source: Previously, cleanup was removing result labels from the plot, causing all analysis results to disappear when running a second analysis
fr: Auparavant, le nettoyage supprimait les étiquettes de résultat du graphique, provoquant la disparition de tous les résultats d'analyse lors de l'exécution d'une deuxième analyse

source: This prevents race conditions where `item.detach()` removes an item from the internal list before the explicit removal call
fr: Cela empêche les conditions de concurrence où `item.detach()` supprime un élément de la liste interne avant l'appel explicite de suppression

source: Removed "Use reference image LUT range" setting:
fr: Suppression de l'option "Utiliser la plage de LUT de l'image de référence" :

source: This feature has been removed to avoid confusion about whether LUT changes were temporary or persistent
fr: Cette fonctionnalité a été supprimée pour éviter toute confusion sur le fait que les modifications de LUT étaient temporaires ou persistantes

source: The feature made users think changes were view-only, but they were actually persistent modifications to image properties
fr: Cette fonctionnalité a amené les utilisateurs à penser que les modifications étaient uniquement visibles, mais il s'agissait en réalité de modifications persistantes des propriétés de l'image

source: **Migration strategy**: Use the new multi-selection property editing instead:
fr: **Stratégie de migration** : Utilisez plutôt le nouvel éditeur de propriétés de sélection multiple :

source: Select multiple images in the object list (Ctrl+click or Shift+click)
fr: Sélectionnez plusieurs images dans la liste des objets (Ctrl+clic ou Shift+clic)

source: Open the Properties panel
fr: Ouvrez le panneau des propriétés

source: Modify the LUT range (Z scale bounds) or other visualization properties
fr: Modifiez la plage de LUT (bornes de l'échelle Z) ou d'autres propriétés de visualisation

source: Click Apply to update all selected images simultaneously
fr: Cliquez sur Appliquer pour mettre à jour toutes les images sélectionnées simultanément

source: This approach is more explicit, more powerful (you choose which images to affect), and clearer about persistence
fr: Cette approche est plus explicite, plus puissante (vous choisissez quelles images affecter) et plus claire sur la persistance

source: The multi-selection feature allows synchronizing not just LUT ranges, but any image property across multiple objects
fr: La fonctionnalité de sélection multiple permet de synchroniser non seulement les plages de LUT, mais aussi n'importe quelle propriété d'image à travers plusieurs objets.

source: Fixed group numbering issue: When creating a new group via "Edit > New Group", the group short ID is now correctly numbered sequentially (e.g., g002) instead of being incorrectly numbered as g000
fr: Correction du problème de numérotation des groupes : Lors de la création d'un nouveau groupe via "Édition > Nouveau groupe", l'ID court du groupe est désormais correctement numéroté de manière séquentielle (par exemple, g002) au lieu d'être incorrectement numéroté comme g000

source: Plot interface improvements:
fr: Améliorations de la vue graphique :

source: Disabled PlotPy's generic "Axes" tab in parameter dialogs to prevent interference with DataLab's own axis scale management.
fr: Désactivation de l'onglet générique "Axes" de PlotPy dans les boîtes de dialogue des paramètres pour éviter les interférences avec la gestion propre des échelles d'axe de DataLab.

source: This provides a cleaner, more focused parameter dialog interface while maintaining DataLab's specialized axis handling capabilities.
fr: Cela fournit une interface de boîte de dialogue des paramètres plus propre et plus ciblée tout en maintenant les capacités de gestion des axes spécialisées de DataLab.

source: Fixed [Issue #233](https://github.com/DataLab-Platform/DataLab/issues/233) - Hard crash when trying to activate the curve stats tool on a zero signal
fr: Correction de l'[Issue #233](https://github.com/DataLab-Platform/DataLab/issues/233) - Plantage sévère lors de l'activation de l'outil de statistiques de courbe sur un signal nul

source: Fixed [Issue #184](https://github.com/DataLab-Platform/DataLab/issues/184) - Curve marker style unexpectedly changes to "Square" after validating "Parameters…" dialog
fr: Correction de l'[Issue #184](https://github.com/DataLab-Platform/DataLab/issues/184) - Le style du marqueur de courbe change de manière inattendue en "Carré" après validation de la boîte de dialogue "Paramètres…"

source: Fixed [Issue #117](https://github.com/DataLab-Platform/DataLab/issues/117) - DataLab's signal moving median crashes on Linux with `mode='mirror'`: `free(): invalid next size (normal)` (this is a bug in SciPy v1.15.0 to v1.15.2, which was fixed in SciPy v1.15.3)
fr: Correction de l'[Issue #117](https://github.com/DataLab-Platform/DataLab/issues/117) - Le filtre médian mobile de DataLab plante sur Linux avec `mode='mirror'` : `free(): invalid next size (normal)` (il s'agit d'un bug dans SciPy v1.15.0 à v1.15.2, qui a été corrigé dans SciPy v1.15.3)

source: Fixed [Issue #186](https://github.com/DataLab-Platform/DataLab/issues/186) - Image text files with a comma as decimal separator cannot be opened directly (only the Import Wizard does support this)
fr: Correction de l'[Issue #186](https://github.com/DataLab-Platform/DataLab/issues/186) - Les fichiers texte d'image avec une virgule comme séparateur décimal ne peuvent pas être ouverts directement (seul l'Assistant d'importation prend en charge cela)

source: Fixed [Issue #238](https://github.com/DataLab-Platform/DataLab/issues/238) - Image text files with a trailing delimiter leads to data with a superfluous column when opened directly (does not happen in the Import Wizard)
fr: Correction de l'[Issue #238](https://github.com/DataLab-Platform/DataLab/issues/238) - Les fichiers texte d'image avec un délimiteur final entraînent l'apparition d'une colonne superflue dans les données importées lorsqu'ils sont ouverts directement (ce qui ne se produit pas dans l'Assistant d'importation)

source: Fixed [Issue #239](https://github.com/DataLab-Platform/DataLab/issues/239) - Text Import Wizard does not preserve user-defined titles and units
fr: Correction de l'[Issue #239](https://github.com/DataLab-Platform/DataLab/issues/239) - L'Assistant d'importation de texte ne préserve pas les titres et unités définis par l'utilisateur

source: Fixed [Issue #240](https://github.com/DataLab-Platform/DataLab/issues/240) - Text Import Wizard does not preserve user-defined data type (e.g. `int16`, `float32`, etc.)
fr: Correction de l'[Issue #240](https://github.com/DataLab-Platform/DataLab/issues/240) - L'Assistant d'importation de texte ne préserve pas le type de données défini par l'utilisateur (par exemple, `int16`, `float32`, etc.)

source: Fixed [Issue #241](https://github.com/DataLab-Platform/DataLab/issues/241) - Erroneous ifft1d x-axis computation when shift=False
fr: Correction de [Issue #241](https://github.com/DataLab-Platform/DataLab/issues/241) - Calcul erroné de l'axe temporel dans ifft1d lorsque shift=False

source: Improved initial frequency estimate for sinusoidal curve fitting.
fr: Amélioration de l'estimation initiale de la fréquence pour l'ajustement de courbe sinusoïdale.

source: Fixed curve fitting parameter display: added default format string (`%g`) to all `FitParam` instances to ensure proper number formatting in fit dialog parameter fields, preventing display issues with very large or very small parameter values.
fr: Correction de l'affichage des paramètres de fitting de courbe : ajout d'une chaîne de format par défaut (`%g`) à toutes les instances `FitParam` pour garantir un formatage correct des nombres dans les champs de paramètres de la boîte de dialogue de fitting, évitant ainsi les problèmes d'affichage avec des valeurs de paramètres très grandes ou très petites.

source: Fixed [Issue #246](https://github.com/DataLab-Platform/DataLab/issues/246) - Incorrect shape unpacking in edit_new_image_parameters
fr: Correction de [Issue #246](https://github.com/DataLab-Platform/DataLab/issues/246) - Déballage incorrect de dimensiosn dans edit_new_image_parameters

source: Fixed [Issue #247](https://github.com/DataLab-Platform/DataLab/issues/247) - Incorrect unpacking of image shape in get_newparam_from_current
fr: Correction de [Issue #247](https://github.com/DataLab-Platform/DataLab/issues/247) - Déballage incorrect des dimensions de l'image dans get_newparam_from_current

source: Fixed aspect ratio not updating when switching between images with different pixel spacings: when selecting an image after viewing another with a different aspect ratio (e.g., dx=2.0), the plot now correctly updates to display the newly selected image's aspect ratio instead of retaining the previous value
fr: Correction du ratio d'aspect ne se mettant pas à jour lors du changement entre des images avec des espacements de pixels différents : lors de la sélection d'une image après en avoir visualisé une autre avec un ratio d'aspect différent (par exemple, dx=2.0), le graphique met désormais correctement à jour l'affichage du ratio d'aspect de l'image nouvellement sélectionnée au lieu de conserver la valeur précédente

source: 🔒 Security fixes:
fr: 🔒 Corrections de sécurité :

source: **Dependency vulnerability fix**: Fixed CVE-2023-4863 vulnerability in opencv-python-headless
fr: **Correction de vulnérabilité de dépendance** : Correction de la vulnérabilité CVE-2023-4863 dans opencv-python-headless

source: Updated minimum requirement from 4.5.4.60 to 4.8.1.78
fr: Mise à jour de l'exigence minimale de 4.5.4.60 à 4.8.1.78

source: Addresses libwebp binaries vulnerability in bundled OpenCV wheels
fr: Correction de la vulnérabilité des binaires libwebp dans les paquets Wheel OpenCV

source: See [DataLab security advisory](https://github.com/DataLab-Platform/DataLab/security/dependabot/1) for details
fr: Voir l'[avis de sécurité DataLab](https://github.com/DataLab-Platform/DataLab/security/dependabot/1) pour plus de détails.

source: ℹ️ Other changes:
fr: ℹ️ Autres changements :

source: Bumped minimum `plotpy` requirement to V2.8
fr: Dépendance `plotpy` mise à jour vers V2.8.0

source: Bumped minimum `guidata` requirement to V3.13
fr: Dépendance `guidata` mise à jour vers V3.13.0

source: Using new `guidata` translation utility based on `babel`
fr: Utilisation du nouvel utilitaire de traduction `guidata` basé sur `babel`

source: ANDOR SIF Images:
fr: Images ANDOR SIF :

source: Added support for background images in ANDOR SIF files
fr: Ajout de la prise en charge des images de fond dans les fichiers ANDOR SIF

source: This closes [Issue #178](https://github.com/DataLab-Platform/DataLab/issues/178) - Add support for ANDOR SIF files with background image
fr: Ceci clôture le ticket [Issue #178](https://github.com/DataLab-Platform/DataLab/issues/178) - Ajout de la prise en charge des fichiers ANDOR SIF avec image de fond

source: Array editor (results, signal and image data, ...):
fr: Éditeur de tableau (résultats, données de signal et d'image, ...)

source: New "Copy all" button in the array editor dialog box, to copy all the data in the clipboard, including row and column headers
fr: Nouvelle fonctionnalité "Copier tout" dans la boîte de dialogue de l'éditeur de tableau, pour copier toutes les données dans le presse-papiers, y compris les en-têtes de ligne et de colonne

source: New "Export" button in the array editor dialog box, to export the data in a CSV file, including row and column headers
fr: Nouvelle fonctionnalité "Exporter" dans la boîte de dialogue de l'éditeur de tableau, pour exporter les données dans un fichier CSV, y compris les en-têtes de ligne et de colonne

source: New "Paste" button in the array editor dialog box, to paste the data from the clipboard into the array editor (this feature is not available for read-only data, such as analysis results)
fr: Nouvelle fonctionnalité "Coller" dans la boîte de dialogue de l'éditeur de tableau, pour coller les données du presse-papiers dans l'éditeur de tableau (cette fonctionnalité n'est pas disponible pour les données en lecture seule, telles que les résultats d'analyse)

source: The features above require guidata v3.9.0 or later
fr: Les fonctionnalités ci-dessus nécessitent guidata v3.9.0 ou une version ultérieure

source: This closes [Issue #174](https://github.com/DataLab-Platform/DataLab/issues/174), [Issue #175](https://github.com/DataLab-Platform/DataLab/issues/175) and [Issue #176](https://github.com/DataLab-Platform/DataLab/issues/176)
fr: Ceci clôture les tickets [Issue #174](https://github.com/DataLab-Platform/DataLab/issues/174), [Issue #175](https://github.com/DataLab-Platform/DataLab/issues/175) et [Issue #176](https://github.com/DataLab-Platform/DataLab/issues/176)

source: Fourier analysis features ("Processing" menu):
fr: Fonctionnalités d'analyse de Fourier (menu "Traitement") :

source: New "Zero padding" feature
fr: Nouvelle fonctionnalité "Complément de zéros"
