Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Includes a separator and a "Delete all results..." option for bulk deletion
fr: Inclut un séparateur et une option "Supprimer tous les résultats..." pour la suppression en masse

source: When an individual result is selected for deletion, only that specific result is removed from the object
fr: Lorsqu'un résultat individuel est sélectionné pour suppression, seul ce résultat spécifique est supprimé de l'objet.

source: Provides more granular control over result management compared to deleting all results at once
fr: Offre un contrôle plus granulaire sur la gestion des résultats par rapport à la suppression de tous les résultats en une seule fois.

source: Useful for removing outdated or incorrect analysis results while keeping others
fr: Utile pour supprimer des résultats d'analyse obsolètes ou incorrects tout en conservant les autres.

source: **Fixed**: Result deletion now properly removes all associated metadata including parameter metadata (`__param_str` and `__param_html` entries)
fr: **Correction** : La suppression des résultats supprime désormais correctement toutes les métadonnées associées, y compris les métadonnées de paramètres (entrées `__param_str` et `__param_html`)

source: Internal console status indicator added to the status bar:
fr: Indicateur d'état de la console interne ajouté à la barre d'état :

source: The status bar now features an indicator for the internal console, visible only when the console is hidden.
fr: La barre d'état dispose désormais d'un indicateur pour la console interne, visible uniquement lorsque la console est masquée.

source: Clicking the indicator opens the internal console.
fr: Cliquer sur l'indicateur ouvre la console interne.

source: The icon turns red if an error or warning is logged, alerting the user to check the console.
fr: L'icône devient rouge si une erreur ou un avertissement est enregistré, alertant l'utilisateur à vérifier la console.

source: Configuration folder versioning for major version coexistence:
fr: Versionnage des dossiers de configuration pour la coexistence des versions majeures :

source: Configuration folders are now versioned by major version to allow different major versions to coexist on the same machine without interfering with each other.
fr: Les dossiers de configuration sont désormais versionnés par version majeure pour permettre à différentes versions majeures de coexister sur la même machine sans interférer les unes avec les autres.

source: Configuration folder naming:
fr: Nommage des dossiers de configuration :

source: v0.x: `.DataLab` (unchanged for backward compatibility)
fr: v0.x : `.DataLab` (inchangé pour la compatibilité ascendante)

source: v1.x: `.DataLab_v1` (new)
fr: v1.x : `.DataLab_v1` (nouveau)

source: v2.x: `.DataLab_v2` (future)
fr: v2.x : `.DataLab_v2` (futur)

source: This enables users to run both v0.20 and v1.0 simultaneously during the migration period, which is particularly useful for plugin developers who need to test their code against both versions.
fr: Cela permet aux utilisateurs d'exécuter à la fois v0.20 et v1.0 simultanément pendant la période de migration, ce qui est particulièrement utile pour les développeurs de plugins qui doivent tester leur code contre les deux versions.

source: Each version maintains its own isolated configuration, plugins directory, and settings, preventing any conflicts or data loss.
fr: Chaque version maintient sa propre configuration isolée, son répertoire de plugins et ses paramètres, empêchant tout conflit ou perte de données.

source: New common signal/image features:
fr: Nouvelles fonctionnalités communes aux signaux et aux images :

source: Added two options for signal and image creation:
fr: Ajout de deux options pour la création de signaux et d'images :

source: "Use xmin and xmax bounds from current signal when creating a new signal" (default: disabled)
fr: "Utiliser les bornes du signal pour les nouveaux signaux" (par défaut : désactivé)

source: "Use dimensions from current image when creating a new image" (default: enabled)
fr: "Utiliser les dimensions de l'image pour les nouvelles images" (par défaut : activé)

source: If enabled, the new signal/image will use the xmin/xmax bounds or dimensions of the current signal/image, if any
fr: Si activé, le nouveau signal/image utilisera les bornes xmin/xmax ou les dimensions du signal/image actuel, le cas échéant.

source: **Add metadata**: New feature to add custom metadata items to selected signals or images
fr: **Ajouter des métadonnées** : Nouvelle fonctionnalité pour ajouter des éléments de métadonnées personnalisés aux signaux ou images sélectionnés

source: Accessible via Edit menu → "Add metadata..."
fr: Accessible via le menu Édition → "Ajouter des métadonnées..."

source: Allows adding a metadata key-value pair to one or multiple selected objects
fr: Permet d'ajouter une paire clé-valeur de métadonnées à un ou plusieurs objets sélectionnés.

source: Value pattern supports Python format strings with placeholders: `{title}`, `{index}`, `{count}`, `{xlabel}`, `{xunit}`, `{ylabel}`, `{yunit}`, `{metadata[key]}`
fr: Le modèle de valeur prend en charge les chaînes de format Python avec des espaces réservés : `{title}`, `{index}`, `{count}`, `{xlabel}`, `{xunit}`, `{ylabel}`, `{yunit}`, `{metadata[key]}`

source: Supports uppercase/lowercase modifiers (e.g., `{title:upper}`, `{title:lower}`)
fr: Prend en charge les modificateurs de casse (par exemple, `{title:upper}`, `{title:lower}`)

source: Automatic type conversion: string, float, integer, or boolean
fr: Conversion de type automatique : chaîne, flottant, entier ou booléen

source: Real-time preview showing how values will be set for each object
fr: Aperçu en temps réel montrant comment les valeurs seront définies pour chaque objet

source: Useful for tagging objects with experiment IDs, sample names, processing steps, etc.
fr: Utile pour étiqueter les objets avec des identifiants d'expérience, des noms d'échantillons, des étapes de traitement, etc.

source: Integrates seamlessly with existing metadata operations (copy, paste, import, export)
fr: S'intègre parfaitement aux opérations de métadonnées existantes (copier, coller, importer, exporter)

source: Added `phase` (argument) feature to extract the phase information from complex signals or images.
fr: Ajout de la fonctionnalité `phase` (argument) pour extraire les informations de phase des signaux ou des images complexes.

source: This complements the "Absolute value" (modulus) feature.
fr: Ceci complète la fonctionnalité "Valeur absolue" (module).

source: Added operation to create complex-valued signal/image from real and imaginary parts.
fr: Ajout de l'opération pour créer un signal/image à valeurs complexes à partir des parties réelle et imaginaire.

source: Added operation to create complex-valued signal/image from magnitude and phase (this closes [Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216)).
fr: Ajout de l'opération pour créer un signal/image à valeurs complexes à partir de la magnitude et de la phase (ceci clôture [Issue #216](https://github.com/DataLab-Platform/DataLab/issues/216)).

source: Standard deviation of the selected signals or images (this closes [Issue #196](https://github.com/DataLab-Platform/DataLab/issues/196)):
fr: Écart-type des signaux ou des images sélectionnés (ceci clôture [Issue #196](https://github.com/DataLab-Platform/DataLab/issues/196)).

source: The standard deviation is calculated across the selected signals or images.
fr: L'écart-type est calculé à travers les signaux ou les images sélectionnés.

source: This is a complement to the "Average" feature.
fr: Ceci complète la fonctionnalité "Moyenne".

source: Generate new signal or image: Poisson noise.
fr: Générer un nouveau signal ou une nouvelle image : bruit de Poisson.

source: Add noise to the selected signals or images (this closes [Issue #201](https://github.com/DataLab-Platform/DataLab/issues/201)): Gaussian, Poisson or uniform noise can be added.
fr: Ajout de bruit aux signaux ou images sélectionnés (ceci clôture [Issue #201](https://github.com/DataLab-Platform/DataLab/issues/201)) : du bruit gaussien, de Poisson ou uniforme peut être ajouté.

source: Save to directory feature (this closes [Issue #227](https://github.com/DataLab-Platform/DataLab/issues/227)).
fr: Fonctionnalité d'enregistrement dans un répertoire (ceci clôture le ticket [Issue #227](https://github.com/DataLab-Platform/DataLab/issues/227)).

source: Deconvolution in the frequency domain (this closes [Issue #189](https://github.com/DataLab-Platform/DataLab/issues/189)).
fr: Déconvolution dans le domaine fréquentiel (ceci clôture [Issue #189](https://github.com/DataLab-Platform/DataLab/issues/189)).

source: Signals to image conversion:
fr: Conversion de signaux en images :

source: Convert collections of signals into 2D images for visualization
fr: Convertit des collections de signaux en images 2D pour la visualisation

source: Select multiple signals and use "Combine signals into image" operation
fr: Sélectionnez plusieurs signaux et utilisez l'opération "Combiner les signaux en image"

source: Two orientation modes:
fr: Deux modes d'orientation :

source: As rows: Each signal becomes a row in the resulting image (useful for spectrograms)
fr: Comme des lignes : Chaque signal devient une ligne dans l'image résultante (utile pour les spectrogrammes)

source: As columns: Each signal becomes a column in the resulting image (useful for waterfall displays)
fr: Comme des colonnes : Chaque signal devient une colonne dans l'image résultante (utile pour les affichages en cascade)

source: Optional normalization:
fr: Normalisation optionnelle :

source: Normalize signals before combining using Z-score, Min-Max, or Maximum methods
fr: Normaliser les signaux avant de les combiner en utilisant les méthodes Z-score, Min-Max ou Maximum

source: Normalizes each signal independently to handle different amplitude ranges
fr: Normalise chaque signal indépendamment pour gérer différentes plages d'amplitude

source: Enables better visualization of signals with varying scales
fr: Permet une meilleure visualisation des signaux avec des échelles variables

source: Validates signal compatibility (all must have same size)
fr: Valide la compatibilité des signaux (tous doivent avoir la même taille)

source: Resulting image automatically appears in Image panel with appropriate dimensions
fr: L'image résultante apparaît automatiquement dans le panneau Image avec des dimensions appropriées

source: Supports cross-panel operations: Images created from signals are properly routed to Image panel
fr: Prend en charge les opérations inter-panneaux : les images créées à partir de signaux sont correctement acheminées vers le panneau Image

source: Group handling: Results maintain group organization when working with signal groups
fr: Gestion de groupe : les résultats conservent l'organisation du groupe lors du travail avec des groupes de signaux

source: Typical use cases:
fr: Cas d'utilisation typiques :

source: Creating heatmaps from time-series data
fr: Créer des cartes thermiques à partir de données de séries temporelles

source: Building spectrograms from frequency domain signals
fr: Construire des spectrogrammes à partir de signaux dans le domaine fréquentiel

source: Generating waterfall displays for multi-channel data
fr: Générer des affichages en cascade pour des données multicanaux

source: Visualizing signal evolution over time or parameter sweeps
fr: Visualiser l'évolution du signal au fil du temps ou des balayages de paramètres

source: New ROI (Region of Interest) management features:
fr: Nouvelles fonctionnalités de gestion des ROI (Région d'Intérêt) :

source: New "ROI" menu, between "Edit" and "Operations" menus.
fr: Nouveau menu "ROI", entre les menus "Édition" et "Opérations".

source: This menu provides quick access to ROI creation, editing, and deletion tools.
fr: Ce menu fournit un accès rapide aux outils de création, de modification et de suppression des ROI.

source: New features have also been added to the "ROI" menu:
fr: De nouvelles fonctionnalités ont également été ajoutées au menu "ROI" :

source: "Create ROI grid": for images, see below.
fr: "Créer une grille de ROI" : pour les images, voir ci-dessous.

source: "Copy": copies the selected ROI to the clipboard.
fr: "Copier": copie la ROI sélectionnée dans le presse-papiers.

source: "Paste": pastes the ROI from the clipboard to the selected object (signal or image).
fr: "Coller": colle la ROI du presse-papiers dans l'objet sélectionné (signal ou image).

source: "Export": exports the selected ROI to a file (JSON format).
fr: "Exporter": exporte la ROI sélectionnée vers un fichier (format JSON).

source: "Import": imports a ROI from a file (JSON format).
fr: "Importer": importe une ROI depuis un fichier (format JSON).

source: Individual ROI removal: new sub-menu "Remove" in the "ROI" menu, to remove ROIs individually instead of removing all ROIs at once.
fr: Suppression individuelle des ROI : nouveau sous-menu "Supprimer" dans le menu "ROI", pour supprimer les ROI individuellement au lieu de supprimer tous les ROI en même temps.

source: ROI editor now supports setting the ROI title:
fr: L'éditeur de ROI prend désormais en charge la définition du titre de la ROI :

source: When adding ROIs interactively, the user can now set a title from the object list on the right side of the ROI editor.
fr: Lors de l'ajout de ROI de manière interactive, l'utilisateur peut désormais définir un titre à partir de la liste des objets sur le côté droit de l'éditeur de ROI.

source: After validating the dialog, each ROI title may also be edited in the confirmation dialog.
fr: Après avoir validé la boîte de dialogue, le titre de chaque ROI peut également être modifié dans la boîte de dialogue de confirmation.

source: New "Create ROI grid" feature:
fr: Nouvelle fonctionnalité "Créer une grille de ROI" :

source: This feature allows to create a grid of ROIs over an image.
fr: Cette fonctionnalité permet de créer une grille de ROI sur une image.

source: The grid is defined using a dialog that allows the user to:
fr: La grille est définie à l'aide d'une boîte de dialogue qui permet à l'utilisateur de :

source: Specify the number of rows and columns, as well as the spacing between the ROIs.
fr: Spécifier le nombre de lignes et de colonnes, ainsi que l'espacement entre les ROI.

source: Import/export ROI grids to/from files (JSON format).
fr: Importer/Exporter des grilles de ROI vers/depuis des fichiers (format JSON).

source: Preview the ROI grid before creating it.
fr: Prévisualiser la grille de ROI avant de la créer.

source: New "Inverse ROI logic" option for image ROIs:
fr: Nouvelle option "Inverser la logique de la ROI" pour les ROI d'image :

source: Added support for inverse region selection in image ROIs (rectangles, circles, polygons).
fr: Prise en charge de la sélection de région inversée dans les ROI d'image (rectangles, cercles, polygones).

source: When enabled, the ROI represents the area outside the defined shape instead of inside.
fr: Lorsqu'elle est activée, la ROI représente la zone en dehors de la forme définie au lieu de l'intérieur.

source: Available in the ROI editor dialog for all image ROI types.
fr: Disponible dans la boîte de dialogue de l'éditeur de ROI pour tous les types de ROI d'image.

source: Allows for more flexible region-based analysis and processing operations.
fr: Permet des opérations d'analyse et de traitement basées sur des régions plus flexibles.

source: Signal ROIs remain unaffected as the inverse concept applies only to 2D regions
fr: Les ROI de signal restent inchangés car le concept inverse ne s'applique qu'aux régions 2D.

source: New image operation, processing and analysis features:
fr: ℹ️ Nouvelles fonctionnalités de traitement des **Images** :

source: **Enhanced profile extraction dialog**: Improved user interface for extracting line and average profiles
fr: **Boîte de dialogue d'extraction de profil améliorée** : Interface utilisateur améliorée pour l'extraction de profils linéaires et moyens

source: Click directly on the X-profile plot (bottom) to switch to horizontal profile extraction
fr: Cliquez directement sur le graphique du profil X (en bas) pour passer à l'extraction du profil horizontal

source: Click directly on the Y-profile plot (right) to switch to vertical profile extraction
fr: Cliquez directement sur le graphique du profil Y (à droite) pour passer à l'extraction du profil vertical

source: Direction switching is intuitive and immediate - no need to open parameters dialog
fr: Le changement de direction est intuitif et immédiat - pas besoin d'ouvrir la boîte de dialogue des paramètres

source: Mouse clicks on profile plots no longer select the curve, avoiding visual clutter
fr: Les clics de souris sur les tracés de profil ne sélectionnent plus la courbe, évitant ainsi l'encombrement visuel.

source: Works for both "Line profile" and "Average profile" extraction modes
fr: Fonctionne pour les modes d'extraction de profil "Profil rectiligne" et "Profil moyen"

source: Existing "Edit profile parameters" button still available for precise parameter control
fr: Le bouton "Modifier les paramètres du profil" est toujours disponible pour un contrôle précis des paramètres

source: Significantly improves workflow when comparing horizontal and vertical profiles
fr: Améliore considérablement le flux de travail lors de la comparaison des profils horizontal et vertical

source: This closes [Issue #156](https://github.com/DataLab-Platform/DataLab/issues/156) - Image/Average profile: click directly on vertical/horizontal plot to select the profile
fr: Ceci clôture [Issue #156](https://github.com/DataLab-Platform/DataLab/issues/156) - Image/Average profile : cliquez directement sur le tracé vertical/horizontal pour sélectionner le profil

source: New 2D ramp image generator.
fr: Nouveau générateur d'image de type rampe 2D.

source: This closes [Issue #203](https://github.com/DataLab-Platform/DataLab/issues/203).
fr: Ceci clôture [Issue #203](https://github.com/DataLab-Platform/DataLab/issues/203).

source: New "2D resampling" feature:
fr: Nouvelle fonctionnalité "Rééchantillonnage 2D"

source: This feature allows to resample 2D images to a new coordinate grid using interpolation.
fr: Cette fonctionnalité permet de rééchantillonner des images 2D sur une nouvelle grille de coordonnées en utilisant l'interpolation.

source: It supports two resampling modes: pixel size and output shape.
fr: Elle prend en charge deux modes de rééchantillonnage : la taille des pixels et la taille de l'image de sortie.

source: Multiple interpolation methods are available: linear, cubic, and nearest neighbor.
fr: Plusieurs méthodes d'interpolation sont disponibles : linéaire, cubique et plus proche voisin.

source: The fill value parameter controls how out-of-bounds pixels are handled, with support for numeric values or NaN.
fr: Le paramètre de valeur de remplissage contrôle la façon dont les pixels hors limites sont traités, avec prise en charge des valeurs numériques ou de NaN.

source: It is implemented in the `sigima.proc.image.resampling` function.
fr: Elle est implémentée dans la fonction `sigima.proc.image.resampling`.

source: This adds comprehensive 2D resampling capabilities to complement existing geometric transformation features.
fr: Cela ajoute des capacités de rééchantillonnage 2D complètes pour compléter les fonctionnalités de transformation géométrique existantes.

source: This closes [Issue #208](https://github.com/DataLab-Platform/DataLab/issues/208) - Add support for image resampling.
fr: Ceci clôture [Issue #208](https://github.com/DataLab-Platform/DataLab/issues/208) - Ajout de la prise en charge du rééchantillonnage d'images.

source: New "Frequency domain Gaussian filter" feature:
fr: Nouvelle fonctionnalité "Filtre gaussien dans le domaine fréquentiel"

source: This feature allows to filter an image in the frequency domain using a Gaussian filter.
fr: Cette fonctionnalité permet de filtrer une image dans le domaine fréquentiel en utilisant un filtre gaussien.

source: It is implemented in the `sigima.proc.image.frequency_domain_gaussian_filter` function.
fr: Elle est implémentée dans la fonction `sigima.proc.image.frequency_domain_gaussian_filter`.

source: This closes [Issue #205](https://github.com/DataLab-Platform/DataLab/issues/205) - Add Gaussian frequency filter for images.
fr: Ceci clôture [Issue #205](https://github.com/DataLab-Platform/DataLab/issues/205) - Ajout du filtre de fréquence gaussien pour les images.

source: New "Erase area" feature:
fr: Nouvelle fonctionnalité "Gommer une zone" :

source: This feature allows to erase an area in an image as defined by a region of interest
fr: Cette fonctionnalité permet d'effacer une zone d'une image telle que définie par une région d'intérêt

source: It is implemented in the `sigima.proc.image.erase` function
fr: Elle est implémentée dans la fonction `sigima.proc.image.erase`

source: This closes [Issue #204](https://github.com/DataLab-Platform/DataLab/issues/204) - Add support for background subtraction and inpainting on ROI
fr: Ceci clôture le ticket [Issue #204](https://github.com/DataLab-Platform/DataLab/issues/204) - Ajout de la prise en charge de la soustraction d'arrière-plan et de l'inpainting sur la ROI

source: Improved centroid computation:
fr: Amélioration du calcul du barycentre :

source: Centroid estimation is now more accurate and reliable, especially in challenging cases like truncated or asymmetric images
fr: L'estimation du barycentre est désormais plus précise et fiable, en particulier dans les cas difficiles tels que les images tronquées ou asymétriques.

source: The barycenter tool now automatically selects the best estimation method for better results
fr: L'outil de calcul du barycentre sélectionne désormais automatiquement la meilleure méthode d'estimation pour de meilleurs résultats.

source: Interactive centroid display during shape editing is now faster and more responsive
fr: L'affichage interactif du barycentre lors de l'édition de forme est désormais plus rapide et plus réactif.

source: See [Issue #251](https://github.com/DataLab-Platform/DataLab/issues/251) - Inaccurate centroid estimation in edge cases
fr: Voir [Issue #251](https://github.com/DataLab-Platform/DataLab/issues/251) - Estimation inexacte du barycentre dans les cas limites

source: Horizontal and vertical projections.
fr: Projections horizontale et verticale.

source: This closes [Issue #209](https://github.com/DataLab-Platform/DataLab/issues/209) - Parameters / Sum of pixels, sum of pixel rows, sum of pixel columns.
fr: Ceci clôture [Issue #209](https://github.com/DataLab-Platform/DataLab/issues/209) - Paramètres / Somme des pixels, somme des lignes de pixels, somme des colonnes de pixels.

source: New signal operation, processing and analysis features:
fr: ℹ️ Nouvelles fonctionnalités de traitement des **Signaux** :

source: New signal generators: linear chirp, logistic function, Planck function.
fr: Nouveaux générateurs de signaux: chirp linéaire, fonction logistique, fonction de Planck.

source: This closes [Issue #213](https://github.com/DataLab-Platform/DataLab/issues/213).
fr: Ceci clôture [Issue #203](https://github.com/DataLab-Platform/DataLab/issues/213).

source: **X-array compatibility checking for multi-signal computations**:
fr: **Vérification de la compatibilité des tableaux X pour les calculs multi-signaux** :

source: Added comprehensive x-array compatibility validation for all signal operations that take multiple signals as input (N>1 signals).
fr: Ajout d'une validation complète de la compatibilité des tableaux x pour toutes les opérations de signal qui prennent plusieurs signaux en entrée (N>1 signaux).
