Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Parameters are still directly editable by the user ("Edit profile parameters" button)
fr: Les paramètres sont toujours directement modifiables par l'utilisateur (bouton "Modifier les paramètres du profil")

source: Parameters are now stored from one profile extraction to another
fr: Les paramètres sont désormais stockés d'une extraction de profil à l'autre

source: Statistics feature:
fr: Fonctionnalité de statistiques :

source: Added `<y>/σ(y)` to the signal "Statistics" result table (in addition to the mean, median, standard deviation, etc.)
fr: Ajout de `<y>/σ(y)` au tableau de résultats "Statistiques" du signal (en plus de la moyenne, de la médiane, de l'écart-type, etc.)

source: Added `peak-to-peak` to the signal and image "Statistics" result table
fr: Ajout de `peak-to-peak` au tableau de résultats "Statistiques" du signal et de l'image

source: Curve fitting feature: fit results are now stored in a dictionary in the signal metadata (instead of being stored individually in the signal metadata)
fr: Fonctionnalité d'ajustement de courbe : les résultats de l'ajustement sont désormais stockés dans un dictionnaire dans les métadonnées du signal (au lieu d'être stockés individuellement dans les métadonnées du signal)

source: Window state:
fr: État de la fenêtre :

source: The toolbars and dock widgets state (visibility, position, etc.) are now stored in the configuration file and restored at startup (size and position were already stored and restored)
fr: L'état des barres d'outils et des widgets de dock (visibilité, position, etc.) est désormais stocké dans le fichier de configuration et restauré au démarrage (la taille et la position étaient déjà stockées et restaurées)

source: This implements part of [Issue #30](https://github.com/DataLab-Platform/DataLab/issues/30) - Save/restore main window layout
fr: Ceci implémente une partie de [Issue #30](https://github.com/DataLab-Platform/DataLab/issues/30) - Sauvegarder/restaurer la disposition de la fenêtre principale

source: Fixed [Issue #41](https://github.com/DataLab-Platform/DataLab/issues/41) - Radial profile extraction: unable to enter user-defined center coordinates
fr: Correction de l'[Issue #41](https://github.com/DataLab-Platform/DataLab/issues/41) - Extraction du profil radial : impossible d'entrer les coordonnées du centre définies par l'utilisateur

source: Fixed [Issue #49](https://github.com/DataLab-Platform/DataLab/issues/49) - Error when trying to open a (UTF-8 BOM) text file as an image
fr: Correction de l'[Issue #49](https://github.com/DataLab-Platform/DataLab/issues/49) - Erreur lors de l'ouverture d'un fichier texte (UTF-8 BOM) en tant qu'image

source: Fixed [Issue #51](https://github.com/DataLab-Platform/DataLab/issues/51) - Unexpected dimensions when adding new ROI on an image with X/Y arbitrary units (not pixels)
fr: Correction de l'[Issue #51](https://github.com/DataLab-Platform/DataLab/issues/51) - Dimensions inattendues lors de l'ajout d'une nouvelle ROI sur une image avec des unités X/Y arbitraires (pas des pixels)

source: Improved plot item style serialization management:
fr: Amélioration de la gestion de la sérialisation du style des items graphiques :

source: Before this release, the plot item style was stored in the signal/image metadata only when saving the workspace to an HDF5 file. So, when modifying the style of a signal/image from the "Parameters" button (view toolbar), the style was not kept in some cases (e.g. when duplicating the signal/image).
fr: Avant cette version, le style des items graphiques était stocké dans les métadonnées du signal/image uniquement lors de la sauvegarde de l'espace de travail dans un fichier HDF5. Ainsi, lors de la modification du style d'un signal/image à partir du bouton "Paramètres" (barre d'outils de la vue), le style n'était pas conservé dans certains cas (par exemple lors de la duplication du signal/image).

source: Now, the plot item style is stored in the signal/image metadata whenever the style is modified, and is restored when reloading the workspace
fr: A présent, le style des items graphiques est stocké dans les métadonnées du signal/image chaque fois que le style est modifié, et est restauré lors du rechargement de l'espace de travail

source: Handled `ComplexWarning` cast warning when adding regions of interest (ROI) to a signal with complex data
fr: Traitement de l'avertissement de conversion `ComplexWarning` lors de l'ajout de régions d'intérêt (ROI) à un signal avec des données complexes

source: Signals and images may now be reordered in the tree view:
fr: Les signaux et les images peuvent maintenant être réorganisés dans la vue arborescente :

source: Using the new "Move up" and "Move down" actions in the "Edit" menu (or using the corresponding toolbar buttons):
fr: En utilisant les nouvelles actions "Monter" et "Descendre" dans le menu "Édition" (ou en utilisant les boutons de la barre d'outils correspondants) :

source: This fixes [Issue #22](https://github.com/DataLab-Platform/DataLab/issues/22) - Add "move up/down" actions in "Edit" menu, for signals/images and groups
fr: Ceci corrige l'[Issue #22](https://github.com/DataLab-Platform/DataLab/issues/22) - Ajout des actions "monter/descendre" dans le menu "Édition", pour les signaux/images et les groupes

source: Signals and images may also be reordered using drag and drop:
fr: Les signaux et les images peuvent également être réorganisés par glisser-déposer :

source: Signals and images can be dragged and dropped inside their own panel to change their order
fr: Les signaux et les images peuvent être déplacés et déposés dans leur propre panneau pour changer leur ordre

source: Groups can also be dragged and dropped inside their panel
fr: Les groupes peuvent également être déplacés et déposés dans leur panneau

source: The feature also supports multi-selection (using the standard Ctrl and Shift modifiers), so that multiple signals/images/groups can be moved at once, not necessarily with contiguous positions
fr: La fonctionnalité prend également en charge la sélection multiple (en utilisant les modificateurs standard Ctrl et Shift), de sorte que plusieurs signaux/images/groupes peuvent être déplacés à la fois, pas nécessairement avec des positions contiguës

source: This fixes [Issue #17](https://github.com/DataLab-Platform/DataLab/issues/17) - Add Drag and Drop feature to Signals/Images tree views
fr: Ceci corrige l'[Issue #17](https://github.com/DataLab-Platform/DataLab/issues/17) - Ajout de la fonctionnalité de glisser-déposer aux vues arborescentes des signaux/images

source: New 1D interpolation features:
fr: Nouvelles fonctionnalités d'interpolation 1D :

source: Added "Interpolation" feature to signal panel's "Processing" menu
fr: Ajout de la fonctionnalité "Interpolation" au menu "Traitement" du panneau de signal

source: Methods available: linear, spline, quadratic, cubic, barycentric and PCHIP
fr: Méthodes disponibles : linéaire, spline, quadratique, cubique, barycentrique et PCHIP

source: Thanks to [@marcel-goldschen-ohm](https://github.com/marcel-goldschen-ohm) for the contribution to spline interpolation
fr: Merci à [@marcel-goldschen-ohm](https://github.com/marcel-goldschen-ohm) pour sa contribution à l'interpolation spline

source: This fixes [Issue #20](https://github.com/DataLab-Platform/DataLab/issues/20) - Add 1D interpolation features
fr: Ceci corrige l'[Issue #20](https://github.com/DataLab-Platform/DataLab/issues/20) - Ajout des fonctionnalités d'interpolation 1D

source: New 1D resampling feature:
fr: Nouvelle fonctionnalité de rééchantillonnage 1D :

source: Added "Resampling" feature to signal panel's "Processing" menu
fr: Ajout de la fonctionnalité "Rééchantillonnage" au menu "Traitement" du panneau de signal

source: Same interpolation methods as for the "Interpolation" feature
fr: Mêmes méthodes d'interpolation que pour la fonctionnalité "Interpolation"

source: Possibility to specify the resampling step or the number of points
fr: Possibilité de spécifier le pas de rééchantillonnage ou le nombre de points

source: This fixes [Issue #21](https://github.com/DataLab-Platform/DataLab/issues/21) - Add 1D resampling feature
fr: Ceci corrige l'[Issue #21](https://github.com/DataLab-Platform/DataLab/issues/21) - Ajout de la fonctionnalité de rééchantillonnage 1D

source: New 1D convolution feature:
fr: Nouvelle fonctionnalité de convolution 1D :

source: Added "Convolution" feature to signal panel's "Operation" menu
fr: Ajout de la fonctionnalité "Convolution" au menu "Opération" du panneau de signal

source: This fixes [Issue #23](https://github.com/DataLab-Platform/DataLab/issues/23) - Add 1D convolution feature
fr: Ceci corrige l'[Issue #23](https://github.com/DataLab-Platform/DataLab/issues/23) - Ajout de la fonctionnalité de convolution 1D

source: New 1D detrending feature:
fr: Nouvelle fonctionnalité de d'élimination de tendance 1D :

source: Added "Detrending" feature to signal panel's "Processing" menu
fr: Ajout de la fonctionnalité "Élimination de tendance" au menu "Traitement" du panneau de signal

source: Methods available: linear or constant
fr: Méthodes disponibles : linéaire ou constante

source: This fixes [Issue #24](https://github.com/DataLab-Platform/DataLab/issues/24) - Add 1D detrending feature
fr: Ceci corrige l'[Issue #24](https://github.com/DataLab-Platform/DataLab/issues/24) - Ajout de la fonctionnalité d'élimination de tendance 1D

source: 2D analysis results:
fr: Résultats d'analyse 2D :

source: Before this release, 2D analysis results such as contours, blobs, etc. were stored in image metadata dictionary as coordinates (x0, y0, x1, y1, ...) even for circles and ellipses (i.e. the coordinates of the bounding rectangles).
fr: Avant cette version, les résultats d'analyse 2D tels que les contours, les blobs, etc. étaient stockés dans le dictionnaire de métadonnées de l'image sous forme de coordonnées (x0, y0, x1, y1, ...) même pour les cercles et les ellipses (c'est-à-dire les coordonnées des rectangles englobants).

source: For convenience, the circle and ellipse coordinates are now stored in image metadata dictionary as (x0, y0, radius) and (x0, y0, a, b, theta) respectively.
fr: Par souci de commodité, les coordonnées du cercle et de l'ellipse sont désormais stockées dans le dictionnaire de métadonnées de l'image sous la forme (x0, y0, rayon) et (x0, y0, a, b, theta) respectivement.

source: These results are also shown as such in the "Results" dialog box (either at the end of the computing process or when clicking on the "Show results" button).
fr: Ces résultats sont également affichés comme tels dans la boîte de dialogue "Résultats" (à la fin du processus de calcul ou en cliquant sur le bouton "Afficher les résultats").

source: This fixes [Issue #32](https://github.com/DataLab-Platform/DataLab/issues/32) - Contour detection: show circle `(x, y, r)` and ellipse `(x, y, a, b, theta)` instead of `(x0, y0, x1, x1, ...)`
fr: Cette correction corrige l'[Issue #32](https://github.com/DataLab-Platform/DataLab/issues/32) - Détection des contours : afficher le cercle `(x, y, r)` et l'ellipse `(x, y, a, b, theta)` au lieu de `(x0, y0, x1, x1, ...)`

source: 1D and 2D analysis results:
fr: Résultats d'analyse 1D et 2D :

source: Additionnaly to the previous enhancement, more analysis results are now shown in the "Results" dialog box
fr: En complément de l'amélioration précédente, plus de résultats d'analyse sont désormais affichés dans la boîte de dialogue "Résultats"

source: This concerns both 1D (FHWM...) and 2D analysis results (contours, blobs...):
fr: Cela concerne à la fois les résultats d'analyse 1D (FHWM...) et 2D (contours, blobs...) :

source: Segment results now also show length (L) and center coordinates (Xc, Yc)
fr: Les résultats de type segment affichent désormais également la longueur (L) et les coordonnées du centre (Xc, Yc)

source: Circle and ellipse results now also show area (A)
fr: Les résultats de type cercle et ellipse affichent désormais également l'aire (A)

source: Added "Plot results" entry in "Analysis" menu:
fr: Ajout de l'entrée "Tracer les résultats" dans le menu Analyse" :

source: This feature allows to plot analysis results (1D or 2D)
fr: Cette fonctionnalité permet de tracer les résultats d'analyse (1D ou 2D)

source: It creates a new signal with X and Y axes corresponding to user-defined parameters (e.g. X = indices and Y = radius for circle results)
fr: Cela crée un nouveau signal avec des axes X et Y correspondant à des paramètres définis par l'utilisateur (par exemple X = index et Y = rayon pour les résultats de cercle)

source: Increased default width of the object selection dialog box:
fr: Augmentation de la largeur par défaut de la boîte de dialogue de sélection d'objet :

source: The object selection dialog box is now wider by default, so that the full signal/image/group titles may be more easily readable
fr: La boîte de dialogue de sélection d'objet est désormais plus large par défaut, de sorte que les titres complets des signaux/images/groupes soient plus facilement lisibles

source: Delete metadata feature:
fr: Fonctionnalité de suppression de métadonnées :

source: Before this release, the feature was deleting all metadata, including the Regions Of Interest (ROI) metadata, if any.
fr: Avant cette version, la fonctionnalité supprimait toutes les métadonnées, y compris les métadonnées des régions d'intérêt (ROI), le cas échéant.

source: Now a confirmation dialog box is shown to the user before deleting all metadata if the signal/image has ROI metadata: this allows to keep the ROI metadata if needed.
fr: A présent, une boîte de dialogue de confirmation est affichée à l'utilisateur avant de supprimer toutes les métadonnées si le signal/l'image a des métadonnées ROI : cela permet de conserver les métadonnées ROI si nécessaire.

source: Image profile extraction feature: added support for masked images (when defining regions of interest, the areas outside the ROIs are masked, and the profile is extracted only on the unmasked areas, or averaged on the unmasked areas in the case of average profile extraction)
fr: Extraction de profil d'image : ajout de la prise en charge des images masquées (lors de la définition des régions d'intérêt, les zones en dehors des ROI sont masquées, et le profil est extrait uniquement sur les zones non masquées, ou moyenné sur les zones non masquées dans le cas de l'extraction du profil moyen)

source: Curve style: added "Reset curve styles" in "View" menu. This feature allows to reset the curve style cycle to its initial state.
fr: Style de courbe : ajout de "Réinitialiser les styles de courbe" dans le menu "Affichage". Cette fonctionnalité permet de réinitialiser le cycle de style de courbe à son état initial.

source: Plugin base classe `PluginBase`:
fr: Classe de base des plugins `PluginBase` :

source: Added `edit_new_signal_parameters` method for showing a dialog box to edit parameters for a new signal
fr: Ajout de la méthode `edit_new_signal_parameters` pour afficher une boîte de dialogue pour éditer les paramètres d'un nouveau signal

source: Added `edit_new_image_parameters` method for showing a dialog box to edit parameters for a new image (updated the *datalab_testdata.py* plugin accordingly)
fr: Ajout de la méthode `edit_new_image_parameters` pour afficher une boîte de dialogue pour éditer les paramètres d'une nouvelle image (mise à jour du plugin *datalab_testdata.py* en conséquence)

source: Signal and image computations API (`datalab.computations`):
fr: API de calculs sur les signaux et les images (`datalab.computations`) :

source: Added wrappers for signal and image 1 -> 1 computations
fr: Ajout de wrappers pour les calculs 1 -> 1 sur les signaux et les images

source: These wrappers aim at simplifying the creation of a basic computation function operating on DataLab's native objects (`SignalObj` and `ImageObj`) from a function operating on NumPy arrays
fr: Ces wrappers visent à simplifier la création d'une fonction de calcul de base opérant sur les objets natifs de DataLab (`SignalObj` et `ImageObj`) à partir d'une fonction opérant sur des tableaux NumPy

source: This simplifies DataLab's internals and makes it easier to create new computing features inside plugins
fr: Cela simplifie les fonctionnalités internes de DataLab et facilite la création de nouvelles fonctionnalités de calcul dans les plugins

source: See the *datalab_custom_func.py* example plugin for a practical use case
fr: Voir le plugin d'exemple *datalab_custom_func.py* pour un cas d'utilisation pratique

source: Added "Radial profile extraction" feature to image panel's "Operation" menu:
fr: Ajout de la fonctionnalité "Extraction du profil radial" au menu "Opération" du panneau d'image :

source: This feature allows to extract a radially averaged profile from an image
fr: Cette fonctionnalité permet d'extraire un profil moyenné radialement à partir d'une image

source: The profile is extracted around a user-defined center (x0, y0)
fr: Le profil est extrait autour d'un centre défini par l'utilisateur (x0, y0)

source: The center may also be computed (centroid or image center)
fr: Le centre peut également être calculé (centre de gravité ou centre de l'image)

source: Automated test suite:
fr: Suite de tests automatisés :

source: Since version 0.10, DataLab's proxy object has a `toggle_auto_refresh` method to toggle the "Auto-refresh" feature. This feature may be useful to improve performance during the execution of test scripts
fr: Depuis la version 0.10, l'objet proxy de DataLab dispose d'une méthode `toggle_auto_refresh` pour activer/désactiver la fonctionnalité "Auto-refresh". Cette fonctionnalité peut être utile pour améliorer les performances lors de l'exécution de scripts de test

source: Test scenarios on signals and images are now using this feature to improve performance
fr: Les scénarios de test sur les signaux et les images utilisent désormais cette fonctionnalité pour améliorer les performances

source: Signal and image metadata:
fr: Métadonnées des signaux et des images :

source: Added "source" entry to the metadata dictionary, to store the source file path when importing a signal or an image from a file
fr: Ajout de l'entrée "source" dans le dictionnaire de métadonnées, pour stocker le chemin du fichier source lors de l'importation d'un signal ou d'une image à partir d'un fichier

source: This field is kept while processing the signal/image, in order to keep track of the source file path
fr: Ce champ est conservé lors du traitement du signal/image, afin de garder une trace du chemin du fichier source

source: New [Tutorial section](https://datalab-platform.com/en/intro/tutorials/index.html) in the documentation:
fr: Nouvelle [section Tutoriels](https://datalab-platform.com/fr/intro/tutorials/index.html) dans la documentation :

source: This section provides a set of tutorials to learn how to use DataLab
fr: Cette section fournit un ensemble de tutoriels pour apprendre à utiliser DataLab

source: The following video tutorials are available:
fr: Les tutoriels vidéo suivants sont disponibles :

source: Quick demo
fr: Démo rapide

source: Adding your own features
fr: Ajout de vos propres fonctionnalités

source: The following text tutorials are available:
fr: Les tutoriels textuels suivants sont disponibles :

source: Processing a spectrum
fr: Traitement d'un spectre

source: Detecting blobs on an image
fr: Détection de taches sur une image

source: Measuring Fabry-Perot fringes
fr: Mesure de franges Fabry-Perot

source: Prototyping a custom processing pipeline
fr: Prototypage d'un pipeline de traitement personnalisé

source: New [API section](https://datalab-platform.com/en/api/index.html) in the documentation:
fr: Nouvelle [section API](https://datalab-platform.com/fr/api/index.html) dans la documentation :

source: This section explains how to use DataLab as a Python library, by covering the following topics:
fr: Cette section explique comment utiliser DataLab comme une bibliothèque Python, en abordant les sujets suivants :

source: How to use DataLab algorithms on NumPy arrays
fr: Comment utiliser les algorithmes DataLab sur les tableaux NumPy

source: How to use DataLab computation features on DataLab objects (signals and images)
fr: Comment utiliser les fonctionnalités de calcul de DataLab sur les objets DataLab (signaux et images)

source: How to use DataLab I/O features
fr: Comment utiliser les fonctionnalités d'entrée/sortie de DataLab

source: How to use proxy objects to control DataLab remotely
fr: Comment utiliser les objets proxy pour contrôler DataLab à distance

source: This section also provides a complete API reference for DataLab objects and features
fr: Cette section fournit également une référence complète de l'API pour les objets et les fonctionnalités de DataLab

source: This fixes [Issue #19](https://github.com/DataLab-Platform/DataLab/issues/19) - Add API documentation (data model, functions on arrays or signal/image objects, ...)
fr: Ceci corrige l'[Issue #19](https://github.com/DataLab-Platform/DataLab/issues/19) - Ajout de la documentation de l'API (modèle de données, fonctions sur les tableaux ou les objets de signaux/images, ...)

source: Fixed [Issue #29](https://github.com/DataLab-Platform/DataLab/issues/29) - Polynomial fit error: `QDialog [...] argument 1 has an unexpected type 'SignalProcessor'`
fr: Ceci corrige l'[Issue #29](https://github.com/DataLab-Platform/DataLab/issues/29) - Erreur d'ajustement polynomial : `QDialog [...] argument 1 has an unexpected type 'SignalProcessor'`

source: Image ROI extraction feature:
fr: Fonctionnalité d'extraction de ROI d'image :

source: Before this release, when extracting a single circular ROI from an image with the "Extract all ROIs into a single image object" option enabled, the result was a single image without the ROI mask (the ROI mask was only available when extracting ROI with the option disabled)
fr: Avant cette version, lors de l'extraction d'une seule ROI circulaire d'une image avec l'option "Extraire toutes les ROI dans un seul objet d'image" activée, le résultat était une seule image sans le masque de ROI (le masque de ROI n'était disponible que lors de l'extraction de ROI avec l'option désactivée)

source: This was leading to an unexpected behavior, because one could interpret the result (a square image without the ROI mask) as the result of a single rectangular ROI
fr: Cela conduisait à un comportement inattendu, car on pouvait interpréter le résultat (une image carrée sans le masque de ROI) comme le résultat d'une seule ROI rectangulaire

source: Now, when extracting a single circular ROI from an image with the "Extract all ROIs into a single image object" option enabled, the result is a single image with the ROI mask (as if the option was disabled)
fr: A présent, lors de l'extraction d'une seule ROI circulaire d'une image avec l'option "Extraire toutes les ROI dans un seul objet d'image" activée, le résultat est une seule image avec le masque de ROI (comme si l'option était désactivée)

source: This fixes [Issue #31](https://github.com/DataLab-Platform/DataLab/issues/31) - Single circular ROI extraction: automatically switch to `compute_extract_roi` function
fr: Ceci corrige l'[Issue #31](https://github.com/DataLab-Platform/DataLab/issues/31) - Extraction d'une seule ROI circulaire : bascule automatique vers la fonction `compute_extract_roi`

source: Analysis on circular ROI:
fr: Analyse sur ROI circulaire :
