Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Implementation for signals:
fr: Implémentation pour les signaux :

source: Choose a zero padding strategy (Next power of 2, Double the length, Triple the length, Custom length)
fr: Choisissez une stratégie de complément de zéros (prochain multiple de 2, double la longueur, triple la longueur, longueur personnalisée)

source: Or manually set the zero padding length (if "Custom length" is selected)
fr: Ou définissez manuellement la longueur de complément de zéros (si "Longueur personnalisée" est sélectionnée)

source: Implementation for images:
fr: Implémentation pour les images :

source: Choose a zero padding strategy (Next power of 2, Next multiple of 64, Custom length)
fr: Choisissez une stratégie de complément de zéros (prochain multiple de 2, prochain multiple de 64, longueur personnalisée)

source: Or manually set the zero padding row and column lengths (if "Custom length" is selected)
fr: Ou définissez manuellement les longueurs de ligne et de colonne de complément de zéros (si "Longueur personnalisée" est sélectionnée)

source: Set the position of the zero padding (bottom-right, centered)
fr: Définir la position du complément de zéros (en bas à droite, centré)

source: This closes [Issue #170](https://github.com/DataLab-Platform/DataLab/issues/170) - Fourier analysis: add zero padding feature for signals and images
fr: Ceci corrige l'[Issue #170](https://github.com/DataLab-Platform/DataLab/issues/170) - Analyse de Fourier : ajouter la fonctionnalité de complément de zéros pour les signaux et les images

source: Region of Interest (ROI) editor:
fr: Éditeur de région d'intérêt (ROI) :

source: This concerns the "Edit Regions of Interest" feature for both signals and images
fr: Cela concerne la fonctionnalité "Éditer les régions d'intérêt" pour les signaux et les images

source: New behavior:
fr: Nouveau comportement :

source: Signals: the range ROI selection tool is now active by default, and the user can select right away the range of the signal to be used as a ROI
fr: Signaux : l'outil de sélection de la plage ROI est désormais actif par défaut, et l'utilisateur peut sélectionner immédiatement la plage du signal à utiliser comme ROI

source: Images: the rectangular ROI selection tool is now active by default, and the user can select right away the rectangular ROI to be used as a ROI
fr: Images : l'outil de sélection de la ROI rectangulaire est désormais actif par défaut, et l'utilisateur peut sélectionner immédiatement la ROI rectangulaire à utiliser comme ROI

source: This closes [Issue #154](https://github.com/DataLab-Platform/DataLab/issues/154) - ROI editor: activate ROI selection tool by default, so that the user can select right away the area to be used as a ROI
fr: Ceci clôture le ticket [Issue #154](https://github.com/DataLab-Platform/DataLab/issues/154) - Éditeur de ROI : activer l'outil de sélection de ROI par défaut, afin que l'utilisateur puisse sélectionner immédiatement la zone à utiliser comme ROI

source: Added the "Select tool" to editor's toolbar, to allow the user to switch between the "Select" and "Draw" tools easily without having to use the plot toolbar on the top of the window
fr: Ajout de l'outil "Sélectionner" à la barre d'outils de l'éditeur, pour permettre à l'utilisateur de basculer facilement entre les outils "Sélectionner" et "Dessiner" sans avoir à utiliser la barre d'outils de tracé en haut de la fenêtre

source: Signal processing features ("Processing" menu):
fr: Fonctionnalités de traitement du signal (menu "Traitement") :

source: New "X-Y mode" feature: this feature simulates the behavior of the X-Y mode of an oscilloscope, i.e. it allows to plot one signal as a function of another signal (e.g. X as a function of Y)
fr: Nouvelle fonctionnalité "Mode X-Y" : cette fonctionnalité simule le comportement du mode X-Y d'un oscilloscope, c'est-à-dire qu'elle permet de tracer un signal en fonction d'un autre signal (par exemple X en fonction de Y)

source: New abscissa and ordinate find features:
fr: Nouvelles fonctionnalités de recherche d'abscisse et d'ordonnée :

source: "First abscissa at y=..." feature: this feature allows to find the first abscissa value of a signal at a given y value (e.g. the abscissa value of a signal at y=0)
fr: Fonctionnalité "Abscisse à y=..." : cette fonctionnalité permet de trouver la première valeur d'abscisse d'un signal à une valeur y donnée (par exemple, la valeur d'abscisse d'un signal à y=0)

source: "Ordinate at x=..." feature: this feature allows to find the ordinate value of a signal at a given x value (e.g. the ordinate value of a signal at x=0)
fr: Fonctionnalité "Ordonnée à x=..." : cette fonctionnalité permet de trouver la valeur d'ordonnée d'un signal à une valeur x donnée (par exemple, la valeur d'ordonnée d'un signal à x=0)

source: Each feature has its own dialog box, which allows to set the y or x value to be used for the search with a slider or a text box
fr: Chaque fonctionnalité a sa propre boîte de dialogue, qui permet de définir la valeur y ou x à utiliser pour la recherche avec un curseur ou une zone de texte

source: This closes [Issue #125](https://github.com/DataLab-Platform/DataLab/issues/125) and [Issue #126](https://github.com/DataLab-Platform/DataLab/issues/126)
fr: Ceci clôture les tickets [Issue #125](https://github.com/DataLab-Platform/DataLab/issues/125) et [Issue #126](https://github.com/DataLab-Platform/DataLab/issues/126)

source: New full width at given y feature:
fr: Nouvelle fonctionnalité de calcul de largeur à un y donné :

source: The "Full width at y=..." feature allows to find the full width of a signal at a given y value (e.g. the full width of a signal at y=0)
fr: La fonctionnalité "Largeur à y=..." permet de calculer la largeur d'un signal à une valeur y donnée

source: A specific dialog box allows to set the y value to be used for the search with a slider or a text box
fr: Une boîte de dialogue spécifique permet de définir la valeur y à utiliser avec un curseur ou une zone de texte

source: This closes [Issue #127](https://github.com/DataLab-Platform/DataLab/issues/127)
fr: Ceci clôture le ticket [Issue #127](https://github.com/DataLab-Platform/DataLab/issues/127)

source: Public API (local or remote):
fr: API publique (locale ou distante) :

source: Add `group_id` and `set_current` arguments to `add_signal`, `add_image` and `add_object` methods:
fr: Ajout des arguments `group_id` et `set_current` aux méthodes `add_signal`, `add_image` et `add_object` :

source: This concerns the `LocalProxy`, `AbstractDLControl`, `RemoteClient`, `RemoteServer` and `DLMainWindow` classes
fr: Cela concerne les classes `LocalProxy`, `AbstractDLControl`, `RemoteClient`, `RemoteServer` et `DLMainWindow`

source: `group_id` argument allows to specify the group ID where the signal or image should be added (if not specified, the signal or image is added to the current group)
fr: L'argument `group_id` permet de spécifier l'identifiant du groupe où le signal ou l'image doit être ajouté (s'il n'est pas spécifié, le signal ou l'image est ajouté au groupe actuel)

source: `set_current` argument allows to specify if the signal or image should be set as current after being added (default is `True`)
fr: L'argument `set_current` permet de spécifier si le signal ou l'image doit être défini comme actuel après avoir été ajouté (la valeur par défaut est `True`)

source: This closes [Issue #151](https://github.com/DataLab-Platform/DataLab/issues/151) - Public API: add a keyword `group_id` to `add_signal` and `add_image`
fr: Ceci corrige l'[Issue #151](https://github.com/DataLab-Platform/DataLab/issues/151) - API publique : ajouter un mot-clé `group_id` à `add_signal` et `add_image`

source: Fixed [Issue #172](https://github.com/DataLab-Platform/DataLab/issues/172) - Image profiles: when moving/resizing image, profile plots are not refreshed (fixed in PlotPy v2.7.4)
fr: Correction de l'[Issue #172](https://github.com/DataLab-Platform/DataLab/issues/172) - Profils d'image : lors du déplacement/redimensionnement de l'image, les graphiques de profil ne sont pas actualisés (corrigé dans PlotPy v2.7.4)

source: Fixed [Issue #173](https://github.com/DataLab-Platform/DataLab/issues/173) - Phase spectrum: add unit (degree) and function reference (`numpy.angle`) to the documentation
fr: Correction de l'[Issue #173](https://github.com/DataLab-Platform/DataLab/issues/173) - Spectre de phase : ajouter l'unité (degré) et la référence de fonction (`numpy.angle`) à la documentation

source: Fixed [Issue #177](https://github.com/DataLab-Platform/DataLab/issues/177) - "Open from directory" feature: unexpected group name (a group named "." is created instead of the root folder name)
fr: Correction de l'[Issue #177](https://github.com/DataLab-Platform/DataLab/issues/177) - Fonctionnalité "Ouvrir depuis le répertoire" : nom de groupe inattendu (un groupe nommé "." est créé au lieu du nom du dossier racine)

source: Fixed [Issue #169](https://github.com/DataLab-Platform/DataLab/issues/169) - Signal / Fourier analysis: magnitude spectrum feature does not work as expected with logarithmic scale enabled
fr: Correction de l'[Issue #169](https://github.com/DataLab-Platform/DataLab/issues/169) - Analyse de signal / Fourier : la fonction de spectre de magnitude ne fonctionne pas comme prévu avec l'échelle logarithmique activée

source: Fixed [Issue #168](https://github.com/DataLab-Platform/DataLab/issues/168) - Average profile visualization: empty profile is displayed when the target rectangular area is outside the image area (this has been fixed upstream, in PlotPy v2.7.4, and so requires the latest version of PlotPy)
fr: Correction de l'[Issue #168](https://github.com/DataLab-Platform/DataLab/issues/168) - Visualisation du profil moyen : le profil vide est affiché lorsque la zone rectangulaire cible est en dehors de la zone de l'image (ceci a été corrigé en amont, dans PlotPy v2.7.4, et nécessite donc la dernière version de PlotPy)

source: Pairwise operation mode:
fr: Mode d'opération pairwise :

source: Fixed an unexpected behavior when using the pairwise operation mode with functions that take a single second operand (e.g. for images: difference, division, arithmetic operations, and flatfield correction)
fr: Correction d'un comportement inattendu lors de l'utilisation du mode d'opération pairwise avec des fonctions qui prennent un seul second opérande (par exemple pour les images : différence, division, opérations arithmétiques et correction de champ plat)

source: If only one set of operands was selected in a single group, a warning message was displayed "In pairwise mode, you need to select objects in at least two groups.", which is correct for functions that are symmetric (e.g. addition, multiplication, etc.), but not for functions that are not symmetric (e.g. difference, division, etc.).
fr: Si un seul ensemble d'opérandes était sélectionné dans un seul groupe, un message d'avertissement était affiché "En mode pairwise, vous devez sélectionner des objets dans au moins deux groupes. ", ce qui est correct pour les fonctions qui sont symétriques (par exemple addition, multiplication, etc.), mais pas pour les fonctions qui ne le sont pas (par exemple différence, division, etc.).

source: This is now fixed: the warning message is only displayed for functions that are symmetric (e.g. addition, multiplication, etc.).
fr: Ceci est maintenant corrigé : le message d'avertissement n'est affiché que pour les fonctions qui sont symétriques (par exemple addition, multiplication, etc.).

source: This closes [Issue #157](https://github.com/DataLab-Platform/DataLab/issues/157) - Pairwise operation mode: unexpected behavior with functions that take a single second operand
fr: Ceci corrige l'[Issue #157](https://github.com/DataLab-Platform/DataLab/issues/157) - Mode d'opération pairwise : comportement inattendu avec des fonctions qui prennent un seul second opérande

source: Fixed [Issue #152](https://github.com/DataLab-Platform/DataLab/issues/152) - Ignore `nan` values for image normalization, flatfield correction, offset correction, and centroid computation
fr: Correction de l'[Issue #152](https://github.com/DataLab-Platform/DataLab/issues/152) - Ignorer les valeurs `nan` pour la normalisation d'image, la correction de champ plat, la correction de décalage et le calcul du centroïde

source: Fixed [Issue #153](https://github.com/DataLab-Platform/DataLab/issues/153) - Ignore `nan` values for signal normalization and statistics computations (both analysis result and interactive tool)
fr: Correction de l'[Issue #153](https://github.com/DataLab-Platform/DataLab/issues/153) - Ignorer les valeurs `nan` pour la normalisation du signal et les calculs de statistiques (à la fois le résultat d'analyse et l'outil interactif)

source: Fixed [Issue #158](https://github.com/DataLab-Platform/DataLab/issues/158) - When editing ROI of a list of images, the first image of the selection is shown (instead of the last as in the image panel)
fr: Correction de l'[Issue #158](https://github.com/DataLab-Platform/DataLab/issues/158) - Lors de l'édition de la ROI d'une liste d'images, la première image de la sélection est affichée (au lieu de la dernière comme dans le panneau d'image)

source: Fixed [Issue #159](https://github.com/DataLab-Platform/DataLab/issues/159) - When selecting multiple images just after opening an HDF5 file, the "View in a new window" feature does not work (`KeyError` exception)
fr: Correction de l'[Issue #159](https://github.com/DataLab-Platform/DataLab/issues/159) - Lors de la sélection de plusieurs images juste après l'ouverture d'un fichier HDF5, la fonctionnalité "Afficher dans une nouvelle fenêtre" ne fonctionne pas (exception `KeyError`)

source: Fixed [Issue #160](https://github.com/DataLab-Platform/DataLab/issues/160) - When selecting multiple images and clearing ROI in ROI editor, only the first image is affected
fr: Correction de l'[Issue #160](https://github.com/DataLab-Platform/DataLab/issues/160) - Lors de la sélection de plusieurs images et de l'effacement de la ROI dans l'éditeur de ROI, seule la première image est affectée

source: Fixed [Issue #161](https://github.com/DataLab-Platform/DataLab/issues/161) - Refresh image items only if necessary (when editing ROI, pasting/deleting metadata)
fr: Correction de l'[Issue #161](https://github.com/DataLab-Platform/DataLab/issues/161) - Rafraîchir les items d'image uniquement si nécessaire (lors de l'édition de la ROI, du collage/de la suppression de métadonnées)

source: Fixed [Issue #162](https://github.com/DataLab-Platform/DataLab/issues/162) - View in a new window: when displaying multiple images, the item list panel should be visible
fr: Correction de l'[Issue #162](https://github.com/DataLab-Platform/DataLab/issues/162) - Afficher dans une nouvelle fenêtre : lors de l'affichage de plusieurs images, le panneau de liste d'items doit être visible

source: Fixed [Issue #163](https://github.com/DataLab-Platform/DataLab/issues/163) - Open from directory: expected one group per folder when loading multiple files
fr: Ceci corrige l'[Issue #163](https://github.com/DataLab-Platform/DataLab/issues/163) - Ouvrir depuis le répertoire : un groupe par dossier attendu lors du chargement de plusieurs fichiers

source: Fixed [Issue #164](https://github.com/DataLab-Platform/DataLab/issues/164) - Open from directory: unsupported files should be ignored when loading files recursively, to avoid warning popup dialog boxes
fr: Ceci corrige l'[Issue #164](https://github.com/DataLab-Platform/DataLab/issues/164) - Ouvrir depuis le répertoire : les fichiers non pris en charge doivent être ignorés lors du chargement de fichiers de manière récursive, pour éviter les boîtes de dialogue d'avertissement

source: Fixed [Issue #165](https://github.com/DataLab-Platform/DataLab/issues/165) - When opening a file, the default signal/image title must be set to the file name, instead of the relative path to the file name
fr: Correction de l'[Issue #165](https://github.com/DataLab-Platform/DataLab/issues/165) - Lors de l'ouverture d'un fichier, le titre par défaut du signal/image doit être défini sur le nom du fichier, au lieu du chemin relatif au nom du fichier

source: Image operation features ("Operations" menu):
fr: Fonctionnalités d'opération sur les images (menu "Opérations") :

source: Renamed "Rotation" submenu to "Flip or rotation"
fr: Renommage du sous-menu "Rotation" en "Symétrie ou rotation"

source: New "Flip diagonally" feature
fr: Nouvelle fonctionnalité "Symétrie diagonale"

source: New "Convert to Cartesian coordinates" feature
fr: Nouvelle fonctionnalité "Convertir en coordonnées cartésiennes"

source: New "Convert to polar coordinates" feature
fr: Nouvelle fonctionnalité "Convertir en coordonnées polaires"

source: Signal analysis features ("Analysis" menu):
fr: Fonctionnalités d'analyse du signal (menu "Analyse") :

source: Renamed "X values at min/max" to "Abscissa of the minimum and maximum"
fr: Renommage de "Valeurs X au min/max" en "Abscisse du minimum et du maximum"

source: New "Abscissa at y=..." feature
fr: Nouvelle fonctionnalité "Abscisse à y=..."

source: New "Open from directory" feature:
fr: Nouvelle fonctionnalité "Ouvrir depuis le répertoire" :

source: This feature allows to open multiple files from a directory at once, recursively (only the files with the supported extensions by the current panel are opened)
fr: Cette fonctionnalité permet d'ouvrir plusieurs fichiers d'un répertoire à la fois, de manière récursive (seuls les fichiers avec les extensions prises en charge par le panneau actuel sont ouverts)

source: Add "Open from directory" action to the "File" menu for both Signal and Image panels
fr: Ajout de l'action "Ouvrir depuis le répertoire" au menu "Fichier" pour les panneaux Signal et Image

source: Add support for folders when dropping files in the Signal and Image panels
fr: Ajout de la prise en charge des dossiers lors du glisser-déposer de fichiers dans les panneaux Signal et Image

source: Add `1/x` operation to the "Operations" menu for both Signal and Image panels:
fr: Ajout de l'opération `1/x` au menu "Opérations" pour les panneaux Signal et Image :

source: This feature relies on the `numpy.reciprocal` function, and handles the case where the denominator is zero by catching warnings and replacing the `np.inf` values with `np.nan` values
fr: Cette fonctionnalité repose sur la fonction `numpy.reciprocal`, et gère le cas où le dénominateur est zéro en interceptant les avertissements et en remplaçant les valeurs `np.inf` par des valeurs `np.nan`

source: Add `compute_inverse` method for image and signal processors
fr: Ajout de la méthode `compute_inverse` pour les processeurs d'image et de signal

source: This closes [Issue #143](https://github.com/DataLab-Platform/DataLab/issues/143) - New feature: `1/x` for signals and images
fr: Ceci corrige l'[Issue #143](https://github.com/DataLab-Platform/DataLab/issues/143) - Nouvelle fonctionnalité : `1/x` pour les signaux et les images

source: Add `add_group` method with `title` and `select` arguments to create a new group in a data panel (e.g. Signal or Image panel) and eventually select it after creation:
fr: Ajout de la méthode `add_group` avec les arguments `title` et `select` pour créer un nouveau groupe dans un panneau de données (par exemple, panneau Signal ou Image) et éventuellement le sélectionner après sa création :

source: Method was added to the following classes: `AbstractDLControl`, `BaseDataPanel` and `RemoteClient`
fr: Cette méthode a été ajoutée aux classes suivantes : `AbstractDLControl`, `BaseDataPanel` et `RemoteClient`

source: This closes the following issues:
fr: Cette fonctionnalité clôture les tickets suivants :

source: [Issue #131](https://github.com/DataLab-Platform/DataLab/issues/131) - `BaseDataPanel.add_group`: add `select` argument
fr: [Issue #131](https://github.com/DataLab-Platform/DataLab/issues/131) - `BaseDataPanel.add_group` : ajout de l'argument `select`

source: [Issue #47](https://github.com/DataLab-Platform/DataLab/issues/47) - Remote proxy / Public API: add `add_group` method
fr: [Issue #47](https://github.com/DataLab-Platform/DataLab/issues/47) - Proxy distant / API publique : ajout de la méthode `add_group`

source: `AbstractDLControl.get_object_uuids`: add an optional `group` argument (group ID, title or number) to eventually filter the objects by group (this closes [Issue #130](https://github.com/DataLab-Platform/DataLab/issues/130))
fr: `AbstractDLControl.get_object_uuids` : ajout d'un argument optionnel `group` (identifiant, titre ou numéro du groupe) pour éventuellement filtrer les objets par groupe (ceci clôture le ticket [Issue #130](https://github.com/DataLab-Platform/DataLab/issues/130))

source: When opening an HDF5 file, the confirmation dialog box asking if current workspace should be cleared has a new possible answer "Ignore":
fr: Lors de l'ouverture d'un fichier HDF5, la boîte de dialogue de confirmation demandant si l'espace de travail actuel doit être effacé a une nouvelle réponse possible "Ignorer" :

source: Choosing "Ignore" will prevent the confirmation dialog box from being displayed again, and will choose the current setting (i.e. clear or not the workspace) for all subsequent file openings
fr: Choisir "Ignorer" empêchera la boîte de dialogue de confirmation d'être affichée à nouveau, et choisira le paramètre actuel (c'est-à-dire effacer ou non l'espace de travail) pour toutes les ouvertures de fichiers suivantes

source: Added a new "Clear workspace before loading HDF5 file" option in the "Settings" dialog box, to allow the user to change the current setting (i.e. clear or not the workspace) for all subsequent file openings
fr: Ajout d'une nouvelle option "Effacer l'espace de travail avant de charger le fichier HDF5" dans la boîte de dialogue "Paramètres", pour permettre à l'utilisateur de changer le paramètre actuel (c'est-à-dire effacer ou non l'espace de travail) pour toutes les ouvertures de fichiers suivantes

source: Added a new "Ask before clearing workspace" option in the "Settings" dialog box, to allow the user to disable or re-enable the confirmation dialog box asking if current workspace should be cleared when opening an HDF5 file
fr: Ajout d'une nouvelle option "Demander avant d'effacer l'espace de travail" dans la boîte de dialogue "Paramètres", pour permettre à l'utilisateur de désactiver ou de réactiver la boîte de dialogue de confirmation demandant si l'espace de travail actuel doit être effacé lors de l'ouverture d'un fichier HDF5

source: This closes [Issue #146](https://github.com/DataLab-Platform/DataLab/issues/146) - Ask before clearing workspace when opening HDF5 file: add "Ignore" option to prevent dialog from being displayed again
fr: Ceci clôture le ticket [Issue #146](https://github.com/DataLab-Platform/DataLab/issues/146) - Demander avant d'effacer l'espace de travail lors de l'ouverture d'un fichier HDF5 : ajouter l'option "Ignorer" pour empêcher la boîte de dialogue d'être affichée à nouveau

source: Object and group title renaming:
fr: Renommage du titre des objets et des groupes :

source: Removed "Rename group" feature from the "Edit" menu and context menu
fr: Suppression de la fonctionnalité "Renommer le groupe" du menu "Édition" et du menu contextuel

source: Added "Rename object" feature to the "Edit" menu and context menu, with F2 shortcut, to rename the title of the selected object or group
fr: Ajout de la fonctionnalité "Renommer l'objet" au menu "Édition" et au menu contextuel, avec le raccourci F2, pour renommer le titre de l'objet ou du groupe sélectionné
