Repository: DataLab-Platform/DataLab
Catalog: doc/locale/*/LC_MESSAGES/api/gui/roieditor.po
Languages: fr

source: ROI editor
fr: Editeur de ROI

source: The :mod:`datalab.gui.roieditor` module provides the ROI editor widgets for signals and images.
fr: Le module :mod:`datalab.gui.roieditor` fournit les widgets de l'éditeur de ROI pour les signaux et les images.

source: Signal ROI editor
fr: Editeur de ROI de signal

source: Signal ROI Editor
fr: Editeur de ROI de signal

source: Parameters
fr: Paramètres

source: Parent plot dialog
fr: Dialogue de tracé parent

source: Object to edit (:class:`sigima.objects.SignalObj` or :class:`sigima.objects.ImageObj`)
fr: Objet à modifier (:class:`sigima.objects.SignalObj` ou :class:`sigima.objects.ImageObj`)

source: Mode of operation, either "apply" (define ROI, then apply it to selected objects), "extract" (define ROI, then extract data from it), or "define" (define ROI without applying or extracting).
fr: Mode de fonctionnement, soit "apply" (définir le ROI, puis l'appliquer aux objets sélectionnés), "extract" (définir le ROI, puis extraire les données) ou "define" (définir le ROI sans appliquer ni extraire).

source: Optional plot item to add to the plot (if None, a new item is created from the object)
fr: Élément de tracé facultatif à ajouter au tracé (si None, un nouvel élément est créé à partir de l'objet)

source: Get object ROI class
fr: Obtenir la classe ROI de l'objet

source: Add tools to plot dialog
fr: Ajouter des outils au dialogue de tracé

source: Manually add segment ROI
fr: Ajouter manuellement un segment ROI

source: Create coordinate-based ROI actions
fr: Créer des actions ROI basées sur les coordonnées

source: Image ROI editor
fr: Editeur de ROI d'image

source: Image ROI Editor
fr: Editeur de ROI d'image

source: Manually add image ROI
fr: Ajouter manuellement un ROI d'image

source: Setup items
fr: Configurer les éléments
